[{"title": "I love the idea of this sub. Lets grow it!", "text": "I'm a trans woman. A real trans woman. Dysphoria, hrt for 3 years, STRICTLY BINARY, and fucking sick of getting kicked out of trans spaces by the ever prevalent non-binary gender trenders. idk whos on this sub right now, who checks it, or whatever. But if someone sees this and feels the same way, PM me. lets get some traffic here. True trans traffic.", "date": "2017-04-10 13:11:36", "subreddit": "truscum", "permalink": "/r/truscum/comments/64jhal/i_love_the_idea_of_this_sub_lets_grow_it/", "author": "Toastkitty11"}, {"title": "Do you think this will all blow over?", "text": "Once the transtrenders realize that what they're doing is stupid, I'm not sure it's all gonna blow over and all be fine. Apparently, something similar like this happened in the 90s, with gay becoming a trend, and straight people pretending to be gay so they could get attention. Once they realized that what they were doing was stupid, they didn't just stop and leave the LGBT community alone. Most of them became anti gay rights activists. They're a big part of the reason why homophobia was, and in some places in the US, like where I live, is still, a big epidemic. I think something similar will happen when these transtrenders come to their senses. I'm pretty sure most of them will become anti trans activists, because they think that what crap THEY were doing is what an actual trans person does. If it gets bad enough, transphobia could become the new homophobia. I'm pretty sure these transtrenders will completely destroy all progress that trans people made to be considered equal. Trans suicide rates will be through the roof. They already are, but it's just gonna get worse. Believe it or not, gay people were actually making a lot of progress in the 70s, and \n1940s Germany used to be a pretty accepting place for gay people until Hitler came to power and y'know... all that HOLOCAUST STUFF. Gay people were making lots of progress. But something came to destroy it completely. I think that's what is about to happen to us trans people. The sad part is, the damage has already been done, and there's nothing we can do about it now. I'm a trans youth that discovered I was trans right when it was kind of starting to be accepted. I then watched it become a trend as I was brainwashed into the mass of SJWs. I eventually came to my senses, and now I'm seeing trans people become more and more hated because of these transtrenders ruining our reputation. Once transtrenders come to their senses, which will be pretty soon since some of them are going on hormones, and once they regret it they'll all start crying to their youtube subscribers, everything will hit the fan at once for trans people. It appalls me that we let these people do this to the LGBT community. I used to be hopeful that things would get better. Now I know things can only get worse.", "date": "2017-05-01 22:27:12", "subreddit": "truscum", "permalink": "/r/truscum/comments/68p87z/do_you_think_this_will_all_blow_over/", "author": "Raging_Ross"}, {"title": "Is the term truscum offensive?", "text": "I read that the origin of this term comes from certain Tumblr communities that intended for the term to be rude and insulting. Does it make sense to reclaim the term, or are there other words that can better describe the school of thought that the sub's about?", "date": "2017-05-24 23:08:11", "subreddit": "truscum", "permalink": "/r/truscum/comments/6d5ru2/is_the_term_truscum_offensive/", "author": "olebuttermilksky"}, {"title": "What, exactly, makes the difference between a \"trandstrender\" and somebody who is genuinely transgender?", "text": "If you look through my post history, you'll find that I don't really believe in the concept, but I'm always eager to see the world through different perspectives.", "date": "2017-07-01 04:35:29", "subreddit": "truscum", "permalink": "/r/truscum/comments/6kl3sd/what_exactly_makes_the_difference_between_a/", "author": "DragCoeffecient"}, {"title": "Transtrenders at my school", "text": "[deleted]", "date": "2017-07-01 17:29:37", "subreddit": "truscum", "permalink": "/r/truscum/comments/6ko9ge/transtrenders_at_my_school/", "author": "[deleted]"}, {"title": "most \"trans support group\" aren't very supportive", "text": "this trans support group I went to on campus was just a hole for feminism\nit felt like it was under the guise of support just to get questioning people into their ideology\nthey always seem to be fueled by feminism instead of actually being a support group for people with gender dysphoria\n\nLike I wanna be able open up about my personal experience without \"invading a safespace\" just because of how I say things, or the way I think\n\nthere are too many things that I would say that will cause so many people to get all \"triggered\" and hate on me because I don't believe there are more than two genders, or that you need dysphoria to be trans, or how I think that non binary is more or less politically fueled by feminism rather than actually being a real thing.\n\nthey always say that it's for \"liberation of the marginalized\" but you know, I've never felt more constricted or so afraid to say what I want to say, like I'm walking on egg shells, than I ever have in a //support group//\n\nugh\n\nI feel like \"non binaries\" are trying to find \"support\" and \"affirmation\" of their idealogy so they're the ones who create the groups so they can have a weekly affirmation that what they're doing isn't bullshit\nlike im not mad about them finding affirmation for whatever they think, they can create any group they want to\n\nbut the reason im mad about this is that they're labeled as \"trans support groups\" therefore completely delegitimizing actual binary trans people from having support groups specifically for them\nlike actual support groups\ntherapeutic groups\nthat help other people deal with dysphoria shit\n\nbut I feel like if you bring up the fact dysphoria is a thing, they'd be like \"well you do realize you don't need dysphoria to be trans\"\nTHEN WHAT THE FUCK?? THAT MEANS ANYONE CAN BE TRANS, AND THAT'S NOT EVEN WHAT TRANSGENDERISM IS. fuckin\n\nand if you try to have a support group that excludes the snowflakes, we'd be accused of being discriminatory or whatever\n\nIm so fucking pissed rn\n\nlike I feel like shit would fly if I started a \"gender dysphoria support group\" because that'd be \"exclusionary\" and \"transphobic\"\n\nI literally just want a place where I can get support that I need without getting indoctrinated by feminism\n\nfucking hell\n\nLike the meeting was about coming out stories and shit, and one person was talking about how they had a girlfriend, and at the time both of them identified as non binary, but then the girlfriend broke up with them, and they went their separate ways\nbut then they said they saw a \"transphobic\" post she had posted and they made sure that it was her,\nshe decided that she wasn't really non binary after she discovered Blaire White,\nand then groans went throughout the room\n(BTW the non binary person telling the story ran the group itself, soo🙄🙄🙄) \n\nthey thought Blaire was the worst person ever\n\nand Im like\n\nisn't this a place to support trans people??? and not hate on them just because they have different opinions?\n\nit was an odd sense of alienation\n\nLike I feel like if I were to be as real as possible, such as a support group should be, I would just get shat on for being wrong or spreading transphobia\n\nyaknow doe a group thats supposed to be super inclusive, they're oddly exclusionary to difference in thought\n\n\nSorry if this is a bit disjointed and super stream-of-consciousness-ey but Im just super fired up about this\n\nI just want to find a group that's more of a support group than a weekly political get together \nso if yall could point me that way, that'd be great\n\ntl;dr this trans support group that went to wasn't very supportive and was just an echo chamber of feminism and Im pissed about it, and I want to find a group that's not like that ", "date": "2017-10-07 23:31:48", "subreddit": "truscum", "permalink": "/r/truscum/comments/74ybca/most_trans_support_group_arent_very_supportive/", "author": "stefsharp"}, {"title": "Im proud to be truscum!", "text": "[deleted]", "date": "2017-12-15 19:56:30", "subreddit": "truscum", "permalink": "/r/truscum/comments/7k25x3/im_proud_to_be_truscum/", "author": "[deleted]"}, {"title": "Tucutes make me want to die [VENT]", "text": "theyre ruining actual trans people. i need help and people dont understand because \"\"\"'other trans* ppl i know dont have dysphoria :///\"\"\"\" so i'm sitting here fucked in a corner while \"genderfluid nonbinary demigirl dragonkin soft bois uwu\"s are running about stealing our label that we /need/ and if we dare object to them, we're the transphobes. what the /FUCK/\n\nok sorry vent over ", "date": "2017-12-19 03:18:25", "subreddit": "truscum", "permalink": "/r/truscum/comments/7kqijs/tucutes_make_me_want_to_die_vent/", "author": "opossumsaregods"}, {"title": "So I'm actually a bi (male leaning most of the time) trans man (vent)", "text": "and I'm afraid I won't be able to go on T because of it. I am so afraid, that just because I act really gay most of the time, I will be refused HRT. then what will I do? that's my only reason for living right now, is to be able to die happy because my dysphoria was finally gone and my body was correct. but all these \"gay soft trans** boys uwuwuw\" who are just straight girls are making it harder and harder for actual gay/bi trans guys to get HRT. it's pissing me off, making me sad, and it's worrying me. ", "date": "2017-12-26 06:05:19", "subreddit": "truscum", "permalink": "/r/truscum/comments/7m654n/so_im_actually_a_bi_male_leaning_most_of_the_time/", "author": "opossumsaregods"}]