[{"title": "Is this sub active?", "text": "Hello i just found out I'm truscum appointmently. I was banned from asktransgender for expressing that i think u have to medically transition to be truly trans. I hate being grouped together with people who just cross dress and say they are trans. They aren't the same as me. I have a medical condition. I don't just \"identify\" as female. I have a female brain and i needed hormones to feel right. ", "date": "2018-03-29 07:21:11", "subreddit": "truscum", "permalink": "/r/truscum/comments/87zc9d/is_this_sub_active/", "author": "cally1789"}, {"title": "Trans friend of mine talking about radfems. Thoughts?", "text": "", "date": "2018-04-06 07:19:17", "subreddit": "truscum", "permalink": "/r/truscum/comments/8a7klr/trans_friend_of_mine_talking_about_radfems/", "author": "LaRiflessiva"}, {"title": "What is the other sub like this?", "text": "I saw this post:\n\nhttps://www.reddit.com/r/asktransgender/comments/8at839/another_transphobic_subreddit/\n\nWhich those poor transtrenders accuse actual trans people of being transphobic, lol.\n\nJust wondering if anyone actually saw what the sub was? I would like to join and support it, as a true transperson.", "date": "2018-04-10 21:16:16", "subreddit": "truscum", "permalink": "/r/truscum/comments/8bbhft/what_is_the_other_sub_like_this/", "author": "Zurlly"}, {"title": "Transsexual vlogger setting out why Enbies need to back off from the trans label", "text": "", "date": "2018-04-15 07:39:12", "subreddit": "truscum", "permalink": "/r/truscum/comments/8cdrde/transsexual_vlogger_setting_out_why_enbies_need/", "author": "LaRiflessiva"}, {"title": "Truscum servers!", "text": "So I co own one of these servers! They’re on discord. (cis and trans women welcome) [female only](https://discord.gg/G3HqsHj) and this one is open to [any truscum](https://discord.gg/MZp8NZG)", "date": "2018-04-15 23:01:02", "subreddit": "truscum", "permalink": "/r/truscum/comments/8cj0n6/truscum_servers/", "author": "Elimko"}, {"title": "Am I the only one who thinks that putting \"trans\" in a bio is ridiculous?", "text": "[deleted]", "date": "2018-05-13 20:59:29", "subreddit": "truscum", "permalink": "/r/truscum/comments/8j6xi0/am_i_the_only_one_who_thinks_that_putting_trans/", "author": "[deleted]"}, {"title": "I was banned from the ftm reddit page, for this...keep in mind this was my original post just discussing conservative trans men", "text": "[deleted]", "date": "2018-06-29 00:34:23", "subreddit": "truscum", "permalink": "/r/truscum/comments/8uov9v/i_was_banned_from_the_ftm_reddit_page_for/", "author": "[deleted]"}, {"title": "Gatekeeping", "text": "Hello there,\n\nI am just a cis male, who happens to have an interest in the taxonomy of transsexuality.  \n\nI have a friend who came out as trans maybe 4-5 years ago now, and that was really my first exposure to transsexuality as a concept.  Personally, I suspect my friend is not an actual trans person - if there is such a thing as autogynephilia, that is him.  But I fear I'm getting ahead of myself here.\n\nI have read all sorts of literature.  I am familiar with the Blanchard typologies, and subscribe to [Rod Fleming on youtube](https://www.youtube.com/watch?v=xBITj9g0q1Q).  I have, for a couple years now, followed the RadFem/GenderCritical communities, and understand their specific complaints.  I spend quite a lot of time on /r/changemyview debating on the actual science behind transsexuality - most specifically the differences in underlying brain structure, etc.\n\nAt some point, I had come to the conclusion that \"transsexual\" and \"transgender\" were two different things.  I defined transsexual as someone who has Gender Dysphoria, and intends to, or has undergone medical transition - which is specifically NOT limited to hormone therapy - my suspicion is trans people are likely to seek actual gender reassignment surgery.  I also suspect that there are very likely biological markers that could be used to identify someone who is transsexual.\n\nThat leads me to my title: I am gatekeeping.  I only just recently heard the terms \"transmedicalist\" and \"truscum\", which is what has led me here.  You are also \"gatekeeping\", or as I see it, ensuring that people who consider themselves \"transgender\" are not appropriating terminology for your actual condition.\n\nSo now that I'm here, and you know a little bit about me, I was wondering if you might help me better understand your position.\n\nFor instance, do you folks subscribe to the Blanchard typologies?  Specifically: autogynephilic (AGP) males are people who fetishize about themselves as females, and are sexually aroused of the thought of themselves having, e.g., female genitalia; and homosexual transsexuals (HSTS), who are male and androphilic, or female and gynephilic, and who seek to fulfill the role associated with their sexuality (MtF seek to be penetrated; FtM seek to penetrate).\n\nI have had a little trouble grasping the Blanchard typologies fully.  I suspect there certainly are AGPs that are not actual transsexuals, and are fetishists - but I'm not sure if HSTS is a complete picture of actual transsexuals.  Rod Fleming, who is not a scientists, but a journalist IIRC, has refined those definitions as above, and has basically stated (in the link I provided to him) that transsexuality is just that: someone who's gender identity is indicative of their sexuality, and their sexuality is that of the opposite sex; so therefore a MtF must be homosexual (androphilic), and seek to fulfill the female sex role.  Again, I've had trouble with this, but some of the research, specifically into the fractional anisotropy of white matter in various brain regions, has shown a clear linear pattern that shows the mean FA for heterosexual males being highest, followed by homosexual males, followed by MtF, followed by FtM, followed by homosexual women, followed by heterosexual women.  So it seems logical that someone who is MtF is just more so sexually orientated toward the female side of the house than even homosexual men.\n\nThat said, not being trans, it works for me to use those classifications - but I'm not sure if its actually related to the lived experienced.  So with that said, I came to ask you folks, as, you seem to share my views on gatekeeping, what your opinions are, and to gain a better understanding here.\n\nDisclaimer:  I hope this is not offensive to you.  I suspect you lot are not quite as quick to jump to SJW tactics like the trenders seem to be, so I suspect my inquiry is not offensive, but thought I would throw that in there.  Please feel free to be frank.", "date": "2018-07-11 14:59:18", "subreddit": "truscum", "permalink": "/r/truscum/comments/8y0aix/gatekeeping/", "author": "omrsafetyo"}, {"title": "r/transtimelines mods are very radical in their trans ideology, yet virtually every single post is a CLEARLY binary trans person", "text": "[deleted]", "date": "2018-07-16 01:32:56", "subreddit": "truscum", "permalink": "/r/truscum/comments/8z6ulb/rtranstimelines_mods_are_very_radical_in_their/", "author": "[deleted]"}, {"title": "College is trying to force me to be an outcast instead of treating me like a normal human being.", "text": "I want to have a roommate who simply doesn’t care that I’m transgender, and isn’t gonna make a big deal about it one way or another. Someone who has the mutual understanding that I’m just another human being, they know I’m trans, and it’s not a big deal to them, so I’m treated just as any cis person would be. This is litterally textbook definition of what acceptance is, and anyone who wants anything else and claims that they want acceptance doesn’t understand this. I look cis, I sound cis, I act cis. I basically am cis, people who have known me for years are still surprised when I tell them that I’m trans. Of course I’d tell my roommate beforehand that I’m trans, and if it was a problem, I would just share a room with someone else. Ideally the college would have a checkbox “would you be ok if you had a transgender roommate” Gender Inclusive housing is still an option, but it’s exactly that, optional. There’s a lot of people in my college, I’m sure that there’s a least one person in my school who doesn’t care that I’m trans.\n\nHonestly I’m so grateful that I pass, it’s a blessing, but honestly it’s all made me realize that I’m really sick of having this transgender label always slapped around at me, preventing me from doing otherwise normal things that any normal girl would do without a problem. I shouldn’t have to be sent off to another dorm because I just so happened to be born in the wrong body, it’s not something I can control, and besides the fact that I’m trans, I’m no different than any other cis girl. I don’t know why it’s so hard for people to understand that people who are litterally afraid of their own genitals aren’t gonna cause any problems. It’s an unwarranted fear, and I’d honestly be more concerned about gay people sexually assaulting their roommates, I mean, don’t we separate male and female students specifically to prevent that sort of thing? Plus, the person assaulted probably wouldn’t come out about it 1. Out of fear of their manhood 2. Because people don’t like to see anyone that’s gay put in any sort bad of light, as it could be misinterpreted as “gay people are bad” so people generally don’t like to believe that a gay person could do that, when in reality they’re no different from straight people other than the fact that they like different people. The worst transphobia I’ve ever seen was in the LGBT community. Straight people typically just don’t care that much one way or another. Everyone I know surprisingly didn’t care except one family member who’s religious, and tried to convince me to “stay the way god made me” in a pretty respectful manner. Of course, I never chose to be trans, I’ve always just been a girl, and he’s misguided, but at least he means well by it. If I wasn’t trans I don’t know what I’d believe. It was far more tame compared to what the worst of the LGB people have said to me, he wasn’t a bad person.\n\nAnyway, My college is going to tell me that I need to “request” (if they’re making me do it then it’s not a request, they just use nicer language to try to get everyone on their side) “gender inclusive housing” and they disguise their transphobia as “gender inclusive” to trick people into falling for it, because they want trans people to think “oh wow the school is offering me housing where I can feel safe!” You’d feel perfectly safe with a cis person who accepted you, they simply want the cis people to feel safe from a non-threat, and they don’t want to deal with the “burden” of having to plan out where each individual trans people would go based on who will accept them, it’s just much easier to be like “let’s just have all the trans people live here, because acceptance!”\n\nAnd they think that that’s a perfect solution. It’s not. This whole thing, even if it’s probably not intentional, is manipulative, and I hate it. And as a way to deflect attention from all of this, the school’s almost rave about how great gay people are, and what they do to support them they practically ignore trans issues unless they absolutely have to talk about it. That’s what’s so frustrating about having trans forced into this “spectrum” of people who respectfully have nothing to do with us. Trans people deserves our own movement away from the LGBQ community. I’ve seen all of this happen time and time again and no one ever speaks up about it or says anything about it. Having us under an umbrella is an attempt to lessen us, and they want to sneakily silence us again by trying to convince us that non-binary people are also transgender (which they respectfully aren’t, they’re their own thing, I’m not here to claim that I know if it’s a real thing or not, all I know is that whatever it is, it’s not trans.) and when we try to explain all of this to them, we’re told that it’s “wrong” to ask for a word like transsexual that properly distinguishes transgender and non binary people from each other. We’re told that the word is offensive and “outdated”. I’m 18 years old, before Caitlyn Jenner happened (I came out in 2014, thank god.) Transsexual was still a pretty commonplace term. Back then basically no one knew that being trans was even a thing, and despite the media portraying us like a joke, there wasn’t a bunch of public hate towards us, and you could talk to someone irl about it and they’d usually treat you like a normal person.\n\nSadly transgender is the term everyone already knows and is farmiliar with though, and this whole “non binary trans” BS is thankfully pretty rare at this point in time (which is why we need to stop it NOW). but in my personal life I would much, much prefer to be called transsexual. I don’t understand what’s wrong with “Sexualizing it” when it’s literally a term that describes to someone changing their sex\n\nNOBODY calls themselves binary transgender in the real world outside of the LGBTQIA+ cult, it’s absolutely absurd. They don’t want us to have a voice, because trans people are literally the most normal people in the whole LGBTQIA+ politically motivated cult. THEY are secretly the oppressors, and I don’t even think that they realize it. The goal of the LGBTQIA+ cult is get as many “oppressed people” under one umbrella and get them all to vote Democrat. I’ve been to support groups, (had horrible experiences every time) and if you don’t align with them politically (I’m a right-leaning independent) they’ll try to guilt trip you into it, and if it’s clear you’re *gasp* NOT a Democrat, and you voice your opinion, they’ll kick you out, and eliminate your voice all together (ironic when they claim they that want to give all LGBT people a voice) it’s honestly disgusting, and this needs to be pointed out.\n\nWhen my college tells me that I need to “request” gender inclusive housing, I’ll simply respond with “Oh, I thought that was optional” and see how they respond to that.\n\nThey’re whole “we support LGBT people!” Is BS and their support for trans people stops as soon it’s not convient for them.\n\nI don’t want to be forced to move in with a bunch of gay and trans people. Simple as that. Treat me like a normal human being and I’ll respect you just like anyone else would. I’m sure that there’s at least one person in the school that isn’t gonna care that I’m trans, or maybe to them these are just solutions to things these people don’t even know are problems. I’m sorry but I don’t wanna be seen as an outcast, and I shouldn’t be forced to be one.\n\nThank you for reading this, spread the word, people need to know about this. Publicity = normalization, they know this which is why they always try to silence us, despite try to convince us that we “have a voice”.  Which is only true if you’re a democrat. I have no problem with these people existing, my problem is them trying to force me to be like them when I’m not.\n\n- Anon Trans Girl", "date": "2018-08-09 20:28:51", "subreddit": "truscum", "permalink": "/r/truscum/comments/9604tv/college_is_trying_to_force_me_to_be_an_outcast/", "author": "MainMasterpiece"}, {"title": "how do you all feel about nonbinary genders?", "text": "i'm a transmale and i believe that there are only two genders because there isn't any scientific evidence that i've found showing that it's possible to be both or neither or even change between them. however, i know a few dysphoric nonbinary people who are uncomfortable with their birth sex but wouldn't want to transition to the opposite sex. rather, they're uncomfortable with both but don't know how they'd transition. i know a lot of people feel differently about the issue so maybe i could get a second opinion on this?", "date": "2018-09-17 01:25:10", "subreddit": "truscum", "permalink": "/r/truscum/comments/9gg288/how_do_you_all_feel_about_nonbinary_genders/", "author": "lowkeyparanoidboy"}, {"title": "Gender euphoria vs. dysphoria/incongruence?", "text": "I would consider myself a truscum, but I believe that individuals with gender euphoria and no dysphoria could still be trans.\n\n&amp;#x200B;\n\nI see it this way because I see euphoria as another form of gender incongruence, just as dysphoria is. Is this a common truscum belief, or is this just me? Can I still be truscum if I believe this and it's not common?  \n\n\nEDIT: By the way, I did read the main post. I'm not quite sure what it means by saying euphoria just BS, though, considering it's still a form of incongruence.", "date": "2018-09-17 20:29:42", "subreddit": "truscum", "permalink": "/r/truscum/comments/9gnzxp/gender_euphoria_vs_dysphoriaincongruence/", "author": "420conradical69"}, {"title": "Question about gender dysphoria diagnosis", "text": "[deleted]", "date": "2018-09-22 12:20:18", "subreddit": "truscum", "permalink": "/r/truscum/comments/9hza1u/question_about_gender_dysphoria_diagnosis/", "author": "[deleted]"}, {"title": "Justified to transition and is this dysphoria?", "text": " I don't have access to a gender therapist, and I believe you must have dysphoria to transition. However, I'm confused as to if I have it or not.\n\nTrigger warning: biology, ftm dysphoria(?)\nAFAB\nEver since I was little, I insisted I was a boy, or wanted to be a boy. I even asked to be a boy when I sat on Santa's lap as a 5 year old. I know I would be happier as a male. But here's the catch: I have no top or bottom dysphoria. I do, however, dislike my hips and shoulders. It makes me feel... light headed? Weird? But I recoginize it is my body, there is no disassociation. I can definitely live as a girl, but I would be more confident as a male. I feel like a lower voice would take some getting used to, but I would be more comfortable. I'm very socially anxious, and I think part of it is potentially gender related. If I had a penis, no chest, masculine features, and a deep voice, I would feel so much better when talking to people, doing daily activities, and even being by myself.\n\nIs this dysphoria?\nWould a transition be justified?\nWould it be disrespectful to experiment with binders and he/him pronouns(no T or surgery) until I can figure everything out, as long as I mention I am questioning. As a lesbian(I guess that's what I call myself for now until I figure it out), I am very supportive of the T in LGBT, and don't want to damage the transgender community. I just want to be a normal guy, not some jar of mayonaisse or some other weird tucute shit.\n\nEDIT: format", "date": "2018-10-16 04:32:56", "subreddit": "truscum", "permalink": "/r/truscum/comments/9okbwe/justified_to_transition_and_is_this_dysphoria/", "author": "_hip_hop_"}, {"title": "i don't think that gender dysphoria is a mental illness", "text": "but i still consider myself truscum because i don't think that people without dysphoria are actually transgender. i believe dysphoria is a requirement and there's no reason to even be trans without it.\n\nhomosexuality was considered a mental illness but it's not and i think gender dysphoria is kinda the same thing. \n\ni believe that some people are born transgender with gender dysphoria just like how some people are born black and being black is in their dna. \n\ni think it holds trans people back to consider what makes us who we are is a mental illness. i don't feel mentally ill about my gender. i think the grid lock that trans people have to go through to get hrt/surgery because its classified as a mental illness is stupid. i know why that  stuff is in place because some people are confused or transtrenders, but its still fucked up. \n\nwhat do you guys think?", "date": "2018-10-22 01:19:26", "subreddit": "truscum", "permalink": "/r/truscum/comments/9q92lf/i_dont_think_that_gender_dysphoria_is_a_mental/", "author": "2lazzarus"}, {"title": "sources??", "text": "i’m doing an essay on why you need dysphoria to be trans and if you could, i need some website sources along with some against it. Here are my current sources.\n\nfor:\n[proving there are trans brains](http://globalnews.ca/news/4223342/transgender-brain-scan-research/)\n\n[a video on it](http://www.youtube.com/watch?v=MitqjSYtwrQ)\n\nAgainst:\n[“gatekeeping”](http://letsqueerthingsup.com/2015/03/28/why-the-trans-community-needs-to-ban-the-word-transtrender-for-good/)", "date": "2018-11-27 21:52:23", "subreddit": "truscum", "permalink": "/r/truscum/comments/a0zgv5/sources/", "author": "haydensucks"}, {"title": "Help", "text": "I'm writing a speech on why we can't demedicalize transgenderism. I'm having a hard time finding sources as all that comes up in a google search is tucute videos and blogs, can anyone help? ", "date": "2018-12-04 16:01:15", "subreddit": "truscum", "permalink": "/r/truscum/comments/a31xv8/help/", "author": "AffectionateMost12"}, {"title": "Opinions on this article?", "text": "[https://www.teenvogue.com/story/trans-masculine-non-binary-conversation-affirmation-identity-beauty?fbclid=IwAR3\\_chVn2BSkjfy1UH3FC2Q5D6MaMFeHRfrhXeFDwS4cMthLTES2iZtLRPI](https://www.teenvogue.com/story/trans-masculine-non-binary-conversation-affirmation-identity-beauty?fbclid=IwAR3_chVn2BSkjfy1UH3FC2Q5D6MaMFeHRfrhXeFDwS4cMthLTES2iZtLRPI)", "date": "2018-12-11 04:08:02", "subreddit": "truscum", "permalink": "/r/truscum/comments/a53diq/opinions_on_this_article/", "author": "blu3boi"}, {"title": "Tucutes...", "text": "Ive lost multiple irl friends bc of my transmedicalist beliefs. They are so frustrating and idk how they dont see that they are wrong and hurting trans people. Mind you that all the problematic tucutes ive met are legitimately cis", "date": "2018-12-17 01:29:38", "subreddit": "truscum", "permalink": "/r/truscum/comments/a6v48d/tucutes/", "author": "BossKiwinyan"}, {"title": "Evewyone is vewy vawid UwU", "text": "Who gets tired of hearing this all the time? \"You're valid\" is pretty much just code for \"it's okay to claim a sexual minority status that doesn't apply to you and shut down criticism you get for doing so.\" It's a way of sealing off the door to the echo chamber so to speak.", "date": "2018-12-19 20:58:42", "subreddit": "truscum", "permalink": "/r/truscum/comments/a7qic8/evewyone_is_vewy_vawid_uwu/", "author": "anonspergers"}, {"title": "WAKE ME UP (wake me up inside)", "text": "", "date": "2018-12-19 21:13:20", "subreddit": "truscum", "permalink": "/r/truscum/comments/a7qnhd/wake_me_up_wake_me_up_inside/", "author": "RidersOfAmaria"}, {"title": "Anybody else confused by \"dysphoric\" tittybois?", "text": "Why do trans guys who claim to have such bad top dysphoria accompany saying that with a photo of their chests not binded with massive cleavage? What?? How does that even add up?", "date": "2018-12-26 23:33:27", "subreddit": "truscum", "permalink": "/r/truscum/comments/a9tlh3/anybody_else_confused_by_dysphoric_tittybois/", "author": "snake-gov"}, {"title": "It makes me so mad", "text": "It makes me so mad. A ‘trans’ kid who is very obviously not trans(still presents female despite living in an extremely over the top liberal area, and having accepting parents and friends), wears makeup, painted nails, the whole shebang, is now on testosterone. As someone who had to fight to get testosterone despite having been out for three years it makes me so mad that someone could get their hands on testosterone despite obviously not being trans. Me and my friends were talking about it(none of them know I’m trans) and although they were also pissed off about it they didn’t understand why it made me so mad. It’s something I see a lot, especially seeing that I live near SF in California so it’s very liberal. A few weeks ago another supposedly trans person told me they could get top surgery at any point. They had come out that school year. How is it okay that someone who has come out as trans for less than six months can get top surgery at 16? This person is also very obviously not trans. It’s just so sad that people would do this to their bodies to be cool and fit in. I know this is very long but it’s been weighing on me and my friends don’t understand because they aren’t trans and haven’t had to go through the same experiences  as me. ", "date": "2018-12-28 04:32:00", "subreddit": "truscum", "permalink": "/r/truscum/comments/aa6ydw/it_makes_me_so_mad/", "author": "bigchinnychinchinboy"}, {"title": "r/traaaaaaaans", "text": "Was subscribed to r/traaaaaaaans for a while because the memes are decent and I was managing to handle some of the cringe... \nUntil I saw someone post an article about NYC apparently allowing \"trans\" people to change their gender to male, female or \"X\" without having to consult a doctor. Not sure if it's legit but I thought it was completely stupid and unrealistic to let people change their gender without having to be even diagnosed as trans by a doctor..\n\nBut the comments were all just \"This is great! Can this be an international thing?\" and I realised that I likely couldn't even have commented my opinion without being downvoted to oblivion and probably banned. What kind of shit is this where having the opinion of simply thinking that being able to randomly change your legal gender without consulting a doctor, being a very bad idea, suddenly makes you a transphobic dick.\n\nBtw I am trans myself and being able to just click my fingers and be legally recognised as male would be awesome, but even I know it'd be a really fucking stupid idea. Anyone who's actually experiencing dysphoria will be willing to commit enough to make sure that they one day can change their gender. Again, I'm not sure if it was real because I didn't even want to check in case it was, but regardless, a LOT of people felt it would be a good idea and that in of itself is pretty worrying. Not to mention the non-binary option what even the fuck??", "date": "2018-12-31 13:08:37", "subreddit": "truscum", "permalink": "/r/truscum/comments/ab6z38/rtraaaaaaaans/", "author": "whatsablurryface21"}, {"title": "\"Transtrenders don't exist\"", "text": "I don't understand this argument. People have literally admitted to having been transtrenders -- it's like saying nobody's ever pretended to be straight for social security. \n\nWhen I came out as trans, the kid at my school who was known to be a liar came out a week later. They never transitioned, despite saying their family was supporting them. They got angry when anyone asked them how their transition was going and ignored me when I asked if they wanted me to take them out shopping for new clothes or help them with their transition, even just emotionally. It did get them a few days of popularity at my school, though.\n\nWhat's that supposed to be, if transtrenders don't exist?", "date": "2018-12-31 21:33:46", "subreddit": "truscum", "permalink": "/r/truscum/comments/abbi61/transtrenders_dont_exist/", "author": "420conradical69"}]