[{"title": "Confusion. Help.", "text": " do not like being a woman. I never have. I've never felt like one. However, I don't want to be a man either. I feel like I am my special thing. Of course, that isn't an option when you fill out questionnaires, so I always put female to make it easier for people but I'm never comfortable doing it.\n\nI wear women's clothing. The only reason I do is because I don't like men's clothing. I wish all clothing was considered gender neutral so I wouldn't to wear gender specific clothing. I want what I wear to just be clothes.\n\nI am sexually attracted to men, but I'm not attracted to their genitals. Penises just look disgusting to me. So do vaginas. I become aroused by bodies and minds, not sexual organs.\n\nI have no idea how to identify myself. \n\nWhat do you all think? I'd love to hear insight from others. This is something that has plagued me for many years.\n\nOr maybe I'm just weird.\n\n", "date": "2016-01-01 07:59:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3z011s/confusion_help/", "author": "fbdvbxab", "reference": 24}, {"title": "Looking for somewhere to chat? Join us on Transcord, featuring private Non-Binary rooms", "text": "Hey everyone,\n\nI help run a new text/voice chat server called Transcord. I've noticed that in a lot of other previous support servers, there hasn't been much of an effort in reaching out to the Genderqueer/Non-Binary communities. I hope to change that with Transcord. We're a very open server, and welcome anyone that's trans, non-binary, questioning, or an ally. We feature private Non-Binary rooms and as a mod team are always open to suggestions and critique. Feel free to check us out if you'd like. Looking forward to seeing you folks!\n\nhttp://www.transcord.org", "date": "2016-01-04 04:37:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zd9se/looking_for_somewhere_to_chat_join_us_on/", "author": "PrettyMinstrelGirl", "reference": 209}, {"title": "Don't know why I came out.", "text": "[deleted]", "date": "2016-01-04 10:48:52", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zebqz/dont_know_why_i_came_out/", "author": "[deleted]", "reference": 226}, {"title": "It's hard to move on.", "text": "[deleted]", "date": "2016-01-04 11:39:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zegkm/its_hard_to_move_on/", "author": "[deleted]", "reference": 228}, {"title": "Just thinking.", "text": "[deleted]", "date": "2016-01-04 12:30:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zelj5/just_thinking/", "author": "[deleted]", "reference": 229}, {"title": "I think I worry a lot.", "text": "[deleted]", "date": "2016-01-04 13:20:55", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zeqoy/i_think_i_worry_a_lot/", "author": "[deleted]", "reference": 233}, {"title": "Help a cis male understand please", "text": "For a long time I have been confused as to whether I agree about the validity of the concept of transgenderism and non-binary genders.\n\nI'm a cis male and I've been pretty impartial towards the idea throughout most of my life, though I definitely can wager arguments I have for and against it. \n\nBefore I feel strongly one way or the other, I'd really like to talk to someone within the community who was educated about it so that perhaps my perspective could be changed.\n\nAs someone from the outside is quite challenging to appraoch this without feeling afraid of offending someone so I haven't really appraoched someone who feels strongly in favour of non-binary genders.\n\nPlease PM me if you'd like to talk, understand that I will be arguing  against the idea for the sake of reaching a good conclusion about it.", "date": "2016-01-04 15:24:39", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zf6ju/help_a_cis_male_understand_please/", "author": "Wowbad", "reference": 236}, {"title": "Can't go outside.", "text": "[deleted]", "date": "2016-01-04 17:21:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zfnqg/cant_go_outside/", "author": "[deleted]", "reference": 245}, {"title": "Integration, not Transition", "text": "This is where I am right now – and this is how I’ve felt for a long time, but I know it can change. \n\nI’m a non-binary person and discovering more and more of my identity makes life seem less and less of a mystery. I’m finding things out about myself that have *always been there* and make so much sense. \n\nThat’s not to say there isn’t confusion. There’s *massive* confusion most of the time, but in the moments that I push past the confusion, everything is so clear. I feel like I’m becoming myself.\n\nIt all takes time. And what time is making me realize that non-binary transition may not be about taking hormones or changing my body. It’s about *integrating* expressions, clothing, practices, and ways of thinking into my identity. I am who I always have been. Who we are is always, constantly changing, from one minute, one second to the next. \n\nIt’s not just about gender. It’s about who I am.", "date": "2016-01-06 03:26:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3znw0o/integration_not_transition/", "author": "undoing_gender", "reference": 361}, {"title": "[Survey] Nonbinary/genderqueer survey 2016 is now live! Closes Friday 15th January 2016. (x-post /r/transgender)", "text": "", "date": "2016-01-08 05:29:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/3zzpii/survey_nonbinarygenderqueer_survey_2016_is_now/", "author": "cassolotl", "reference": 527}, {"title": "I'm AMAB, and I'm struggling with the idea of growing breasts.", "text": "My background: 19, AMAB, 8 1/2 months HRT\n\nI did not want breasts at all when I started hormones. In fact, I put off seeing an HRT doctor for 9 months because I was so afraid of growing breasts. I finally got around to it, because the dysphoria had become far greater than my discomfort with having breasts. Ultimately, I've been happy with everything except the breasts. They aren't very big, and I don't think they're that noticeable when I'm wearing a shirt. I think most of it is fat anyways, so I'm hoping that if I lost 10-15 pounds they'd get smaller.\n\nAbout 3 weeks ago I began to realize that I don't want to transition completely. I mistakenly believed that dysphoria = transgender. I don't think I identify as trans anymore, but I'm not really concerned about labels at the moment. I'm mainly worried about living with breasts that I don't want. I'm honestly terrified that they're going to get even bigger. I just really want my flat, bony chest back. Can someone give me some advise?", "date": "2016-01-09 10:21:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/405ujo/im_amab_and_im_struggling_with_the_idea_of/", "author": "youngbeauty", "reference": 629}, {"title": "NonbinaryGamers", "text": "[deleted]", "date": "2016-01-09 18:44:08", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/407gtp/nonbinarygamers/", "author": "[deleted]", "reference": 652}, {"title": "AMABGamersReddit", "text": "[deleted]", "date": "2016-01-09 18:45:32", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/407h19/amabgamersreddit/", "author": "[deleted]", "reference": 653}, {"title": "AFABGamers", "text": "[deleted]", "date": "2016-01-09 18:50:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/407hs9/afabgamers/", "author": "[deleted]", "reference": 654}, {"title": "Need help with getting rid of facial hair [genderqueer AMAB]", "text": "Facial hair is a source of massive dysphoria for me. Shaving doesn't really work because even the closest shave still leaves a 'shadow' and laser removal is too expensive (especially for something that I'd be doing every 6 months). I've been waxing for the past few months, and while it's fantastic for my cheeks,  it stops working once I get to goatee territory. So that's really not sustainable.\n\nDoes anyone have any solutions?", "date": "2016-01-09 23:20:48", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/408nsi/need_help_with_getting_rid_of_facial_hair/", "author": "mtwara", "reference": 676}, {"title": "Any other FtBBs?", "text": "[removed]", "date": "2016-01-11 22:03:31", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/40j5xp/any_other_ftbbs/", "author": "deathcomplex", "reference": 805}, {"title": "What am I?", "text": "I've always felt I was a little different, but until very recently I suppressed it. I just assumed I was straight and acted straight. It was easy, for reasons you'll see below, and didn't cause me much stress. Still...I never quite fit, and after my life got turned upside down three times within five years, I guess it left me questioning a lot of basic assumptions about myself.\n\nI feel like having a label to what I feel would somehow help, or at the very least make it easier to explain to people. When I try to explain it to even my most liberal, open-minded, progressive friends, they end up saying \"just\" and \"only\" a lot. \"Sounds like you're just...\" or \"Oh, that's only...\" when no, it's not just or only. Alright, enough stalling. This is a bullet point list of what I see as the components to my gender/sexuality/orientation (forgive me if I get terminology confused):\n\n * I was assigned male at birth\n * I present as male.\n * I feel like my body is and should be male.\n * I am attracted primarily to women.\n * I am most attracted to a woman who appears hyper-feminine.\n * I am on occasion physically attracted to men.\n * I am attracted to men who appear hyper-masculine\n * I have a very strong libido.\n * I am averse to other people's genitalia (male or female).\n * I reconcile the above mostly via softcore porn from the far reaches of Deviantart (there be dragons).\n * I do, however, enjoy the rest of a lover's body very much, staying on any one stage of foreplay as long as my lover wishes.\n * I am intensely romantic, with a laser-focused emotional tie to my lover, who is the center of my universe when we're together.\n * I will do absolutely anything my lover needs me to...even leave. No hard feelings. If it's over, it's over. Still friends with most of my exes.\n * The last couple I don't consider a mere dating pattern. This intense romantic focus is a part of my identity.\n * My lover has thus far always been female, but I don't discount male or nonbinary lovers as a possibility.\n * I am not comfortable filling a masculine role in society. Like, at all. You could go down a checklist of personality traits you might consider \"feminine,\" and most of them would apply to me.\n * In fact, just go down the left side of this list: http://41.media.tumblr.com/9d267b198014ba86600ea5c97f5ab8b6/tumblr_nbryumwdfQ1tfilauo1_1280.png\n * I prefer women who can check off the right side as much as possible.\n * I envy women's options in clothing, jewelry, makeup, etc. I wish there were distinctly male versions of such things available this century.\n * Despite the last few, I wish to be recognized and present as a man at all times, even if my social role is completely different. However, this is only in physical space.\n * When given the option in a virtual or imaginary space--IE,  whenever my mind is allowed to exist without my body--I will choose a woman to represent my mind every time.\n\nIs there a word for this? Perhaps a smallish collection of words?", "date": "2016-01-12 07:11:55", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/40lg8m/what_am_i/", "author": "LuckyStampede", "reference": 846}, {"title": "Non-binary versus Genderqueer", "text": "Hi folks! I'm curious to know how you landed on using \"non-binary\" as the term that describes you? Why not \"genderqueer,\" if that's an umbrella term too? I guess I'm not sure about the connotations of each term and I'm thinking about which term needs less explanation.\n\nI personally identify as non-binary because it fits who I am, but genderqueer could work too, so I'm trying to figure out what to do through hearing about your experiences. ", "date": "2016-01-15 02:22:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/41101v/nonbinary_versus_genderqueer/", "author": "undoing_gender", "reference": 1055}, {"title": "I think I want to forgo the whole coming out process. (AFAB Nonbinary Transmasc.)", "text": "[deleted]", "date": "2016-01-17 16:01:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/41e331/i_think_i_want_to_forgo_the_whole_coming_out/", "author": "[deleted]", "reference": 1248}, {"title": "The REAL 2 Genders", "text": "[removed]", "date": "2016-01-19 04:06:30", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/41mui3/the_real_2_genders/", "author": "[deleted]", "reference": 1360}, {"title": "Genderfluid hair and make up skills are on point", "text": "", "date": "2016-01-21 23:12:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/422ms7/genderfluid_hair_and_make_up_skills_are_on_point/", "author": "amzhatch", "reference": 1551}, {"title": "Books or articles to help my mom come to terms with my transition?", "text": "I came out as non-binary to my mother earlier in the year. For probably... 5 years now, she's known I was struggling with my sexuality, but questioning my gender was a new one for her. Although on the surface she acts accepting, she struggles with pronouns and has said some majorly homophobic/transphobic things that have made me very uncomfortable. That being said, she is trying and making an effort. She's a very active reader, so I was wondering if anyone had suggestions on books I could get her? Either something informative, or possibly even a nonfiction story to help her better understand what I'm going through? Thanks for any advice (:", "date": "2016-01-24 01:42:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/42dwsn/books_or_articles_to_help_my_mom_come_to_terms/", "author": "EarlyGreyed", "reference": 1695}, {"title": "Confused about gender, gender expression, and lack thereof... Help?!?!", "text": "I think I might be agender or nonbinary. The only thing I know with absolute certainty is that, I am not cis. I'm AFAB, pansexual, and in the closet about my gender only because of my crippling uncertainly about what my gender actually is. For a long while, I thought I might be FtM transgender. This made sense to me, because I felt a desire to present in an andro/ masculine fashion. I also had huge amounts of dysphoria (primarily social) about being constantly gendered as female. In light of wanting to look male-ish and not wanting to be perceived as female, I kind-of categorised myself as FtM. I started dressing more boyishly, scheduled a haircut, but was still uncertain about changing my pronouns, and still did not want to start any form of hormones (though I did strongly consider top surgery).\n\nHowever, I recently started to lapse into a feminine-mode. Generally I seem to have feminine modes, and masculine modes, and androgynous modes, and this made me think I could be genderfluid, but then I realised that even when I was in this feminine-mode... I still got social dysphoria when gendered as female.\n\nAlso, recently, somebody referred to me with the pronoun \"they\" was I was presenting very andro. This literally thrilled me. I was extactic - and what surprised me, was that it felt much more right than being referred to with he/his/him pronouns, as I'd asked one of my friend so that I could experiment with my gender. I loved the neutrality of \"they/them\". It fit.\n\nI'm wondering if any agender people have experienced this? I am currently on a quest to figure out my gender identity and have been stewing for around 8 months, but every time I think I made progress, I just confuse myself again. Help? And thanks for reading!", "date": "2016-01-24 09:17:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/42fai4/confused_about_gender_gender_expression_and_lack/", "author": "chemical_boy_", "reference": 1711}, {"title": "What does this mean? Am I nonbinary?", "text": "[deleted]", "date": "2016-01-24 21:17:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/42hsjs/what_does_this_mean_am_i_nonbinary/", "author": "[deleted]", "reference": 1741}, {"title": "Remember that survey I posted here a couple of weeks back for nonbinary folks? Here's the results. :) 3,000 participants, many pretty graphs! [x-post /r/SampleSize]", "text": "", "date": "2016-01-24 21:38:43", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/42hw6n/remember_that_survey_i_posted_here_a_couple_of/", "author": "cassolotl", "reference": 1745}, {"title": "when did you realize you were nonbinary?", "text": "growing up, like in middle school, if i was ever in a class where it was mostly male students, the girls would always look at me like i was their savior and that immediate sinking feeling i got of “i really cannot relate to you on a level of girlhood like you are expecting me to” should’ve been the big flashing clue that i wasn't a girl\n\ni didn't realize what that necessarily meant for me until way later, of course, since i didn't know nonbinary genders existed until the past couple of years which was like a lightbulb for me.\n\nhow bout the rest of you folks? :&gt;", "date": "2016-01-29 22:37:53", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/43ba76/when_did_you_realize_you_were_nonbinary/", "author": "temmieflakes", "reference": 2129}, {"title": "Anger and depression", "text": "[deleted]", "date": "2016-01-31 21:19:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/43kzlq/anger_and_depression/", "author": "[deleted]", "reference": 2277}, {"title": "Help me build something from this anger?", "text": "Hello everyone,\n\nLately I've been feeling incredibly angry with the world. It feels like every other day I'm called a special snowflake for wanting the people around me to be decent, and respectful of each others gender. Have been accused of being a fascist for asking if a list of pronouns could be extended, among other things.\n\nHow do you slog through all this hatred, bullshit, and lack of knowledge? How do you keep your head up as a non-binary person? It feels like the world is covered in spikes and traps- just waiting for me to fall into, and when I inevitably fall the cis-people around me snigger and say \"what the hell are you so torn up about?\"\n\nI want to work with others. I don't want to carry anger- I can already feel it destroying me from the inside. I also don't know how to let this pain and resentment go when I'm reminded of it everyday.\n\nI can't be the only person who feels this way. What do you do to turn your anger from a destructive force into a constructive one? Or at least to turn the anger into a feeling that doesn't tear you up inside?", "date": "2016-01-31 21:40:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/43l30c/help_me_build_something_from_this_anger/", "author": "GiantNinjaSockMonkey", "reference": 2278}, {"title": "Weird things going on with me; suddenly feeling cis after crushing on someone [X-Post r/asktransgender]", "text": "Hello people. I currently identify as an aromantic bisexual agender transfeminine individual (woah, lots of labels there). Something happened, though, that is shaking me up quite badly on top of the self-doubt that's already there.\n\nYesterday, I fell for a girl at my school. I could only observe her from a distance, and as she smiled, something just clicked.\n\nWhen I have girl crushes, my imagination gets sexual quite quickly, and with this girl, I feel the need to be a cisgender man and not the transgender person that I have been fighting for. This weirds me out because I now feel as though all the work I put into discovering my gender identity is gone with the wind once I'm kind of 'back in my proper role' (&lt;- read manly man). I wanna sleep with my crush, give them a proper fucking, generally just be 'the man they need' (how sexist is that?!).\n\nDysphoria becomes unimportant. The features I hated about my appearance are all of a sudden feeling appropriate. I tell myself I should actually rejoice because the burden of being trans is seemingly only related to me feeling as though I'd 'failed as a man'. But it only makes me more unhappy. I can no longer trust my own judgements. The reasons that make me want to identify as trans seem like a fraud, I become disconnected from myself. \n\nI don't know what the hell is going on with me and I need advice ASAP. It's tearing me up.", "date": "2016-02-06 12:08:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/44fydj/weird_things_going_on_with_me_suddenly_feeling/", "author": "Martha-Helen", "reference": 418}, {"title": "LGBT+ inclusive gaming community! We also have a dedicated, and private, trans channel. Come hang out with us on Discord!", "text": "[deleted]", "date": "2016-02-07 21:57:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/44nti1/lgbt_inclusive_gaming_community_we_also_have_a/", "author": "[deleted]", "reference": 511}, {"title": "Non-binary crush. Advice please.", "text": "[deleted]", "date": "2016-02-09 05:34:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/44v6zs/nonbinary_crush_advice_please/", "author": "[deleted]", "reference": 630}, {"title": "Two questions about facial androgynization surgery", "text": "1. Does facial androgynization surgery actually exist? After all, I myself might very well eventually be interested in such surgery if I will actually be able to afford it. :)\n\n2. How exactly would such surgery be handled for a person such as myself (specifically a person who previously had extremely intense surgery done in order to eliminate his extremely large underbite)?\n\nAny thoughts on these two questions of mine? :)", "date": "2016-02-18 19:16:04", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/46getz/two_questions_about_facial_androgynization_surgery/", "author": "Futurist110", "reference": 1386}, {"title": "Got some new buttons at the sex shop near my place!", "text": "[Image](http://i.imgur.com/aVfpEWa.jpg)", "date": "2016-02-23 02:30:38", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/474h4a/got_some_new_buttons_at_the_sex_shop_near_my_place/", "author": "mx_adler", "reference": 1742}, {"title": "I started a Telegram group for nonbinary people - PM me for an invite link! [x-post /r/nonbinaryUK]", "text": "", "date": "2016-02-23 21:03:08", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/478rjp/i_started_a_telegram_group_for_nonbinary_people/", "author": "cassolotl", "reference": 1800}, {"title": "Looking for Online Resources and Support for my Partner", "text": "I've been having a hard time finding resources for my cis partner to help her through my transition (I am transmasculine and I've been trying to figure out what my transition would ideally be). She has been wonderfully supportive, but I can tell she has some concerns and such. We have talked about some of these, but I think some resources/support networks could help a bit.\n\nI hope this makes sense ", "date": "2016-02-24 01:08:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/479y2e/looking_for_online_resources_and_support_for_my/", "author": "AlmostDude", "reference": 1815}, {"title": "Shit Parents Say", "text": "(cw suicide mention. also, general ignorance, if that wasn't clear from the title.)\n\nToday I had a long and unproductive talk with my mother about **misgendering** and she shared these gems with me (direct quotes, it was a Facebook convo and I can copy-paste):\n\n- \"Can we just drop this?  I don't... know why this is such a Big Thing?\" and then later in the conversation when i realized we weren't getting anywhere \"OK fine.\"\n\n- \"What am I supposed to say?  'OH YOU'RE A BEAUTIFUL... THING ???'\" gee, idk mom, if only there were a word for a human being that didn't include gender, like, oh idk, \"person\"\n\n- \"'What others think about you is none of your business.' Meaning, you can't control how other people think, or what is inside of their heads, so why drive yourself nuts worrying about it?\"\n\n- \"To me, you are my daughter.  And you will always be my daughter.  And that is how I prefer to refer to you.\" yeah i fucking noticed that's why i brought this up\n\n- \"I just want YOU to be happy.  Just tell me what I need to do in order to achieve that. And please don't tell me I can't put posts on my Facebook page about 'what a wonderful daughter' you are. I may understand otherwise, but I still need to share it with the world sometimes, and they might NOT understand.\" translation: don't correct me when I misgender you on facebook because other people might not be as ~understanding~ as me, also tell me what i can do to make you happy i'll do *anything* as long as it's not this one relatively minor change\n\n- \"Change... how... I think ... about this?  IDK how exactly you seem to think that I 'think about this?' I accept you as you are... surely you don't want me to change that? I love you.  Surely you don't want me to change that either?\" (guilt trippy af)\n\nI know that at least part of this is my fault because I am not very direct at telling my mom what I think and what I want from her. But that is because she FREAKS the FUCK OUT at any hint of criticism, like, REALLY freaks out, and I'd like to be able to sleep tonight without worrying that my mom is going to slit her wrists while I'm asleep.\n\nI know what I got from her is relatively minor compared to what some of you all have to go through but i have such a complex about my mom already (in case you can't tell from my comments) and this is really upsetting me\n\nPlease share ignorant/stupid crap your parents say in this thread\n\nedit: grammar", "date": "2016-02-25 04:15:02", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/47h5wo/shit_parents_say/", "author": "ponte-vanima", "reference": 1915}, {"title": "Keeping an obviously gendered name", "text": "The background: I was assigned female. The names I was given (first and middle) are obviously gendered, and neither of them have an opposite gender equivalent (think Katherine, or Diana). Neither of them can be shortened to sound gender-neutral. \n\nThe present: I've been gender-non-conforming and visibly androgynous my entire adult life. I've been on hormones for 6 years. I'm read as a man at least half the time anymore.\n\nThe problem:  My first name can only be shortened to something that sounds like a literal mumble. It's not gender-neutral either, but combined with my appearance it's sort of ambiguous, I guess. But as I said, it sounds like a literal mumble. I have to repeat it at least twice to every person I introduce myself to, and then I have to spell it, and then I have to field questions like, \"JUST ___?\" and, \"Is that your real name?\"\n\nThe other problem: I've never found a new name that clicked. I'm also Teflon to nicknames, so I have none of those to use. No one ever called me by the shortened form of my first name till I started introducing myself by it. But at this point I'm so sick of using my shortened first name, dealing with the questions, and worrying that my ID will out me that I'd almost prefer to use my full first name. It's not a bad name, I don't dislike it, I feel at least moderately attached to it. It's just really, really obviously a girl's name. (It was the *80s*! Why couldn't have I have gotten a gender-neutral name like the cool kids???)\n\nThe question: I just want to know if anyone who regularly passes for opposite their assigned sex has chosen to keep an obviously opposite-gendered birth name and how that is working out for you.", "date": "2016-02-26 18:40:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/47qic2/keeping_an_obviously_gendered_name/", "author": "Ebomb1", "reference": 2033}, {"title": "i really could use some help", "text": "note: i posted this on a few more subreddits, because im looking for as much help as possible.\nhi. im ida, and i personally have identified myself as agender for three years now. but i only came out to my closest friend. people seem to use it against me instead of actually respecting my gender. see, the problem is, i live in poland. in here, theres even gendered \"me\" and \"i\" and all that... its awful in this country. i NEVER saw any other trans/non-binary person in my whole town and beyond, and im super ashamed im the only one in this town who doesnt wanna be fit in the binary. more about this topic here. i have decided to come out as soon as possible from on now.. but, there IS a problem that bothers me the most. there are no gender neutral pronouns in this language. only he/she/it. i really hate being binarised but i can get along with masculine pronouns, always. but the problem is, there are no non-binary polish sites, topics, or even single things that could help me explain it to my family, friends, and other people. on the internet, everybody knows im agender. but on the other hand, irl seems to matter the most. there is only a single page on wikipedia in polish but it states NO information about the gender, and it REALLY bothers me. i do not want to be considered female and NOBODY here knows anything besides \"boy\" and \"girl\" and everybody refers to me as a she. i wanna cut my hair short but my parents dont allow me, and lets not even talk about sex change. could anybody help me search for something about non-binary genders for polish people, or could provide some translations and other content to help me silence all of this? please, im begging you. ive been in the closet for the nearest 3 years and i come to hate myself and my body more every day. please, help.", "date": "2016-02-26 23:06:21", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/47s0z6/i_really_could_use_some_help/", "author": "CuteMissBubblegum", "reference": 2063}, {"title": "Gender neutral titles other than Mx? Plus: pronouns.", "text": "Hey all. I'm still figuring out my shit but im the meantime, I'm looking for a gender neutral form of address other than Mx. Mx doesn't suit me at all. But neither am I a Ms, or Mr. This is so frustrating.\n\nSide note: still also playing with pronouns. Have any of you found ones you really like and feel suit you? I've heard they, ze, xe, ce, it...\n\nIt's just so frustrating when you feel as though there literally is not a word for you. Language shapes your perception of reality. When language doesn't support the fact that you exist... It's disheartening.", "date": "2016-02-27 04:43:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/47tc9i/gender_neutral_titles_other_than_mx_plus_pronouns/", "author": "coconutcups", "reference": 2093}, {"title": "Help! Hormone Questions?", "text": "Hi there! I'm a 21 year old biosex male who has identified as nonbinary/genderqueer for about 2 years now. Without overloading everyone on my situation I was wondering if anybody could answer some questions or point me toward some literature on the subject?\n\nAnyway, I've been interested in hormone therapy for a while. Not to \"fully\" transition to presenting female, but enough that I could use clothes and other means to present either way. As I am now, it's painfully obvious I'm male underneath. So here are my questions:\n\n1. How do I go about talking to a doctor about this? I've heard plenty of doctors have no experience with nb people.\n\n2. I've heard there's some shrinkage or loss of function in the downstairs region. How much do your genitals shrink? Do both the penis and the testicles shrink?\n\n3. I've heard orgasms become less intense. To what extent? Is this also true of prostate-stimulated orgasms? \n\nYou can post answers in the comments or pm me! I know this is pretty personal stuff.", "date": "2016-02-28 20:14:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4858sl/help_hormone_questions/", "author": "awayitthrowed", "reference": 2246}, {"title": "What makes a person nonbinary?", "text": "I read so much about this but nothing seems to have a finite meaning.   A girl who likes being female but does not fit into the female binary.   It just seems there is a confusion between gender identity and traditional gender roles.   Are we saying if you don't fall into a traditional gender roll then you're nonbinary?  So, If i guy likes traditional girl things and activities but still likes being a guy and is attracted to women then he is nonbinary?  ", "date": "2016-03-01 21:18:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/48iny8/what_makes_a_person_nonbinary/", "author": "forgotmycoat", "reference": 73}, {"title": "My girlfriend is making a dating/social networking site that is *actually* gender-inclusive!", "text": "This is a text post because there's some things you have to know first. The main thing is it's **alpha**, so it's not very polished or fully-featured yet.\n\nhttp://www.starfriends.org\n\nAnd like, whenever I see any statement that a site like this is gender-inclusive, that means... there are three gender options. We're still \"other: custom\". Nothing else about the site is changed to accommodate us, we're tolerated. Right?\n\nThis site has custom pronouns and your identity is just a series of tags, as many of which as you like being your gender. You get matched based on tags in \"i am\", \"you are\" and \"we'd be\". I am so excited about this site. :D\n\nWe have a telegram group for tech support and general nattering (linked on the site when you join), so that's pretty cool too. :)\n\nSo yeah, I wanted to share!\n\nEdit to add: If you want a sneak peak at the pronouns and tags and stuff, I blogged about them and there's screenshots: http://cassolotl.tumblr.com/post/140032770025\n\nEdit again: That blog post is kind of old, there's over 80 members now!", "date": "2016-03-02 11:42:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/48lspi/my_girlfriend_is_making_a_datingsocial_networking/", "author": "cassolotl", "reference": 132}, {"title": "Quiet night.", "text": "[deleted]", "date": "2016-03-02 13:22:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/48m3ma/quiet_night/", "author": "[deleted]", "reference": 138}, {"title": "Hi guys, I'm doing my dissertation on the impact of LGBT magazines and would love to get your input! My survey takes literally 10 seconds and I would really appreciate it if you filled it out &lt;3", "text": "[deleted]", "date": "2016-03-02 15:45:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/48mobg/hi_guys_im_doing_my_dissertation_on_the_impact_of/", "author": "[deleted]", "reference": 140}, {"title": "Generic gender?", "text": "What if forms asked you \"Gender: ( ) Male ( ) Female ( ) Generic\"?\n\nEdit: I think the issue I'm seeing here is people attaching to their gender. You aren't generic but your gender is, because 99% of the time gender doesn't matter.", "date": "2016-03-04 10:05:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/48wr6g/generic_gender/", "author": "SoniEx2", "reference": 308}, {"title": "Questions for non-binary to form a better understanding.", "text": "[deleted]", "date": "2016-03-04 16:58:05", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/48y5tz/questions_for_nonbinary_to_form_a_better/", "author": "[deleted]", "reference": 323}, {"title": "Why do we attach ourselves to our gender like we're them?", "text": "[removed]", "date": "2016-03-05 15:01:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/492pan/why_do_we_attach_ourselves_to_our_gender_like/", "author": "SoniEx2", "reference": 399}, {"title": "Nonbinary DFABs and taking low dose of T", "text": "Do any of you have experience with taking T at a low dose? I've been starting to try to learn more about HRT and if it is something that I will want. However, I haven't had much luck finding resources for people that stayed a lower dose and how their experiences differed from those on a higher/average dose ", "date": "2016-03-07 18:55:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/49e4ex/nonbinary_dfabs_and_taking_low_dose_of_t/", "author": "AlmostDude", "reference": 543}, {"title": "are there any folks here who are trans who use it as a non binary identity like my self", "text": "", "date": "2016-03-09 03:53:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/49ma0j/are_there_any_folks_here_who_are_trans_who_use_it/", "author": "[deleted]", "reference": 681}, {"title": "Facial hair prosthetics for genderfluid people?", "text": "Hi folks-\n\nI am genderfluid and unfortunately my facial shape will make it very hard to pass as masc to most people.  I've been looking into fake facial hair but a lot of the stuff I'm finding isn't flattering and seems almost \"neckbeard\"-y.  I don't feel comfortable presenting as masc in public without looking more \"masculine\" in the face bc I have a pink mohawk and I'm sure I'm gonna get gay bashed already and don't want to endure more than I have to.\n\nIf anyone has experience with fake facial hair and/or makeup tips for facial contouring I'd love to hear it, but I also don't wear makeup except on my eyes so I don't know how to go about wearing a full face of makeup and I'm sure I would smear it or something.\n\nThanks for reading!", "date": "2016-03-10 17:56:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/49ukx2/facial_hair_prosthetics_for_genderfluid_people/", "author": "spacetimemeatmachine", "reference": 781}, {"title": "What do I call my sex post-op?", "text": "Hi! My name is Toby. I'm an AFAB NB. Okay so as far as I can tell there are only 3 existing sex labels: male, female, and intersex. What have other NB's identified their sex as post-op? To be clear, I'm not transitioning towards a masculine body. I have no plans to get SRS or anything of the sort. More specifically the only surgery that I really want is a hysto. But I see this as a sex change towards a nonbinary physical sex. What do people in similar situations call themselves when it comes up or more importantly on medical forms? Do you just put \"Other\" for sex? We need to develop a word for this if their isn't one already.", "date": "2016-03-11 00:30:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/49wd0b/what_do_i_call_my_sex_postop/", "author": "MondayDinosaur", "reference": 821}, {"title": "a good friend came up to me and asked how can u be a non binary women if that is a binary gender. i told her cause thats who i am. has any one els been in this situation before", "text": "", "date": "2016-03-17 13:23:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4asyaw/a_good_friend_came_up_to_me_and_asked_how_can_u/", "author": "queerpunkdyke", "reference": 1336}, {"title": "found a great book on life without a gender", "text": "", "date": "2016-03-18 15:00:53", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4aynkm/found_a_great_book_on_life_without_a_gender/", "author": "berzerkabeth", "reference": 1419}, {"title": "The annual nonbinary/genderqueer survey now has a Twitter and a Tumblr :) • [x-post /r/nonbinaryUK]", "text": "", "date": "2016-03-19 12:24:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4b2wud/the_annual_nonbinarygenderqueer_survey_now_has_a/", "author": "cassolotl", "reference": 1487}, {"title": "Why I've Joined The Ranks Of The Non-Binary", "text": "", "date": "2016-03-20 00:00:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4b5fqe/why_ive_joined_the_ranks_of_the_nonbinary/", "author": "[deleted]", "reference": 1536}, {"title": "Nonbinary.org wiki: crowdsourced list of nonbinary-specific online communities", "text": "", "date": "2016-03-21 12:26:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4bc1n8/nonbinaryorg_wiki_crowdsourced_list_of/", "author": "cassolotl", "reference": 1634}, {"title": "Everything You Shouldn't Ask a Trans Person", "text": "", "date": "2016-03-22 15:59:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4bi064/everything_you_shouldnt_ask_a_trans_person/", "author": "AlmostDude", "reference": 1733}, {"title": "How did you come to identify NB?", "text": "Hello NB reddit, first time poster on this forum. I've ventured here because I'm currently in the process of discovering my own gender (AMAB, not uncomfortable with being male but feel moments where neither male or female apply), and i thought a little clarity would help me solidify my gender identity.\n\nWhat does make me wonder is how others came to the conclusion that any of the number of nonbinary genders, or the term nonbinary/genderqueer suited them better than other labels. Was it a stumble upon moment? Or more of an always knowing, not had the word sort of feeling? ", "date": "2016-03-25 18:02:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4bxla0/how_did_you_come_to_identify_nb/", "author": "TheKunstIsMe", "reference": 2006}, {"title": "Non-binary realizations later in life?", "text": "Hey folks! I'm AMAB, 29, and have been seriously thinking about my gender for six-ish months now. I've concluded that I'm some flavor of NB. Like probably all of you, I have some nagging anxieties about how this isn't really a thing, and I'm just being a trendy special snowflake. Feeding in to those anxieties is my sense that most people in the community seem to be younger than me. I have a (probably wrong) sense that nonbinary identities are just something the teenagers are doing these days.\n\nWho else around here came to their identity after, say, 25? I'm sure there are a bunch of you, but seeing it in print might help.", "date": "2016-03-26 13:04:10", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4c136o/nonbinary_realizations_later_in_life/", "author": "rivercitykitty42", "reference": 2072}, {"title": "how did you choose your new name?", "text": "title says it all lmao. but yeah i'm trying to find a new name and i've tried just looking through lists but nothing ever speaks to me so what did y'all do that helped you find ~the one~", "date": "2016-03-28 06:19:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4c9364/how_did_you_choose_your_new_name/", "author": "bottledfaeries", "reference": 2214}, {"title": "names &amp; how they are yours only", "text": "", "date": "2016-03-29 02:30:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4cdiwz/names_how_they_are_yours_only/", "author": "choosenoneoftheabove", "reference": 2283}, {"title": "ummm i have questions", "text": "well like one im just now learning that there are people who arent just male and female mind helping me learn about how to talk to them", "date": "2016-03-30 11:46:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ckedx/ummm_i_have_questions/", "author": "jonterrio", "reference": 2394}, {"title": "Fear of pregnancy- maybe related to being NB?", "text": "At this point in my life I'm trying to figure out whether or not I want children 5-6 years down the line after years of thinking I never would. \nThe thing that's really getting in the way of me trying to figure out if that's something I want is a really deep seated fear of (and disgust with) being pregnant. I understand it's healthy and I'm happy for pregnant people but when it comes to imagining being pregnant myself I get really freaked out. This fear also extends to childbirth for me personally.\nI know that this is not a terribly uncommon issue for cis women but for me being nonbinary complicates that matter. I've thought to myself several times that I don't know if I could handle how aggressively that would \"mark me as a woman\" if you know what I mean. Not only that, but I find being afab tolerable at best. Since I'd rather not even be female And pregnancy terrifies me I'm not sure how to think about this issue or work through it. I'm not sure I want to do something that might end up being a 9month-ish dysphoria fest.\nAll I can think of is that I should accept these feelings and not put too much stock in them. If I decide children I should just take the plunge and cope with issues as they arise?\n\nDoes anyone else have similar experiences? Has anyone found any resources that might be helpful?", "date": "2016-03-31 00:37:43", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4cnonj/fear_of_pregnancy_maybe_related_to_being_nb/", "author": "charlie0_0", "reference": 2437}, {"title": "SNP promise to give legal recognition to non binary people if reelected", "text": "", "date": "2016-04-01 12:59:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4cvhsw/snp_promise_to_give_legal_recognition_to_non/", "author": "Tisarwat", "reference": 43}, {"title": "Some people can be so closeminded.", "text": "My college is putting on a show. Most of the good parts are for males. I was never even given a chance. I know I look feminine, but I don't identify as female. I'm not male or female. It shouldn't even matter. None of the roles are gender specific. They just want guys because they think it's funnier with them. It's so unfair. I can play male. Does anyone else have a similar story?", "date": "2016-04-04 21:21:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4dd7jy/some_people_can_be_so_closeminded/", "author": "[deleted]", "reference": 304}, {"title": "Always felt like an odd duck (ramble)", "text": "Hi. Born female, (mostly) identify as femme. This has been a big, confusing, long journey for me.\n\nAs a little girl, I often felt at odds with myself, my body, and what was expected from me as a girl. There were times where being a girl felt right, especially when I was able to use my body how I wished (being active, climbing trees, just feeling safe and free). But I often felt so odd when expected to \"act like a lady.\" I never quite knew how to wrap my brain around that. Of course, now I know that I was feeling at odds with expectations and wondering why people wanted me to do some things but not others.\n\nI acted out a lot. I was absolutely fortunately blessed by young, slightly radical parents who in my early years were very much unlike other parents who forced their kids to dress and act through gender norms. My parents' small act of rebellion against their own families' rigid gender roles and judgmental attitudes was such a saving grace. Instead, they simply wanted me to be a strong and happy person. In a lot of ways, days when I feel like I am happy in my skin, I feel closest to that young kid, playing in the mud and running around with the dog with my little sister.\n\nBut puberty hit and I began to feel... weird. Weird all of the time. There was a lot going on in my life, but as my body began to change, people began to treat me differently. From puberty to now, I began to have a recurrent gender crisis (though I didn't know that's what it was until many years later). I began to feel like my clothes, my body, none of it suited me. I would throw out all my feminine clothes and try to do my best to be a boy, as I knew it- unfortunately a lot of that was based on my own internalized misogyny and gender roles. It didn't quite suit me, and then I would feel at odds with myself once again, because I was trying to cram myself into another place that didn't suit me.\n\nIn recent years I have begun to feel that being in a gender and self expression flux is not just a symptom of my anxiety- that there is a reason that every 6 months I begin to feel desperately out of place in my own skin. So began my own journey into understanding myself. \n\nAs it stands, my journey of trying to understand who I was looks a lot like this- straight, tomboy, lesbian, tomboy, androgynous, trying to be a boy, trying to be a girl, lesbian?? Bi, straight, cis, tomboy again, oh my god am I trans??? Wash, rinse, repeat. A lot of that exploration helped me get closer to who I thought I was, but just as much it gave me feelings of depression and self-loathing- I didn't know it, but I had jumped out of one box (straight, cis female) only to try to put myself in another, and I didn't fit.\n\nAs I've come to understand gender theory and the whole gender-sex-attraction thing, I feel like I'm starting to get closer to becoming that person on the inside. It's hard. There's a lot of difficulty, frustration, and pain. But I know that the alternative is even worse.\n\nHello from a non-binary femme. \n\n", "date": "2016-04-05 19:40:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4di42z/always_felt_like_an_odd_duck_ramble/", "author": "SunOnTheInside", "reference": 377}, {"title": "I finaly came out as non binary and it feels good:)", "text": "", "date": "2016-04-08 02:09:54", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4duent/i_finaly_came_out_as_non_binary_and_it_feels_good/", "author": "queerpunkdyke", "reference": 576}, {"title": "Ideas for a documentary?", "text": "I'm in the planning stage of making a documentary about nonbinary people. I got the idea for it when I realized I had so many nonbinary friends who I could interview, and a lot of them have actually agreed to do it!\n\nAnyway, I've been trying to brainstorm questions and also possible topics I can cover (other than the obvious ones like how they figured out their identity, whether they want to take hrt, etc). Does anyone here have any ideas or just things they'd really want to see in a documentary like this? If you live in my area I could even interview you possibly, so you can pm me your general location if you want and we could try to work something out.", "date": "2016-04-08 21:12:57", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4dyfyf/ideas_for_a_documentary/", "author": "YayScience120", "reference": 626}, {"title": "not feeling very stable tonight :-(", "text": "Hi everyone,\n\n34 years old/CA/not really a baby girl skunk, I was just looking at pictures of baby skunks when I made the user name. Aww.\n\nAnyway.\n\nSo I've made a lot of progress in the past couple of days. I asked some questions on here at this sub as well as the Ask Transgender sub and Genderqueer, about low-dose T, top surgery, and all that. People have been really helpful which is great. I live in the Bay Area so I called the Pacific Center yesterday and will be going to a group therapy session/meeting for genderqueer and non-binary folks this coming week. \n\nThen I called Lyon Martin, an LGBTQ+ health clinic, and got an appointment for medical care for next month as well as left a voicemail for their mental health department to get a gender therapist.\n\nTHEN, today, I spoke with Dr. Mosser's surgery clinic about top surgery and scheduled a free consultation for June because YOLO. \n\nSo I did all this and I've been trying to open up to people in my life a little more about how I'm feeling. On some level I feel this weird sort of giddy liberation. And I'm probably just emotionally exhausted after taking all these giant steps, but for whatever reason, instead of feeling happy and positive and liberated to be figuring this shit out, I also just feel:\n\n1. sad that I didn't do this sooner.\n2. sad that I feel this way at all.\n3. sad that it's gotten worse over the years instead of better.\n4. cheated out of a real childhood (I am FAAB and hit puberty at basically age 10, so there went that. got my period and then started growing boobs and I hated it and just felt like I would never be the same).\n5. exhausted by the hat0rade I have run across on the Internet about gender-variant folks.\n6. terrified of telling my parents any of this, yet feeling like I should include them in at least SOME statement about, \"Hi, I don't really think of myself as being 100% female and never have. It's okay if you keep calling me my name and using female pronouns and calling me your daughter because I am okay with being those things to you and I love you. But I just wanted to tell you my real feelings because I did not want to leave you completely out of such an important part of my life.\"\n7. really worried that there is something else chemically off with me that's somehow causing this, like borderline personality disorder or something. Or some manic episode or PMDD. I have not been diagnosed with any of these things but I am just not trusting my own feelings all of a sudden. Like what if I'm wrong about all this? What if I go back?\n\nBut I can't go back.\n\nAnd god dammit, why should I, so I can keep being miserable and dysphoric and weird about everything for ANOTHER 20 years? Aw hell no.\n\nSo why can't I just be happy that I'm on this journey? Why am I so afraid?\n\nTL;DR: UGH. Thanks for reading. &lt;3", "date": "2016-04-09 07:09:06", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4e0ejb/not_feeling_very_stable_tonight/", "author": "babygirlskunk", "reference": 669}, {"title": "How does one know one is gender non-binary?", "text": "I'm a gay male who has both masculine and feminine characteristics, with a loose understanding of gender. I've never felt like I've fulfilled the gender roles of man or woman, but I've never felt gender dysphoria. Consequently, I usually identify as cis-gender. \n\n\nHow does one feel about gender if they are gender non-binary, and how does one know if they are gender non-binary? Is it an innate feeling, or is it based on ones actions and behaviors?", "date": "2016-04-10 19:04:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4e730q/how_does_one_know_one_is_gender_nonbinary/", "author": "poliswag024", "reference": 765}, {"title": "Feeling confused. Doubts, anxiety, questioning", "text": "Hey. For a while now I've been pretty confident in my identity as a AMAB, Mtf trans girl. Recently though I've been having some doubts? It feels weird because well, I think I prefer she/her over they/them. I like dressing feminine and want to be seen as feminine and I don't like how masculine my voice comes off as. But, sometimes I feel like if I was seen as 100% one of the cis girls that I wouldn't like it? On the other hand I wouldn't want to be seen primarily as trans if I was going for \"Girl\". I dunno. Sometimes I think I could be happy being seen as something that's a \"girl\" but doesn't fall into the categories of cis or AMAB transitioning to female. When I think about how I want to present day to day (still haven't done any serious presentation or wardrobe work which is making this extra hard) I flip from masculine tough girl to feminine and demure pretty girl a lot, if that means anything. I also don't get a TON of genital dysphoria and If you right now offered me a choice between free orchiectomy and full SRS I'd have some trouble deciding. I also didn't really experience any discomfort or dysphoria with my assigned gender during early childhood if that means anything either. I've also picked out a name for myself already and it reads very feminine but it clicks really well.\n\nI'm really confused and hate feeling this way, especially since my doctor and I are about to discuss increasing my estrogen dose to get closer to normal female range and I want that! These feeling pop-up from time to time and usually go away on their own but they're a little more intense this time? In school when thinking about possibly being Mtf I often thought \"well maybe i'm 'just' nonbinary\" as if that was somehow not as bad as being binary trans. I'm kind of wishing I ran with that a little longer to see what it was like. Maybe I would have had a smoother transition to Mtf even if I was wrong. Now though I'm a good number of months into my physical transition and I just want to get this shit sorted. I've said before that I don't want to delay my transition for anything and that includes this. Unfortunately in this case it feels like I really really should until I figure it out.\n\nUUUUUGHH I'm feeling so frustrated and confused. I thought I was done with this gender questioning bullshit &gt;&lt;. I'm feeling simultaneously \"not binary enough\" and \"not nonbinary enough\" I'm just REALLY confused. I know the real answer to all of this is to do what makes me the happiest but I really don't know what would make me happiest at this point. Maybe these feelings will go away like always and I'll go back to being comfortably female. Maybe I'm just getting too hung up on labels. What does everyone here think?", "date": "2016-04-14 04:25:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4epjzz/feeling_confused_doubts_anxiety_questioning/", "author": "PrincessAnxiety", "reference": 1123}, {"title": "Let's Do This Again", "text": "Hello again Reddit. I took some time away really freaking out about life, dysphoria, and being alone. So ah... What has everyone been up to?", "date": "2016-04-18 00:23:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4f9akr/lets_do_this_again/", "author": "The_Rogue_Erudite", "reference": 1462}, {"title": "A NB poet on wearing a short dress in public for the first time", "text": "", "date": "2016-04-19 17:41:13", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4firo1/a_nb_poet_on_wearing_a_short_dress_in_public_for/", "author": "rivercitykitty42", "reference": 1640}, {"title": "Dressing more femme or genderless", "text": "Hi ya'll, so I've been more comfortable with my gender identity lately. And I was wondering how to dress more feminine or genderless  without portraying masculinity. If it helps I'm AMAB.", "date": "2016-04-20 02:16:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4fl56e/dressing_more_femme_or_genderless/", "author": "gcsnorth", "reference": 1685}, {"title": "I cannot believe Darkmatter hasn't been posted here before. The beautiful South-Asian, Non-Binary Trans, poetry duo and Non-Binary Fashion Icons. HIGHLY recommend.", "text": "", "date": "2016-04-20 02:45:06", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4fl9pa/i_cannot_believe_darkmatter_hasnt_been_posted/", "author": "earth_hat", "reference": 1690}, {"title": "Purple toes (Crosspost)", "text": "Enjoying my new pedi :-)\n\nhttps://www.reddit.com/r/malepolish/comments/4g51e8/purple_rain_purple_toes/", "date": "2016-04-23 20:18:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4g53em/purple_toes_crosspost/", "author": "2liitle2late", "reference": 2074}, {"title": "Top surgery UK", "text": "Hi everyone.\nI am FAAB and I have my first appt tomorrow with Dr Lorimer at Gendercare. \nI identify as non binary and i am looking to have top surgery but I do not want to go on T. \nIf anyone has any questions or would like me to provide updates with regards the process to getting  top surgery in the UK whilst not identifying as ftm, please let me know.", "date": "2016-04-24 19:53:46", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4g9p8a/top_surgery_uk/", "author": "Aquacrush93", "reference": 2182}, {"title": "I Think I Might be Nonbinary", "text": "I'm 24, and I've always considered myself a cis woman kind of by default. I've always been on the more feminine end of the spectrum, and happy with that. \n\nI have also always been uncomfortable with the fact that I'm a fairly large-chested person. For the most part, it's been fairly background, only getting really bad when I happened to wear something that really emphasized my chest or had to go bra shopping. Recently, I had... I don't know what to call it except that the closest experience I can relate to it is a panic attack, where I couldn't deal with the fact that I had breasts and I needed them off and gone. It relaxed back into the usual discomfort, but it made me start to think about whether I was cis after all. There are some other aspects of myself that, upon reflection, have felt like confirmation, and a couple people I spoke to said I've read as nonbinary to them in various ways. \n\nI have no problem being feminine (though I'm increasingly uncomfortable with the label 'woman' and prefer femme) as an AFAB person. I just want to do it without breasts. And I'm not sure what exactly that means for me. \n\nThere's a part of me that's afraid I just want to be \"special,\" and that if I was really nonbinary or genderqueer I should have known it before now. ", "date": "2016-04-25 05:09:25", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4gbvn6/i_think_i_might_be_nonbinary/", "author": "QueerLittleKitten", "reference": 2216}, {"title": "Prince's passing brought up hidden feelings of gender identity confusing", "text": "[deleted]", "date": "2016-04-29 05:40:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4gy2ra/princes_passing_brought_up_hidden_feelings_of/", "author": "[deleted]", "reference": 2674}, {"title": "Having some trouble with myself", "text": "So I've identified as AFAB nonbinary for about a year now, and I cannot figure out a way to manage my dysphoria. Every time I meet another nonbinary person, they either transition or detransition to cis identifiers. This has happened, not kidding, five times, and it's starting to get really disheartening. I don't judge these people, and I'm glad they're happy, it just feels like they're moving on and I'm still stuck here. It's just starting to feel like I'm gonna be expected to \"move on\" at some point, too. Maybe it's just something I'm holding over myself. I'm considering top surgery but I don't know. It's not like I'll ever be able to afford it. I just want to feel like I'm valid. I want to stop hating myself. ", "date": "2016-05-03 00:07:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4hkmee/having_some_trouble_with_myself/", "author": "flush-the-catnip", "reference": 166}, {"title": "Experiences of Mental Health Services", "text": "Hi, I’m Orion, I’m 17 and I’m non-binary. Across the last five years or so have had multiple courses of treatment from CAMHS (the UKs u18 mental health service). I now help to train staff at CAMHS (started at the hospital I attended, now working with all Trusts in South West London, possibly moving to a bigger area/national later on) on how to best care for transgender young people. At this time I can only talk about my own experiences and those of two or three friends of mine, but would like to have more opinions/experiences to quote, to give the best advice I can. The more experiences I can draw information from, the better the training I can give, and ultimately the better treatment trans kids will get.\nYou can help me out by filling in this survey, or by sharing it round so I get as many responses as possible. Thank you for taking the time to read this and hopefully giving me a hand.\nhttps://docs.google.com/forms/d/1oGnhcUIIy0XGXfOgkb64m81mlhsJbRtf5hzRE7Ygyug/viewform#response=ACYDBNg4cOoBzIZt6hEfX6IUALw7lzmSMn8yYk5ujuiBPKS9p9UwtBertg9PvQ", "date": "2016-05-06 00:57:31", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4i2vw5/experiences_of_mental_health_services/", "author": "orionthebearcub", "reference": 488}, {"title": "What does chest dysphoria physically feel like to you?", "text": "I'm just wondering, because I frequently have chest dysphoria and I'm wondering what it feels like to other people. ", "date": "2016-05-09 02:30:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ihm45/what_does_chest_dysphoria_physically_feel_like_to/", "author": "Im_not_a_turtle", "reference": 777}, {"title": "Tips for coming out at work/applying for jobs as a nonbinary person?", "text": "Hi all, I am currently in the process of a job search. How (or when, if ever) do you request a possible employer to use gender neutral terms/pronouns and all that jazz? Thanks!", "date": "2016-05-09 03:29:04", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ihtwh/tips_for_coming_out_at_workapplying_for_jobs_as_a/", "author": "queertpi", "reference": 790}, {"title": "Just a nonbinary masc AFAB person asking for advice/kind words of love", "text": "Hey everyone! I am a 20 year old nonbinary masc AFAB (assigned female at birth) person who is kinda struggling to come out to their parents. I am a college student but when I am on break, I live with my parents and grandparents (my mother's parents). I have been out to my mother since freshman year in high school as a \"lesbian\" and she's been cool with it, although we never really talk about it (I did mention when she picked me up from college this year that I was sorta seeing someone at the time and she seemed pretty chill about it). \n\n\nHowever, I'm struggling to mention my real gender identity to her and how I would like to medically transition (start taking low-dose testosterone so I am more comfortable in my body). Health insurance is awesome and all, but I'm not quite sure that I am ready to come out yet, and I know that the insurance billing gets sent to my house/parents, and I would wish to change that somehow. I'm listed as a dependent on the family health insurance (BCBS), but is there any way I can change the billing of my medical expenses/procedures to my personal address at college? Personally, I feel like it is not my parents' business of what I do medically unless I am ready to tell them/come out to them, but I am also unable to pay out-of-pocket for any therapy or treatments that I wish to go through to start my journey.\n\n\nOn the subject of hormone replacement therapy, I know you can't pick and choose the effects of hormones/testosterone, but I would like to get a lower voice (mine's really girly and high and makes me uncomfortable), squarer jaw, more muscle mass, and hairiness isn't a deal-breaker. I'm a bit nervous about bottom growth, as I do not have bottom dysphoria, and I'm afraid that a decent amount of growth might even give me a bit of bottom dysphoria, but I am pretty small (very, very small) to begin with, so I don't think it won't be a great issue. The reason why I would like to go on a lower dose of T (I know this relates to your own body and how your body handles hormones) is that as I do not identify as male, I do not want to fully present as \"male\"/seem cis-male. I just want to be a bit more masculine physically to match my mental vision of myself.\n\n\nI hope I get some responses from people who can relate/share their experiences and feelings like mine and I hope everyone's having a great day! :-)", "date": "2016-05-10 04:25:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4inkwb/just_a_nonbinary_masc_afab_person_asking_for/", "author": "zheezy", "reference": 926}, {"title": "Agender Doesn't Exist", "text": "[deleted]", "date": "2016-05-11 14:08:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4iv2g1/agender_doesnt_exist/", "author": "[deleted]", "reference": 1069}, {"title": "High School dfab enby person needs help coming out to parents", "text": "Hey! I'm Megan, and I'm a senior in hs, and I identify as androgynous, though I mostly present feminine. I have been identifying as androg for almost two years now, and I think I need to come out to my parents and family before college starts, but I'm terrified I will be outcasted by my parents and sisters, and that my grandmother won't talk to me anymore. \n\nI want to do this so I can be a bit more comfortable at home, so I can dress a bit more masc and wear my binder more frequently, and just be more comfortable with how I am in life, and maybe even start looking into a second name that is less feminine. \n\nAny help is welcome, and I'd really like it. Thanks! ", "date": "2016-05-11 17:20:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4iw07k/high_school_dfab_enby_person_needs_help_coming/", "author": "thelittlestarprince", "reference": 1092}, {"title": "I feel like both genders at once. Is that possible?", "text": "I've heard of \"bigender\" meaning people that switch between genders. I've heard of \"androgynous\", where people feel like a mix of the two. But I feel like both, all at once. I'm a girl and I'm a boy. \n\nI'm also bisexual and it's similar. I don't switch between being gay and straight, I'm not \"half-gay-half-straight\". I'm both fully gay and fully straight.\n\nAm I just selfish or is it actually a thing to feel like both genders? Is there a word for that? Are there other people like me???\n\nThanks for dealing with the scramble of words.", "date": "2016-05-12 10:25:16", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4j0127/i_feel_like_both_genders_at_once_is_that_possible/", "author": "alexander_lightning", "reference": 1169}, {"title": "Being read as a male through names (Advice on names)", "text": "I've been considering changing my name to incorporate my mother's maiden name as a middle name to honor her memory and that side of my family. At the same time, though, I'm realizing my feelings around my first name are complicated.\n\nI'm AMAB and have a definite masculine first name. I use a unisex nickname of my first name but I'm realizing I just don't like how that name sounds along with my mother's maiden name and my last name. I wasn't named after anyone; in fact, my name was a compromise name between my parents. Plus it frustrates me that I'm constantly read as a male through my first name.\n\nIf I'm going to change my first name, it makes sense to do it at the same time. What do you all think? Though I'm having these issues with my first name, it does feel like my name and I can't think of a name I'd rather have. I'm so confused as to what to do.\n\nDo any of you have a definite binary name you really don't mind?", "date": "2016-05-13 03:01:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4j4dtk/being_read_as_a_male_through_names_advice_on_names/", "author": "redfarmer1980", "reference": 1260}, {"title": "Hello!", "text": "i am a nonbinary 68  year old the only reason im on here is haters seem to think nonbinary is strictly for teenagers who think they are cool im here to break that stereotype", "date": "2016-05-17 02:50:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4jotyo/hello/", "author": "TheNonbinaryGrandma", "reference": 1697}, {"title": "Hey guys! I've recently found solace in a new gender identity and it would help if you could check out their tumblr blog!", "text": "[deleted]", "date": "2016-05-19 00:53:10", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4jzyou/hey_guys_ive_recently_found_solace_in_a_new/", "author": "[deleted]", "reference": 1922}, {"title": "New York City issues new guidelines on transgender pronouns", "text": "", "date": "2016-05-19 16:46:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4k3eb6/new_york_city_issues_new_guidelines_on/", "author": "itsmonday2", "reference": 1982}, {"title": "Secret Facebook group (and Discord channel) for FAAB/AFAB UK", "text": "", "date": "2016-05-21 20:17:23", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4kf9hh/secret_facebook_group_and_discord_channel_for/", "author": "dotties-", "reference": 2237}, {"title": "AskTrans Unofficial Skype Group", "text": "[deleted]", "date": "2016-05-21 21:17:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4kfimi/asktrans_unofficial_skype_group/", "author": "[deleted]", "reference": 2240}, {"title": "The Non-Binary Network! [Open for new members; looking to spread awareness and create a community.]", "text": "", "date": "2016-05-22 17:12:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4kjfz9/the_nonbinary_network_open_for_new_members/", "author": "opiixon", "reference": 2312}, {"title": "Nonbinary language of orientation: lesbian Enbies?", "text": "I've been stewing all day over this.  My nonbinary friend, who for the sake of anonymity I'll call Terry, posted an image last night about them identifying as a NB lesbian.  This morning, another friend posted:\n\"Lesbian is a term referring to WOMEN who love and prioritize other WOMEN.\"\nShe was plainly talking about my friend, and I came to their defense.  I'm a trans woman, but I know Terry very well and I have nothing but love and respect for them.  That was this morning; then my phone died, and I come home to a wall of text just completely vilifying them.  They had to delete their post and block everyone there to keep herself safe.  I think they're largely projecting; there was some trans guy or masc-genderqueer that screwed stuff up, and now they have irrational distrust of anyone who's afab non-cis.  \n\nI don't want to post the entire sordid thing, but the main thread was that non-binary people should invent their own language because lesbians fought hard to be about women for women.  I was thinking about this all day; there are a lot of questions that I think need to be asked by the trans and queer community at large, that I think are being ignored. \n\nSo my question to you is how do you describe your sexual orientation or attraction?  I imagine it's fairly easy if you're pan, bi, or asexual, but what if you're only attracted to one gender?  There's gynephilic and androphilic, but that seems so clinical, almost pathological.  ", "date": "2016-05-24 22:37:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4kwih0/nonbinary_language_of_orientation_lesbian_enbies/", "author": "madmarmalade", "reference": 2557}, {"title": "No idea how to fit into this world.", "text": "I've been out as trans for almost a decade now, I've had top surgery (I'm afab), and I still don't know how to fit into the world. I'm just *so effing female*- 5'2, very soft and curvy features. If I try, I can pass as a pre-teen boy. But I virtually never can be read as a man. \n\nI spend a lot of time on the fence about T- there's a lot of effects I don't want. I don't want to be on it for the rest of my life. It could push me all the way to being read totally as male (probably not likely but possible). I don't know if I'd actually want that.\n\nIt seems like all the communities I want to fit into, I'm not allowed to just by an accident of birth.\n\nI love drag queens, I've always been one in my heart, but trying to join a community that is so clearly not for people who look like me? Intimidating as fuck.\n\nI'm also very passionate about birth and pregnancy, birthing daddy is the biggest part of my identity right now. And not only does no one look at me and think I could possibly be my toddler's daddy- but there's really no space in the birth/pregnancy communities for dads.\n\nSelf-confidence is a big problem for me, and I know that. I want to have the courage and inner strength to just stand up for who I am and *make* space for myself. But that's such a daunting task.\n\nI'm trying to figure out my style. I've always dressed like a teenager because it's just how I'm most likely to pass, and out of habit. But I'm trying to figure out if there's a way that I actually *can* look like an adult man or at least look like an adult who's confident enough in themself to correct people and tell them off.", "date": "2016-05-30 09:43:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4lotgm/no_idea_how_to_fit_into_this_world/", "author": "inediblenightcrawler", "reference": 3125}, {"title": "Original live spoken word on not conforming to rigid gender expectations.", "text": "", "date": "2016-06-01 11:28:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4m0s0s/original_live_spoken_word_on_not_conforming_to/", "author": "safferoonicle", "reference": 47}, {"title": "Free the Nipple Fights Fort Collins, Colorado", "text": "", "date": "2016-06-01 17:30:21", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4m2f7x/free_the_nipple_fights_fort_collins_colorado/", "author": "itsmonday2", "reference": 80}, {"title": "So I think I'm demigender. Now what?", "text": "Hey everyone. I've been questioning my gender for a while and I think I'm starting to settle on demiboy. Thing is, I'm AMAB, but I don't feel 100% comfortable with being male. I'm definitely not female though. I like the \"he\" pronoun, I'm fine with being a \"boy\" or (less so) a \"guy,\" but \"man\" just doesn't work for me at all. And I guess I've started to get really obsessive about removing my body hair — maybe that's a body dysphoria thing, I don't know?\n\nSo when I found this thing where you identify barely as male, or maybe as a combination of male and agender, it seemed to stick.\n\nI don't really know where to go from here, though. I'd like to do something to my presentation to confirm that my gender's different, but I'm not sure what to go on — I don't have a new pronoun to use, I'm not really into feminine clothing. \n\nAnd stemming from that, I've got the anxiety that my whole gender question is self-indulgent. I mean, I'm an AMAB demiboy. In a world where nonbinary people get told they're not trans enough, that's like the definition of not trans enough. Here I am trying to figure out how to be a special snowflake, and meanwhile you've got people who need surgery or pronoun changes or hormones. Like I don't even know if I'm nonbinary enough. I certainly don't want to stand in the way of anyone who's got more of a struggle than I do.\n\nSo basically I'm not sure what to do. Anyone else demigender or going through something similar?", "date": "2016-06-01 22:29:57", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4m3ysr/so_i_think_im_demigender_now_what/", "author": "BlueGrayGay", "reference": 116}, {"title": "Dude...", "text": "[deleted]", "date": "2016-06-02 17:36:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4m8c6r/dude/", "author": "[deleted]", "reference": 197}, {"title": "3 Keys to Having Sex With the Non-Binary Person, Even When That Person is You", "text": "", "date": "2016-06-02 21:55:29", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4m9mud/3_keys_to_having_sex_with_the_nonbinary_person/", "author": "pandoraxsage", "reference": 224}, {"title": "I dont know if this is the right place to ask but", "text": "Hey, sorry if this breaks any rules. I was wondering if theres anywhere to post NSFW pics without being gendered?", "date": "2016-06-02 22:32:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4m9si4/i_dont_know_if_this_is_the_right_place_to_ask_but/", "author": "unapologeticallymaoi", "reference": 231}, {"title": "Texas Nightclub Tells Non-Binary Patron Not to Use Women's Restroom", "text": "", "date": "2016-06-03 20:17:54", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4methy/texas_nightclub_tells_nonbinary_patron_not_to_use/", "author": "itsmonday2", "reference": 342}, {"title": "Straight. Gay. In between. Those who don't categorize", "text": "", "date": "2016-06-03 21:01:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4mf17f/straight_gay_in_between_those_who_dont_categorize/", "author": "itsmonday2", "reference": 346}, {"title": "Sometimes I feel like I'm my assigned gender and it makes me feel awful", "text": "I am nonbinary. I feel good when I feel nonbinary. But sometimes I feel like I'm my assigned gender and it makes me feel awful, like I'm covered in something gross that I can't get off me. \n\nDo you ever feel like this? What do you do to make yourself feel better? \n\nI don't want to feel like the other binary gender either. I just want to not feel gendered. \n", "date": "2016-06-04 01:30:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4mg5u5/sometimes_i_feel_like_im_my_assigned_gender_and/", "author": "open_doorways", "reference": 377}, {"title": "I need a little help", "text": "Hi. For most of my life I didn't really assume there was anything else for me to be except female, but for the past year I haven't really felt female. There are times when I feel more feminine, definitely, but there were also times were I felt extremely masculine and I didn't really think about it much until last night when I tried binding for the first time. After that I tried on a bunch on masculine clothes and stuffed my underwear and I started giggling because I've never felt so free, but then that'd kinda ruin it as my giggle was too feminine. I don't know I just want to know other people's stories and to organise my thoughts a bit. Thanks in advanced", "date": "2016-06-06 13:34:02", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4msxl5/i_need_a_little_help/", "author": "ANALogyFun", "reference": 602}, {"title": "Check out this queer designer that makes swanky menswear inspired shoes for men, women, and nonbinary people :)", "text": "", "date": "2016-06-07 07:29:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4mxwjv/check_out_this_queer_designer_that_makes_swanky/", "author": "artichokess", "reference": 714}, {"title": "Explaining a Non-Binary Transition", "text": "", "date": "2016-06-09 16:07:55", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4nbhz2/explaining_a_nonbinary_transition/", "author": "itsmonday2", "reference": 977}, {"title": "Going out tonight", "text": "", "date": "2016-06-09 23:05:46", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ndgsl/going_out_tonight/", "author": "framboise1978", "reference": 1028}, {"title": "How much does NB culture rely on fashion to express their unique identity?", "text": "", "date": "2016-06-10 00:43:38", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ndvev/how_much_does_nb_culture_rely_on_fashion_to/", "author": "still_no_diagnosis", "reference": 1037}, {"title": "Finally Tinder figures this out - I hope", "text": "", "date": "2016-06-10 14:57:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ngocp/finally_tinder_figures_this_out_i_hope/", "author": "framboise1978", "reference": 1083}, {"title": "Coming out to parents?", "text": "How can I muster up the courage to come out as trans and nonbinary? Everyone but my parents and workplace knows. \nIm starting to really feel the need to get top surgery but my gender therapist told me that I had to get my family doctor to refer me to a special psychiatrist so that I can get started. I'm technically a legal adult so I don't need to talk to my parents about it but the idea of going ahead and privately doing that would feel like I was going behind their backs. Not just that, I'm worried that they would find out somehow because they've been very involved with my mental health up to this point. It would be suspicious if I went out of my way and got a new psychiatrist without uttering a word of it. I'm also worried that the family doctor just won't be able to help me for whatever reason too.\n\nMy parents do know that I'm queer but only because someone outed me to them when I was around 12 and while they're more supportive now it didn't go well back then so I'm especially scared when it comes to gender. I've been trying to make them more aware of transgender people in general but that's taken a lot of courage in itself.\n\nI know that I dont have to come out and that no one should feel pressured to, but at the same time I don't think I can exactly keep living the same way I have been. My dysphoria only started to lighten as I expressed myself so it's not like I can just easily go back to living as if I'm cis.\n\nSorry for the jumbled venting and length, I'm on mobile so it's hard to keep track. I just don't really know what to do at this point. I feel so stuck.", "date": "2016-06-10 17:22:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4nhdvu/coming_out_to_parents/", "author": "creamybunny", "reference": 1097}, {"title": "'Nonbinary' is now a legal gender, Oregon court rules", "text": "", "date": "2016-06-10 20:12:32", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ni7kt/nonbinary_is_now_a_legal_gender_oregon_court_rules/", "author": "itsmonday2", "reference": 1112}, {"title": "Am I in denial?", "text": "[deleted]", "date": "2016-06-11 22:08:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4nnhzo/am_i_in_denial/", "author": "[deleted]", "reference": 1197}, {"title": "5 Things That Don't Prevent Someone From Being Non-Binary", "text": "", "date": "2016-06-12 02:11:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4nodwr/5_things_that_dont_prevent_someone_from_being/", "author": "itsmonday2", "reference": 1219}, {"title": "Scientific proof of non binary?", "text": "Is there any scientific evidence of non binary gender? Please don't send me feminism articles. I'm looking for spot on scientific data. Where is the proof for this?  I'm not trying to come off as transphobic or anything. In fact, I'm non binary myself and I'm simply looking for an answer. How does science back up this non binary phenomenon? ", "date": "2016-06-13 13:06:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4nvitm/scientific_proof_of_non_binary/", "author": "anonymous23689", "reference": 1321}, {"title": "Oregon Court Allows a Person to Choose Neither Sex", "text": "", "date": "2016-06-13 16:19:23", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4nwdo5/oregon_court_allows_a_person_to_choose_neither_sex/", "author": "itsmonday2", "reference": 1337}, {"title": "An Oregon Court Recognized “Non-Binary” as a Gender—Here’s What That Means | Love the simplicity and inclusiveness of this article!", "text": "", "date": "2016-06-15 19:40:07", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4o97mp/an_oregon_court_recognized_nonbinary_as_a/", "author": "notzak", "reference": 1547}, {"title": "Ex-Army Sergeant Granted First Legal Non-Binary Gender Identity in Historic Move: 'This Is the Greatest Victory of My Life'", "text": "", "date": "2016-06-15 20:54:57", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4o9lzg/exarmy_sergeant_granted_first_legal_nonbinary/", "author": "itsmonday2", "reference": 1553}, {"title": "After A First-Ever \"Non-Binary\" Gender Ruling, the Oregon DMV May Change Its ID Rules", "text": "", "date": "2016-06-16 04:11:03", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4objf6/after_a_firstever_nonbinary_gender_ruling_the/", "author": "itsmonday2", "reference": 1589}, {"title": "I came out as non-binary/pansexual in the name of Orlando. HERE/QUEER/WILL NOT LIVE IN FEAR", "text": "[deleted]", "date": "2016-06-16 12:10:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4oczqf/i_came_out_as_nonbinarypansexual_in_the_name_of/", "author": "[deleted]", "reference": 1611}, {"title": "I came out as non-binary/pansexual in the name of Orlando. HERE/QUEER/WILL NOT LIVE IN FEAR", "text": "", "date": "2016-06-16 12:56:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4od68a/i_came_out_as_nonbinarypansexual_in_the_name_of/", "author": "safferoonicle", "reference": 1614}, {"title": "Petition: NASA must replace binary gender depiction on Voyager spacecraft", "text": "[deleted]", "date": "2016-06-16 14:14:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4odikt/petition_nasa_must_replace_binary_gender/", "author": "[deleted]", "reference": 1619}, {"title": "Inb4 ban", "text": "", "date": "2016-06-16 17:48:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4oemqv/inb4_ban/", "author": "NecroZander", "reference": 1634}, {"title": "Legal Non-binary Gender in the U.S.: Link Roundup! (add yours)", "text": "Hi everyone!\n\nA recent court case in Oregon was decided in favor of a plaintiff, resulting in the first legal recognition of non-binary gender in the U.S. This is a big deal just in itself, and will hopefully be the catalyst for many more cases. \n\nSince there's been multiple posts lately on this news, I'm cleaning up the front page by condensing them here. While this is still \"new\" news, this post will be stickied and new links can added in the comments. \n\n['Nonbinary' is now a legal gender, Oregon court rules](http://www.dailydot.com/lifestyle/oregon-court-rules-non-binary-gender-legal/) originally shared by u/itsmonday2\n\n[Oregon Court Allows a Person to Choose Neither Sex](http://www.nytimes.com/2016/06/14/us/oregon-nonbinary-transgender-sex-gender.html) originally shared by u/itsmonday2\n\n[Ex-Army Sergeant Granted First Legal Non-Binary Gender Identity in Historic Move: 'This Is the Greatest Victory of My Life](http://www.people.com/people/article/0,,21012899,00.html) originally shared by u/itsmonday2\n\n[After A First-Ever \"Non-Binary\" Gender Ruling, the Oregon DMV May Change Its ID Rules](http://www.portlandmercury.com/blogtown/2016/06/15/18233344/after-a-first-ever-non-binary-gender-ruling-the-oregon-dmv-may-change-its-id-rules) originally shared by u/itsmonday2\n\n[An Oregon Court Recognized “Non-Binary” as a Gender—Here’s What That Means | Love the simplicity and inclusiveness of this article!](http://www.pdxmonthly.com/articles/2016/6/15/an-oregon-court-recognized-non-binary-as-a-gender-here-s-what-that-means) originally shared by u/notzak\n\n", "date": "2016-06-16 18:34:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4oevmf/legal_nonbinary_gender_in_the_us_link_roundup_add/", "author": "Ebomb1", "reference": 1640}, {"title": "Rule Change: Starting discussion with your links", "text": "Hi folks,\n\nWe have a decent-sized community here, but it tends to be pretty quiet. Two of the truisms about internet conversations are that people are more likely to comment if they don't have to be the first, and that people are more likely to click a link when given some context. To that end, I'm implementing a small rule change that OPs of link posts should make a comment after posting that's intended to start discussion. This doesn't have to be an essay! Examples of comments include any or all of the following:\n\n- a short summary of what the link contains (and how it differs from other active posts on the same topic, if applicable)\n- your opinion of the content at the link\n- any sort of question you'd be interested in talking about\n\nr/menslib has endorsed this posting format with great success and has a lot of active posters and threads. Note that I'm not endorsing (or condemning) the content of r/menslib in any way. Plus the nature of their sub's topics draws trolls and their rule is also partially intended to deter pointless #butwhataboutthemen comments, which is not really something we deal with here. But click over there if you want some clear examples of what I mean when I'm asking for investing in discussion when posting.  \n\nI hope that this encourages more participation and a sense of investment here. Cheers.\n", "date": "2016-06-16 18:43:31", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4oexdd/rule_change_starting_discussion_with_your_links/", "author": "Ebomb1", "reference": 1641}, {"title": "Non-binary top surgery UK", "text": "Hi everyone,\n\nIm a non-binary person in the UK who will be having top surgery later this year - AMA!", "date": "2016-06-16 19:04:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4of1g6/nonbinary_top_surgery_uk/", "author": "Aquacrush93", "reference": 1644}, {"title": "What to do when someone insults your gender identity?", "text": "One of my friends asked me on one of my profile pictures why it says \"they uploaded such and such\" and I told them because I identify as non binary. THEN one of my friends just commented apache. As in Apache helicopter, as in that stupid copypasta. This is a guy that's always posting transphobic shit. How do I respond to this?", "date": "2016-06-17 23:03:38", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4olx5c/what_to_do_when_someone_insults_your_gender/", "author": "FiveChairs", "reference": 1761}, {"title": "Anyone Know of a Good Muscle-Building Routine?", "text": "Hi all, first time posting in this subreddit! I'm an AFAB nonbinary person. While I am a small person, I'm very soft/squishy/amuscular and it's making me a bit dysphoric. Does anyone know of any good muscle-building/toning routines (particularly arm workouts), keeping in mind that:\n\n1. I am weak as hell right now (can barely even do one pushup, if that).\n2. Don't have access to weight lifting equipment (I'm too poor to buy weights and gyms make me super uncomfortable).\n\nI'm also going to be working in some cardio and the like, I just don't know the first thing about building muscle. \n\nLinks/tips/advice would be greatly appreciated, thanks!", "date": "2016-06-19 07:55:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4osgd2/anyone_know_of_a_good_musclebuilding_routine/", "author": "aubreythez", "reference": 1881}, {"title": "VU Medical centre Amsterdam", "text": "Hi all,\n\nI am a amab and consider myself non binary.\nI have been thinking alot about the world and the idea that alot of the interactions between people are mostly a part of a  social construct made by human-kind through history.\n\nLets get to the point.\nI am going to visit The VU Medical Centre in Amsterdam to start my journey into getting the body i want, but am a little afraid of the gender specialist team they have.\n\nI dont know how open minded they are within the gender topic and i am scared that i wont be understood. They have a hard focus on the dysphoria part of being trans and i for a fact don't really have any form of dysphoria about my current body or social life.\nThey say people get mad if u put them in a psychiatric facility and thats a bit how my mind i thinking of the whole journey i am about the embark on.\n\nI know what i want and don't like to go into this as a person thats searching for medical attention or something.\nI have never had despressions, have a great social life, going to university to study sociology next year and have a great family.\n\nI don't like the the feeling that some sort of dysphoria has to be diagnosed in their eyes and them trying to link everything i write or say to some sort of discomfort with my present life.\nTheir site even connected dysphoria and being trans with each other https://www.vumc.nl/afdelingen/zorgcentrum-voor-gender/\n\nI am perfectly sane going into this and have confidence in the outcome and don't really care about people i dont know judging me when i start. My friends and mom will back me up for sure.\nI just want to change my body not my open mind, you get it ? \n\nAnyone here have any experience as a non binary talking to the VU MC in Amsterdam ? \n\nThanks,\n\nLesley\n\n#English may be a little bad.\n", "date": "2016-06-21 06:38:16", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4p3a6q/vu_medical_centre_amsterdam/", "author": "socialnietze", "reference": 2075}, {"title": "Ex-Army Sergeant Granted First Legal Non-Binary Gender Identity in Historic Move", "text": "", "date": "2016-06-21 11:57:06", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4p47db/exarmy_sergeant_granted_first_legal_nonbinary/", "author": "TransSingle", "reference": 2089}, {"title": "You are all mentally ill", "text": "[removed]", "date": "2016-06-23 01:06:52", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4pe4mj/you_are_all_mentally_ill/", "author": "Hitler_My_Fuhrer", "reference": 2242}, {"title": "Being Misgendered by Close Family Member Struggle", "text": "So, I have always been super close with my dad. He has known about my pronouns for a while now, but he rarely uses them. And when I correct him, he gets super defensive. My pronouns are they/them and sometimes I use he/him. And he knows this. However, if I call him out, he will deny misgendering me. \n\nI am in my early 20's and live with my partner. It just hurts that my dad has been like this because of how close to him I have been my whole life.", "date": "2016-06-27 20:31:54", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4q5ijm/being_misgendered_by_close_family_member_struggle/", "author": "AlmostDude", "reference": 2670}, {"title": "What do you awesome folks wear to work?", "text": "[I posted this on /r/genderqueer too; don't know if that's allowed?  n00b here.]\n\nSo, I labour in a socially conservative office environment. Like Bartleby the Scrivener 'I would prefer not to' - but of course there are bills to pay...\n\nAnyway I loathe and detest wearing drab men's suits. Are there any queer alternatives for those locked in the closet who somehow still have nothing to wear?\n\nOne day I expect I shall turn up wearing a cute dress. But until that day is there any way to preserve my sanity whilst remaining 'professional'?\n\nThanks for any help! :)", "date": "2016-06-27 20:39:03", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4q5jra/what_do_you_awesome_folks_wear_to_work/", "author": "6e6f6e2d62696e617279", "reference": 2675}, {"title": "Binder Anxiety", "text": "Hello I am a kid who would like to get a binder for days when my breasts do not feel right on my body but I am very anxious about the affects it could have on my ribcage after reading certain things on the internet. Has anyone ever noticed any differences in their ribcages after prolonged use of a chest binder? ", "date": "2016-06-28 08:32:28", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4q8euf/binder_anxiety/", "author": "yullbe0k__", "reference": 2727}, {"title": "#NonBinaryYT: Calling All Non-Binary YouTubers! [CC]", "text": "", "date": "2016-07-01 22:28:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4quekp/nonbinaryyt_calling_all_nonbinary_youtubers_cc/", "author": "herbdino", "reference": 94}, {"title": "Tiny Baby Steps Forward", "text": "Just changed my profile settings on facebook from gender: female to gender: custom - NonBinary.  And picked They pronouns.\n\nIt doesn't pop up as an update to anyone.  It isn't visible unless you go several layers deep into the \"about me\" section that no one ever looks at.  Post updates will say \"Urist updated their cover photo\" instead of \"her\" and that's it.\n\nIt's such a tiny, teeny, miniscule thing.\n\nAnd yet I was really nervous about it.\n\nMy whole family, my partner's family, my childhood friends, and some co-workers are on facebook.  So this, technically, is my first step towards coming out to... anyone other than my partner and his sisters.\n\nI just wanted to teeny-tiny celebrate my teeny-tiny step.\n\n*edit* Thanks everyone!", "date": "2016-07-06 20:34:40", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4rkm4w/tiny_baby_steps_forward/", "author": "UristMcD", "reference": 576}, {"title": "Binding ??", "text": "I'm not sure if this goes here but I'll give it a try. Okay so I identify as gender non conforming and just recently got a binder! But I got some issues. \n\nFirst off I'm not exactly out to anyone? Like I don't feel the need to bc it's just something I've always felt but never had the change to express. I'm scared on how my family will react. The problem is that I'm not exactly small chested so wearing the binder makes a big difference. I've subtly said comments here and there about disliking my breasts but I'm not sure how they will take it and I somehow know they won't be accepting :( \n\nThe second thing is that I don't know how to wear the binder? So I've tried it on with the \"girl\" clothes I have and it's so noticeable :/ I have the gc2b tank and I don't know how to make it not show so much. I don't plan on getting male clothes only bc I'm still exploring my style and such. And another thing being that I love expressing my feminine side through clothing. \n\nSo yeah that's that, sorry for it being so long but I would really appreciate some advice and help!! Thanks for reading :)", "date": "2016-07-07 05:05:14", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4rmvdt/binding/", "author": "thedolcevita", "reference": 638}, {"title": "Neutral pronouns (for self)- how to switch/adjust?", "text": "Whenever I go on google quests there are like, 50 billion articles about how to adjust to someone else's pronouns, or how to adjust/switch to binary-gendered pronouns for yourself, but I can never find anything about neutral ones- they/them or invented.\n\nNonbinary genders don't have one set of pronouns that are coded just for them, especially when there's so many different nb genders anyway. So how do you find out if using they/them or fae/faer or ze/hir or whatever else is right for you? How do you test them out without making a big deal to friends and asking them to help? (I have a lot of anxiety about not wanting to do something unless i'm 100% sure it's the move I want to make next.) I mean sure, there's pronoun validation blogs &amp; the pronoun dressing room, but it's still impersonal and doesn't really simulate anything properly, imo- plus, the problem of not knowing how it would sound out loud (for the invented pronouns)? Like as far as my situation goes specifically does anyone know of like any videos where people refer to someone using ze/hir or other neopronouns?\n\nWhat about like, practicing to yourself? How do you validate it to yourself to adjust to them? Is it even possible to get used to them before asking others to use them, or is it something you can really only decide is right for you after getting at least one or two friends to test them out with you for a while? How long should you give it before giving up and trying something else out?\n\nPronouns are, 100%, the part of social transitioning that's been the hardest for me to move forward with because of all this uncertainty. I really would appreciate some kind of help or insight or something of some sort on the matter.", "date": "2016-07-14 17:15:16", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4sue7g/neutral_pronouns_for_self_how_to_switchadjust/", "author": "mortdepup", "reference": 1376}, {"title": "I'm still in shock that I came out to my mom last night", "text": "[deleted]", "date": "2016-07-18 02:18:36", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tcvl8/im_still_in_shock_that_i_came_out_to_my_mom_last/", "author": "[deleted]", "reference": 1702}, {"title": "advice? gender and trauma and bullshit", "text": "this is a lil rambly but it's almost five in the morning so bear with me \n\ni am p weird about gender shit right? but i have no desire to change my body whatsoever. i don’t feel trans and i don’t feel comfortable calling myself trans or considering myself under the trans umbrella. i have friends with actual dysphoria, i just feel vaguely uncomfortable at times. probably bc of years of horrible body related trauma?    \n\ni feel kind of weird calling myself agender: i feel wrong with a gender/have trouble relating to my assigned gender but that’s also the fucking years of trauma talking. (horrible parenting + bullying + assault = woo!!) \n\n maybe i just want validation of the horrible alienation i feel from other people in general? i realize there is no \"right\" way to be any gender but... I can't tell if this is a social anxiety thing, an enby thing, or a trauma thing. Maybe all three. But then, do I have any actual place in the non-binary community? I don't feel valid enough for any actual community. i used to be a part of a \"girl's only\" forum and I always felt like this bumbling outsider, that never had the proper \"female socialization\" they always talked about. And I am sure how anyone can see this easily leads to me feeling like I have \"special snowflake syndrome\" and I'm ~not like other girls~, labels which of course have historically always helped people who feel like outsiders feel accepted in predominately female communities (/sarcasm) \n\nso YEAH UH I HAVE NO IDEA WHAT IS GOING ON WITH ME gonna go to my psychiatrist tues tho ", "date": "2016-07-18 09:01:43", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tea2b/advice_gender_and_trauma_and_bullshit/", "author": "stephengordon6969", "reference": 1730}, {"title": "X-Post: I'm on a podcast talking about being non-binary!", "text": "Hey all,\n\nLong-time user of this sub here, but I've never actually posted!\n\nI'm a British 22 year old queer punk, and I was just featured on a podcast, talking about being genderqueer and non-binary more generally.\n\nYou can give it a listen here if you would like: http://kickingthekyriarchy.org/kickingthekyriarchy/2016/7/12/episode-3-non-binary\n\nI'm Séan and I start around 12.30!\n\nFeel free to tell me what you think!\n\nCheers", "date": "2016-07-18 13:13:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tf4o1/xpost_im_on_a_podcast_talking_about_being/", "author": "moominlad", "reference": 1744}, {"title": "I think I might be nonbinary", "text": "[deleted]", "date": "2016-07-18 17:27:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tgbmd/i_think_i_might_be_nonbinary/", "author": "[deleted]", "reference": 1765}, {"title": "Looking for someone to talk to who can relate", "text": "I don’t know if this is the right place for me to post. I’m looking for someone who can relate to this to talk to. \n\nAs a kid I never noticed any discomfort with my body or gender. I wanted to be seen as a tomboy (I wasn’t) and hated “girly things” but that was the extent of it. When puberty started I became miserable with my body and that feeling has persisted for the 10-odd years since then. Height, breasts, hips, hand size, legs, all the things about my very feminine proportions that show that I am female make me feel disconnected and weird about my physical form. I’ve never felt much of a desire for a dick but reminders that I have a “hole” make me uncomfortable (penetration terrifies me, I can’t even put in a tampon without my body freaking out) and I am uncomfortable about my reproductive system. I dress in men’s clothes and cut my hair short but I am very rarely seen as male. When this does happen it feels good, probably because it means other people aren’t noticing all the parts of me that I hate.\n\nI don’t have any inner sense of “gender identity” and I never have. I feel very disconnected from the word woman but I don’t have the same issue with the word female, which imo is just a biological term for what I am. When I’ve gone to college counselors (the only therapist-type people I have access to) at first they focus on identity and preferred pronouns, but I never know what to tell them. For me it’s mostly about wanting to get rid of the female features of my body. Some of the effects of testosterone are things that I don’t especially want, and I go back and forth between maybe wanting to try a low dose and not starting at all. I went to a doctor once to discuss testosterone and asked him about low dose T, but he basically scoffed in my face and said he doesn’t do “partial transitions”. I definitely want top surgery but I don’t know if someone like me would be able to get it. \n\nI’m open to the idea that I’m just a cis female with weird hangups, or the idea that this is somehow related to the autism that my parents have always assumed I have. I can’t relate to any trans narrative that I’ve ever heard, but when I see things about ftm transitions I feel like in some ways the people are like me. For 4-5 years I’ve been considering transition but my thoughts on it fluctuate over time. I worry how I would even explain aspects of  transition like top surgery to other people without the “I was always a boy inside” narrative, and I worry about having to live as a man socially when I don’t think that would be easier for me. At the same time I can’t see myself having a future as a woman. To be honest I just don’t know what to do, and college counselors can’t do much to help me. \n\nIs there anyone here who can relate to this? Can we talk about the steps you personally have taken? I’ve gone to a couple ftm meetings in my city but the experience of a trans man is different from mine and I feel like I’m intruding on their meetings.", "date": "2016-07-19 16:35:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tm1v8/looking_for_someone_to_talk_to_who_can_relate/", "author": "pasmo", "reference": 1869}, {"title": "Possible Clothing Line - thoughts wanted!", "text": "Hi folks - long time lurker on a lot of gender-related subreddits here, but first time reddit poster so bear with me haha...\n\nAnyway, I'm a non binary MAAB art student who's thinking about creating a NB clothing line, and am looking for a bit of advice and input. I know that there's a few lines out there already, but what I've been seeing so far from places like Selfridges and Zara seems to be a samey and shapeless, tends to be pretty masculine in general and is seems quite expensive/inaccessible to your average person. The vision I've got in my head for this hypothetical line or label would be a bit more vibrant and interesting, form fitting and varied, with the aim of making it accessible to more people. I'd love for it be inclusive to all, and I know that there are also cisgender people out there that would like to have a ungendered option when it comes to shopping for clothes.\n\nPersonally in  the past I've found it pretty hard to find clothes that fit me well - I'm on the skinny side and only about 5'7-5'8 so I'm mainly left with the choice of getting something that fits really well from the women's department but might be too much on the feminine side cut or style-wise for me, or getting something with a more neutral cut or style from the men's department but having it hang off my body, so I'd like for it to be size inclusive and body positive for as many people as possible. Obviously there are practicalities to consider in terms of how many sizes of each item would be do-able as a newly started business/social enterprise, but inclusive is what I'd very much be aiming for as the core of the line.\n\nThe concept is that these are clothes for people, without boundaries, with the only separation being different kinds of cuts and styles - with the idea that one day anyone could walk into a high street store and shop in the clothes department and not feel left out or unwelcome. Anyway, that's my spiel haha, so I was wondering if anyone's got any thoughts on this idea? I'm aware that non-binary clothing isn't a new idea, and there are other things getting started up, but this isn't about rivaling them, just possibly adding my own ideas into the mix to give everybody more options to pick from. But yeah, if there's anything you'd really like to see or that you feel that isn't being catered to at the moment when you're looking for things to wear, I'd very much like to hear your thoughts! \nAgain, first post on reddit so please go easy on me. Thanks :)", "date": "2016-07-19 19:30:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tn0i0/possible_clothing_line_thoughts_wanted/", "author": "unboundup", "reference": 1891}, {"title": "I really hate this whole \"nonbinary people are just trying to be special snowflakes\"", "text": "[deleted]", "date": "2016-07-20 08:04:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tq4m0/i_really_hate_this_whole_nonbinary_people_are/", "author": "[deleted]", "reference": 1948}, {"title": "I really hate the whole \"nonbinary people are just trying to be special snowflakes\"", "text": "why do you have to turn it into it being that \njust to hurt feelings? ", "date": "2016-07-20 08:16:58", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tq5t7/i_really_hate_the_whole_nonbinary_people_are_just/", "author": "yellownose", "reference": 1949}, {"title": "how do you feel when people say that you being nonbinary is reinforcing gender roles", "text": "[deleted]", "date": "2016-07-21 01:03:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tufsw/how_do_you_feel_when_people_say_that_you_being/", "author": "[deleted]", "reference": 2013}, {"title": "Cognitive Psychology Survey Trying to get better non binary representation in research!! Your support is appreciated", "text": "", "date": "2016-07-21 02:51:54", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4tuvyy/cognitive_psychology_survey_trying_to_get_better/", "author": "ktlnlewis", "reference": 2025}, {"title": "X post: Questioning AFAB maybe demigirl", "text": "X post from r/genderqueer:\nHey :) I've always thought of myself as a masc cis woman who loves presenting androgyously, but recently I've been thinking that maybe demigirl or another nonbinary identity might suit me better. I've never really felt that \"woman\" fully reflected my gender but I didn't really think I could find anything better and I also don't experience dysphoria generally. Over the course of my relationship with my AMAB girlfriend (yay we're coming close on 3 years), I've become increasingly aware of non-binary identities through my allyship with the trans community but I also feel that my experiences are quite different to many of the people I know well. I am not sure whether I want to change my pronouns because I like both she and they pronouns (currently use she). I like my appearance most when I appear androgynous and dislike my big boobs which are the biggest detracting factor in my opinion from the androgynous look. I like it when my partner calls me her girlfriend but I don't like it when I am gendered female in social situations especially if it comes with the extra baggage of gender roles. I have no idea what I want right now, but I'm so used to being the only cis around in my friendship group (haha I've been indoctrinated into the trans-agenda :P) and this is a big scary step. I'm having a lot of trouble not invalidating my gender identity because I haven't experienced dysphoria like my friends/partner have. Where should I go from here? Thanks &lt;3", "date": "2016-07-21 10:54:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4twet2/x_post_questioning_afab_maybe_demigirl/", "author": "phrygiansaz", "reference": 2059}, {"title": "Gender is a manifestation of sex", "text": "[removed]", "date": "2016-07-25 17:15:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ujq44/gender_is_a_manifestation_of_sex/", "author": "SoniEx2", "reference": 2479}, {"title": "Living Between Genders", "text": "", "date": "2016-07-25 18:12:55", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4uk1vp/living_between_genders/", "author": "SoniEx2", "reference": 2490}, {"title": "Dressing advice - women's shorts", "text": "I'm not sure where to ask this question, but recently I picked up a pair of shorts from the womens department in a store called primark. I bought them because I always liked the look of them and I felt it would be appropriate for the heat and for the fact I will be heading for pride with my friend soon (its their first time in all).\n\nBut my problem is I'm AMAB and these shorts are -fairly- short. I don't know where else to ask (I know there are plenty of places), but I just wanted to know if any could provide some good words to avoid any embarrassing situations.", "date": "2016-07-26 20:17:29", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4uqpn9/dressing_advice_womens_shorts/", "author": "TheKunstIsMe", "reference": 2588}, {"title": "Question: Gender-Neutral Relationship Words", "text": "Hello there. So I was just wondering what kind of gender-neutral \"relationship words\" people use or like. I'm kind of looking for alternatives to pet-name types like \"sweetie,\" \"darling,\" etc., that are used when talking to others, (as in \"my sweetie,\" \"my girlfriend/boyfriend\" and so on) Does anyone have ideas for gender-neutral words along these lines that don't have pet-name connotations?\n\nEdit: clarification", "date": "2016-07-28 17:22:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4v1v3w/question_genderneutral_relationship_words/", "author": "carly_t_rex", "reference": 2774}, {"title": "[rant] Apparently my opinion is wrong", "text": "How dare I want aliens to be nonbinary sometimes, right? How dare I feel frustrated with yet another way of pretending nonbinary people don't exist. How dare I think the billions of binary-gendered scifi races is uncreative. Apparently, since the 2 other nb people you know \"don't care about scifi,\" my opinion is \"nonsensical\" and I should be \"worrying about real-life things.\" Also let's throw in a rant about tumblr for good measure even though I never brought up tumblr at all! Oh, but you're \"just trying to understand,\" sorry the big mean nb called you an asshole, you poor misunderstood child.\n\nI am *so* glad I broke up with you, now fuck the fuck off.", "date": "2016-07-29 17:21:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4v7pqi/rant_apparently_my_opinion_is_wrong/", "author": "JSubatoi41", "reference": 2889}, {"title": "Girlfriend came out as \"bigender\"", "text": "Alright, so I obviously made a throwaway here for a reason, and it's not just because I know other people in real life that use reddit and I'd rather them not know who I'm talking about without my girlfriend's consent - I don't think I'm going to get much love for what I'm going to post here, but I told my girlfriend I'd give her a shot and I'd try to understand what she's talking about. So, here I am.\n\nBackground about me - I've always considered myself a leftist, politically, but never got on board with a lot of the radical social leftism that's been getting some spotlight more recently. So, when my girlfriend came out as bigender, I guess I didn't respond as I should have. I'll just come out and say it - I can't understand how this is anything but a mental illness, and I told her as much. I said, in addition, that that's fine with me, she's got others and this doesn't really make a difference, but she still contends its different from a simple delusion or something of the sort. So I'm asking you to explain what the difference is, here. My understanding of all this follows:\n\n\n(and please, guys, grant me the benefit of the doubt here. I'm not trolling, I'm not from fucking the_donald or whatever. This is actually what I believe and I just want to see if maybe you guys can explain it better than my girlfriend can and I can better understand what she's saying.)\n\nThe way I see it, gender is a useless word. Biological sex exists, and gender is a collection of social norms that are entirely subjective and largely sexist. She says that she \"sometimes feels masculine and sometimes, feminine.\" I am completely incapable of understanding this. \n\nI'm not a super masculine alpha male or something, I guess I do or feel things that'd be \"traditionally feminine\" from time to time. I don't feel particularly masculine OR feminine, I just have a Y chromosome with an active SRY gene and that's it. She was not able to explain why she sometimes feels masculine or feminine, and I think that was the biggest sticking point for me, since even these subjective, completely created gender stereotypes are at least loosely defined, and (I'd imagine) feeling masculine or feminine would mean adhering to these stereotypes in some way, which she says is not an accurate way to describe how she feels.\n\nSo, I guess to start, can someone explain to me what this thing actually is? I've read some articles but, to be honest, they seem to be generally written for someone who is already \"initiated\" - meaning someone who isn't convinced this is simply a mental disorder. I can PM our chatlogs (I got permission, don't worry) once I figure out the easiest way to blur out the names involved. \n\nFinally, please, PLEASE believe me when I say I'm not trying to start a shitflinging contest here, and I'm not a fucking right wing subversive element here trying to stir up trouble and bring screencaps of \"st000pid SJWs\" back to my alt right friends. I am actually a 20-something male who is completely and utterly out of the loop insofar as this stuff is concerned. Thanks in advance.\n\nPS: I'm not calling her \"girlfriend\" and \"her\" out of spite, she said it's fine.", "date": "2016-07-31 02:54:46", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4vfchp/girlfriend_came_out_as_bigender/", "author": "throwawaybutnottroll", "reference": 3023}, {"title": "I don't feel nonbinary enough [vent]", "text": "I'm mostly feminine or i guess i want to be; i don't feel NB enough because of this. the other day i was looking at perfumes online, typically feminine scents and then i got overwhelmed and upset because i liked them, but i didn't, and then i felt they didn't truly suit me, i don't know what to do even though this isn't a big deal. i'm pretty closeted in my struggle and i just feel like nobody really understands or cares that i am NB.\n\nbut thinking about all of this makes me feel like i'm not non-binary enough, i've even been told my feelings of gender dysphoria, aren't, all because occasionally have an aversion to female clothes and i literally couldn't recognize myself in the mirror, i literally felt outside of my body and i didn't know what i wanted...\n\nim tired of this struggle. i'm really tired of struggling with my queerness, i hate it lately. i love and hate it", "date": "2016-07-31 12:12:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4vgtxx/i_dont_feel_nonbinary_enough_vent/", "author": "[deleted]", "reference": 3047}, {"title": "[Rant] I hate social construct arguments", "text": "Can we all agree that gender is a word and must be treated like any other word?\n\nWords change. That's the point of having words. That's why your argument is invalid, because the only FACT here is that words change and everything else is an assumption. [edit]\"Gender is a social construct\" is an assumption (actually 5, because it has 5 words in it).[/edit]\n\nBleh.", "date": "2016-07-31 21:05:33", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4vj0v3/rant_i_hate_social_construct_arguments/", "author": "SoniEx2", "reference": 3085}, {"title": "1st time binding- yay :) Feels like squishy ribs :P", "text": "", "date": "2016-08-01 01:02:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4vk0wn/1st_time_binding_yay_feels_like_squishy_ribs_p/", "author": "phrygiansaz", "reference": 7}, {"title": "LMFAOO TRUUUU", "text": "", "date": "2016-08-02 17:25:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4vtmys/lmfaoo_truuuu/", "author": "CarLoser23", "reference": 140}, {"title": "Can anyone recommend some fiction (other than Leckie...) set in a world that has no concept of gender or considers it outdated?", "text": "Firstly, I would like to explicitly state (so nobody feels I'm attempting to appropriate something I have no experience of) that I am a male. I was born male and have no issue with being referred to as he/him, though it is not an integral part of who I am.\n\nI am also a writer (I know, I know) with the belief gender as a concept will eventually die out as the idea that gender and sexuality are fluid becomes more acceptable.\n\nI am not looking to parade non-binary people around because they are 'cool and hot rn', I want to write a story set in a world where gender is viewed as a long-lost or non-existent concept, without the division of pronouns.\n\nFurther to this, I'm not a revolutionary, I'm not trying to make a political point, just further explore the idea of a world without gender, without making it the focal point.\n\nIf anyone can suggest any fiction which has done the same, I would love to read it. Also, I welcome any advice and guidance on how I could approach this realistically (even if it's just 'fuck you, don't') because I firmly believe to attempt this, as an outsider, without seeking out the experiences and beliefs of those who live it every day, would be worse than not doing it at all.\n\nThank you.", "date": "2016-08-03 16:48:53", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4vzgyw/can_anyone_recommend_some_fiction_other_than/", "author": "EilrahcNotneb", "reference": 240}, {"title": "I DON'T HAVE A GENDER!", "text": "", "date": "2016-08-07 13:28:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4wkty0/i_dont_have_a_gender/", "author": "AJ1413", "reference": 589}, {"title": "#NonBinaryYT: P2. Let's Talk About Transition [CC]", "text": "", "date": "2016-08-08 19:50:30", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ws3sp/nonbinaryyt_p2_lets_talk_about_transition_cc/", "author": "herbdino", "reference": 724}, {"title": "Unease", "text": "Perhaps this isn't the best place to ask but I'll give it a try. I am a cisgender male who is technically heteroflexible but really just heterosexual.  I am currently dating a non-binary person who is biologically female, and we have been together for a few months now.  We have had a really harmonious relationship and are very open with each other about out problems and helping each other with them.\n\nHowever lately I've been depressed about the relationship,  and while I still love this person to death I'm worried about my subconscious attitude towards the relationship. I'm constantly worrying about making the wrong move, which may be partially due to them being my first significant other but also just because I feel I need to be more cautious about what I say and do. This is tied in with the fact that despite the fact that I am completely supportive of my partners identity as a non-binary person, I still get pangs and the feeling that they should be she, and that that is unconsciously affecting my interactions with them.\n\nThis is not in my near future, but part of my dream for life is to have children, who are my biological children. My partner isn't really into the whole idea of children and much less bearing children, and although I don't know that we ultimately will end up in such a relationship but I always look ahead and I have a hard time seeing how we could ever work out in that respect.\n\nFinally, we won't be seeing each other for much longer as they are moving far away from me and neither of us feel that a long distance relationship is possible or what either of us want. As they are my first love I may be more frantic about this than I should be but I dream about meeting up with them again after I'm more established and restarting our relationship. But I'm worried about the changes to both of us and I think it's affecting my relationship with this person right now.\n\nI want to emphasize that my partner is 100% not at fault for any of this. We both were in love and I made the decision to love this person regardless of their gender. But I want to ask if you all here have any advice for me on how I can silence some of these doubts.  I'm willing to work hard to silence them. I know this may also have a better place in a relationship thread but I'm not sure how they will take this and I'm also new to this website so I'm not intrested in trying. Any advice is welcome!", "date": "2016-08-09 23:33:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4wz7xz/unease/", "author": "F_I_J_I_L_O_R_D", "reference": 848}, {"title": "I don't know who I am", "text": "(Question/seeking help) Hi my name is Eli, I was born female but sometimes I want to be male and others I want to remain femme! I have no clue what my true gender is please help me!", "date": "2016-08-10 18:44:46", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4x3oqc/i_dont_know_who_i_am/", "author": "apevaulter", "reference": 928}, {"title": "Another name post (WhoamI_24601!)", "text": "Heyyyy! So I've been trying to come up with a new name and so far I 've got Ari (pronounced Ah-ree), Avery with a nickname Avy, Eli/Elie and Rafael with a nickname of Raf or Raffi. I like the first two names but Ari I find is similar to my current name, and Avery I'm worried is not masculine enough. (I'm afab transmasc and I want quite a male-read name) I really like both Eli and Raffi but wonder whether Rafael is too formally and also they're biblical names? But my current name is Biblical anyway :P Also my last name starts with R so Raffi might mean I'd have to find a new last name too. Also I think my SO prefers Ari but I keep seeing the similarity to my current nameeeee... Any advice would be nice please :) ", "date": "2016-08-12 16:20:48", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4xecgk/another_name_post_whoami_24601/", "author": "phrygiansaz", "reference": 1098}, {"title": "What exactly is Non-binary?", "text": "Can someone explain to me moderately in-depth what Non-binary is? Because my current understanding is from Tumblr, and as we all known Tumblr isn't exactly the greatest source in the world. I at the moment don't understand enough about Non-binary to really recognize it as a gender. If anyone has any reading material or anything that'd be great! Thanks for reading!", "date": "2016-08-15 01:44:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4xra69/what_exactly_is_nonbinary/", "author": "Secularizt", "reference": 1336}, {"title": "This article is painful -- Coming out as 'non-binary' throws other women under the bus", "text": "", "date": "2016-08-16 15:16:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4y00fe/this_article_is_painful_coming_out_as_nonbinary/", "author": "reveurdecafe", "reference": 1508}, {"title": "nb amab folks with receding hair line— how do you deal?", "text": "I id as nb/agender and while I do present masculinely in many ways, one thing that really fux with me is my receding hairline. I find it too masculine to fit how I want to present. Any one else here struggle with this? How do you cope? I know that total baldness is in my future, and I'm actually excited about it. My wig collection is going to greatly benefit. However, it's this in between phase that is killing me. I don't want to give up the fight too early in the game and start shaving my head. I feel like I've got to enjoy what I have while it lasts. Plus, I've worked too hard growing out this gay ass mullet to chop it off. Any advice or experience shared would be greatly appreciated!", "date": "2016-08-19 19:50:32", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ykw2x/nb_amab_folks_with_receding_hair_line_how_do_you/", "author": "spitneon", "reference": 1835}, {"title": "I'm having a bad moment: vent", "text": "I'm non-binary and I don't want to sound overdramatic but I struggle a lot, not every day, but a lot of days. Sometimes about what I wear (I want to dress masculine and look masculine sometimes/go by a masculine name, but I'm a lesbian, so... that seems problematic).\n\nAnd I'm fine with being typically feminine. I like my long hair, sometimes I want to wear it long like a guy's. I don't know where this comes from but it doesn't bother me, but I'm confused. I don't know who I am. I'm fine being addressed by my name, but online I go by another feminine name, and the middles are kind of gender neutral (two of them, and then there's another feminine name).\n\nI just.. I just don't feel... valid.. or.. something. I don't know, I feel lost. I feel like I'm not non-binary enough, or something. I guess I'm just feeling confused and sad and I don't know why. I go between liking myself and hating myself.", "date": "2016-08-20 16:17:50", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4ypscd/im_having_a_bad_moment_vent/", "author": "[deleted]", "reference": 1898}, {"title": "Help; Androgyny and High School", "text": "Hi, younger androgyne here. (Throwaway account for reasons.) I may post this on multiple subs because I need as much advice as I can get.  \nI'm AFAB and going into high school this year. As if starting freshman year in high school isn't nerve wracking enough, I'm genderqueer and have some concerns.  \nA little background information (This paragraph isn't necessary, but I kept it here in case others relate or have advice about other things as well): I've felt mentally androgynous all my life, and was lucky enough to become familiar with non-binary identities last year. My understanding of these identities was very vague at the time, but it was enough to know that it matched me. Since then, I've not only learned much more but transitioned my appearance to look more androgynous, which has made me more confident and comfortable in my own skin. I wear a binder and ambiguous clothing. Fast forward to recently, my frustration with being seen as a girl (social dysphoria) boiled over and I spent months on edge, overly-reinforcing my masculine attributes and snapping at the word \"lady\". Thankfully things have leveled out again and I'm comfortable. What I'm looking for is a few answered questions from some more experienced people. I know some of these are hard because they should be things I'm deciding, but I'd like more input.  \n* First of all, what should I do about changing for gym? My parents say going to a separate room such as a bathroom would make me an outcast and segregate me from others. They think people would wonder about it and such. On the contrary, I wear a binder... I guess I could wear a tank top over it when I change. As long as I convince myself a \"girl's\" locker room is just another way of saying anyone-whose-biological-sex-is-female's locker room, I feel alright with using it.  \n* How are things socially in High School? I've heard it's tougher in regards to drama and teasing. I feel like at the least people will call me gay behind my back because they don't know what to make of me(they did this at the end of 8th grade), and at the most I could be bullied or something. I just want to make my high school years as enjoyable as I can. I also worry if people will initially, if not always, be weary of interacting with me because I'm different.  \n* Should I use a different name? The name I was given at birth is very feminine, and was the 2nd most popular girl name of my year. It's not too bad of a name... but last year I picked out a neutral name for myself that I adore, and my friends call me by it. I'm debating whether I should go through the trouble of getting all the teachers to call me by my new name, or just stick with my old one and keep the new one for friends. I guess ultimately I'd like to know if I should pass as an androgynous(in appearance) girl just to make my life easier until I get out of high school and have more freedom.  \nAny other advice for surviving high school in general would be greatly appreciated. Thank you so much!\n\n", "date": "2016-08-20 22:16:07", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4yrj15/help_androgyny_and_high_school/", "author": "Ember228", "reference": 1939}, {"title": "I woke up and............ my voice is dropping. woo a step further towards a neutral voice.", "text": "https://soundcloud.com/user-465072119/book (reading some time ago(4 weeks , sitting down but trying to go deep\n\njust now, no trying hard  just normal reading sitting down\nhttps://soundcloud.com/user-465072119/book2\n\nhttps://soundcloud.com/user-465072119/book3", "date": "2016-08-22 06:09:13", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4yz6w6/i_woke_up_and_my_voice_is_dropping_woo_a_step/", "author": "morri85", "reference": 2045}, {"title": "31 mtnb, 2.5 months into physical (HRT) transition, identify as nonbinary but heading toward more femme presentation. Posting this as an official celebration of changing my name on Facebook :)", "text": "", "date": "2016-08-22 12:40:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4z0bzd/31_mtnb_25_months_into_physical_hrt_transition/", "author": "runkid84", "reference": 2059}, {"title": "MY AGENDER JOURNEY | 7 Months On Estrogen | Transition Update", "text": "", "date": "2016-08-24 12:36:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4zccgj/my_agender_journey_7_months_on_estrogen/", "author": "AJ1413", "reference": 2234}, {"title": "Must read! LOCAL RESIDENT COMES OUT AS NON-BINARY, WORLD DOESN’T END", "text": "", "date": "2016-08-25 15:53:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4zj6ud/must_read_local_resident_comes_out_as_nonbinary/", "author": "reveurdecafe", "reference": 2358}, {"title": "Are there any resources to help explain being NB to my husband?", "text": "My husband is struggling to really understand my experiences, I guess because he comes at it from the angle of a binary trans man because that's the only experience he understands. He only sees dysphoria as being related to genitals and chests, and can't understand the idea of someone being trans without experiencing any dysphoria of this type. Can anyone help? Or does anyone have any experience with anything similar?", "date": "2016-08-25 18:02:52", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/4zjw22/are_there_any_resources_to_help_explain_being_nb/", "author": "transpartneracc", "reference": 2374}, {"title": "I feel so wrong and have no way of fixing that", "text": "This is going to be a bit of a rant/vent post, so if your not up for that... \n\nI don't know what I am. I'm not cis, but I'm not transgender either. At best, I feel like I'm a woman, a man, and neither of the two at the same time. My preference for physical representation would be as androgynous as possible, but I can't achieve that without surgery (I bind my breasts, but they're too large to be fully flattened - I'd like to have them removed or at least reduced). However, because I'm not transgender I obviously wouldn't be prescribed surgery by public health care due to incredibly strict regulations, and I can't afford to have it done at a private clinic. \n\nLooking at myself in the mirror makes me want to claw every inch of my skin to shreds. I can't stand feeling so disgusted by my body all the time and having absolutely no way out. I don't know what to do. ", "date": "2016-08-31 15:51:28", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/50hv3q/i_feel_so_wrong_and_have_no_way_of_fixing_that/", "author": "MyMainMein", "reference": 2881}, {"title": "Seeking participants for research study on experience of being trans* and on the autism spectrum", "text": "Researchers at UMass Boston want to learn more about your experience of identifying as gender diverse (transgender or gender nonconforming) and as being on the Asperger’s/Autism spectrum.\n\nWe are specifically hoping to speak to individuals on the autism spectrum (who may identify with the following labels: Asperger’s Syndrome, Autism Spectrum Disorder, High Functioning Autism, Pervasive Developmental Disorder, neurodivergent) and as gender diverse (including but not limited to identities such as, transgender, transman/woman, genderqueer, gender vague, non-binary, agender, gender nonconforming).\n\nThis study might be a good fit for you: \n• If you are willing to talk about your experiences with these two identities \n• You are 18 years of age and older \n• Identify (broadly) as being gender diverse (transgender or gender nonconforming) and on the Asperger’s/Autism spectrum.\n\nParticipation in this study includes: \n1. A brief phone screening \n2. A one hour individual interview \n3. Receiving $25 gift card, as compensation for your time\n\nTo take part in this study, please contact Meredith Maroney at Meredith.Maroney001@umb.edu", "date": "2016-09-02 14:35:10", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/50tipb/seeking_participants_for_research_study_on/", "author": "meredith_10", "reference": 151}, {"title": "resources for non-binary survivors?", "text": "hi everyone-\n\nplease forgive if this is not the right place for this question, and let me know what to do to fix that if so. i am brand new to reddit.\n\ni am a low-income, biracial, disabled non-binary adult living in the U.S. my question is, does anyone know of an online forum for survivors of sexual assault ***that is inclusive of non-binary survivors***?  recently i was really struggling, i called the trans lifeline, they directed me to aftersilence.org... but to register for AS forums, one must select gender, either male or female. i was heartbroken when i saw that.\n\ni was also directed to FORGE, but i've previously tried to get on their listserv and no one ever emailed me back :(. they don't have a forum. i see that they have publications and already plan to read them through, but it already feels like they round people off to \"ftm-vector\" and \"mtf-vector\" that leaves me still feeling excluded so there's that.\n\nanyway. if you know of any other resources that'd be great. i've previously contacted RAINN, NCAVP, all sorts of places and come up short. the main thing i'm looking for is a resource for sexual assault survivors (an *interactive* resource, like a forum or chat), where someone can vouch that yes, they are inclusive of non-binary folks. thanks in advance", "date": "2016-09-04 18:39:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/515ar1/resources_for_nonbinary_survivors/", "author": "idemandarefund", "reference": 333}, {"title": "Nonbinary Queer looking for more friends", "text": "", "date": "2016-09-05 02:40:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/517d2c/nonbinary_queer_looking_for_more_friends/", "author": "punk-as-puck", "reference": 369}, {"title": "I'm looking for a list of pronouns with descriptions for each", "text": "Here's an example of a list: http://askanonbinary.tumblr.com/general\n\nThere are many around the internet like this, but I would love to find one with a short description next to each one explaining when they should be used, and what they mean about the person they are describing. Thanks!", "date": "2016-09-10 12:27:21", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/522vz3/im_looking_for_a_list_of_pronouns_with/", "author": "MUSICEATPEOPLE", "reference": 835}, {"title": "WHAT IT'S LIKE TO BE NONBINARY- a super adorable skit that is very accurate", "text": "", "date": "2016-09-12 04:47:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/52cozl/what_its_like_to_be_nonbinary_a_super_adorable/", "author": "riddlefox", "reference": 994}, {"title": "Dating Someone With No Gender | AGENDER", "text": "", "date": "2016-09-12 12:49:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/52e5ss/dating_someone_with_no_gender_agender/", "author": "AJ1413", "reference": 1017}, {"title": "Dating Someone With No Gender | AGENDER", "text": "", "date": "2016-09-12 12:51:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/52e64h/dating_someone_with_no_gender_agender/", "author": "AJ1413", "reference": 1018}, {"title": "Genders", "text": "[removed]", "date": "2016-09-13 11:31:29", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/52jyuf/genders/", "author": "Codymichael511", "reference": 1104}, {"title": "Spotify add third gender option to registration form", "text": "", "date": "2016-09-16 12:56:25", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/531qwv/spotify_add_third_gender_option_to_registration/", "author": "cassolotl", "reference": 1375}, {"title": "I don't feel non-binary enough -- I don't fit in anywhere, it seems.", "text": "I identify as female but I often feel very nonbinary. I struggle with being feminine, sometimes I feel masculine. Particularly with clothing, I don't care what I wear, and sometimes male clothing is more comfortable, warmer, etc. But it's not about the clothes.\n\nI feel like I'm not Non-binary enough, not lesbian enough, etc, basically because I don't really present. Even my name, which I want to change, it's still feminine, but the middle names I've picked out are sort of gender neutral/feminine. Again, I just don't feel enough and I don't know why. I'm probably focusing on details that don't matter, I don't know.\n\nWhat I do know is I'm very much not the same person, something feels different. I have a connection to my body, I feel feminine, but not always, and I don't know if it's genderqueer. I feel lazy or something in not wanting to experiment, but it's tiring, I just want some kind of answer.", "date": "2016-09-17 13:32:33", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/53786a/i_dont_feel_nonbinary_enough_i_dont_fit_in/", "author": "Blondintino", "reference": 1458}, {"title": "My non-binary girlfriend is getting a binder and that scares me a lot...", "text": "Hello, I'm sorry if any of the things I will say offends any of you in any way that is really not my intention.\n(also sorry for any grammar/spelling mistakes as english is not my first language)\nLet's begin: I am a girl and I have a very serious relationship with F., born female that identifies as nonbinary/genderfluid/doesn't really know.\nI feel like F. is my one true love, we've known each other for almost 8 years know, we dated when we were 18 and now are in a more mature relationship after some time apart (we are 24/25 now). When we started dating again two years ago F. told me right away about the nonbinary thing and that has never been a problem with me. I love when they wear make up and I love when they wear baggy menswear. Today F. started a gofundme campain to try to get some money to buy a binder. That unexpectedly totally freaked me out and I am afraid I hurt F's feelings.\nI know that it'll sound really selfish but I'm afraid that the binding could be the beginning of a female to male transition and that I might not find F. attractive in male form. I find the male body very unsettling and it actually grosses me out, I have absolutely no problem with androginous appearence though.\nI fear that F's well beeing and my well beeing might not be compatible in the lifelong relationship I've always imagined, and I don't know how to express that or even if it's right if I do. I want to be with F. and support them but at the moment I don't really know how, that's why I'm writing here, I need some good advice on what to do. And please tell me that I'm not a horrible person for being scared about our future.\nThank you for reading.\n", "date": "2016-09-18 21:32:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/53eacb/my_nonbinary_girlfriend_is_getting_a_binder_and/", "author": "CandeGrey", "reference": 1562}, {"title": "Awkward (offensive) thought that comes to me again and again.", "text": "Hey, first time on this subreddit so I apologize if this kind of thing has been beaten to death, but I genuinely want to discuss it because it bothers me.\n\n\nMost of the people I know that identify as nonbinary are, well, biologically female. This seems to be consistent throughout real life, online friends, both online and offline lgbt-friendly communities, etc.\n\n\nI've come to realize that over time, because of my experiences, I have somehow stereotyped nonbinary self-identification as a \"girl\" thing. Whenever I see someone online declare themselves as nb, a lightning thought goes: \"its probably a woman\". I hate that my brain does this automatic tic. But on some sort of subconscious level, my brain seems to have reasoned that \"nonbinary\" developed primarily because society's narrow limitations on their gender create an image that women don't want to be forced into or associated with. Same thing for nonbinary men, but since society gives men less trouble in general, theres much, much fewer nb men. Idk, I get kind of douchey inside cause my reasoning goes: \"they're still technically female, they just don't like stereotypically girly things. That doesn't mean they're something else. A woman can be whatever she wants, your gender doesn't define you, you dont need to disassociate yourself from it to act the way you want\"\n\n\nThe twist is...I'm a trans man. Those kinds of excuses were what my parents would say to discredit me when I first came out to them. These were the kinds of excuses I made to myself throughout high school trying to come to terms with my identity, only for it to ring hollow. I've been tortured over gender identity my whole life. Being misgendered sucks. So thoughts like this make no sense to me. How could I finally start unraveling my own dysphoria and then shit on other people's, especially when a lot of it coincides with my own fears: what if \"I'm not actually trans, I'm just trying to run away from social standards of womanhood\", what if I'm just a...cowardly woman.\n\n\nIn any case, curious on your thoughts about this, whether anyone has similar internal thoughts and issues. Also if this just comes across as a big douchey misinformed horseshit on nonbinary people I'm very sorry and I will leave.", "date": "2016-09-22 04:15:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/53xanb/awkward_offensive_thought_that_comes_to_me_again/", "author": "[deleted]", "reference": 1883}, {"title": "Friend shared an article that has me questioning myself", "text": "A Facebook friend shared [this article](https://aeon.co/essays/the-idea-that-gender-is-a-spectrum-is-a-new-gender-prison). \n\nI identify as non binary, and this article is really invalidating. It's making me question myself - is my dysphoria not real? Am I just a confused woman that doesn't conform to gender ideals? Then why does the idea of being in a male body feel comforting to me, and yet, despite wanting a male body I don't wholly identify as male?\n\nThoughts? Advice? Not sure if I want to comment or not on her post. ", "date": "2016-09-23 01:20:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/542cio/friend_shared_an_article_that_has_me_questioning/", "author": "tinyshain", "reference": 1958}, {"title": "This is me coming out", "text": "This is the first time I've said these things out loud or to anyone other than my wife. It's not that these feelings have never existed until now, I just grew up in a culture of suppressing what others may see as weakness. I grew up in a very traditional yet somewhat open minded Roman Catholic family. When I came out as a lesbian my family accepted me right away and I had a somewhat smooth transition into living and loving how I wanted.\n\nYet throughout my entire life I've always felt like it didn't just simply stop at being gay. I always felt this nagging insecurity that I couldn't quite peg. The older I got the more masculine my appearance became and each step I took towards that appearance felt right. Yet at the same time I carried myself in a slightly feminine manner. I enjoyed both. I identified with both. It always left me feeling very uneasy.\n\nOver the years I chalked it up to just being butch, but I've been experiencing some strong dysphoria these past couple of years. I'm 24. My hips have gotten more defined and I no longer have that slim flat body. The things that make me noticeably female make me hide. I don't fit into the male clothes like I used to. But I haven't come to the desire of wanting to be a full blown male. I don't mind my female pronoun. I'd prefer a more gender neutral name. And I enjoy my genitalia and have no desire to change it. My main dysphoria right now is concentrated in my breasts and hips.\n\nI feel comfortable now to be out as non-binary. To me it's so liberating to find the space and answers of where I belong. What lane I'm in. \n\nI would appreciate any advice as I'm going to start binding for the first time. My wife is unbelievably supportive and I feel like I'm finally at that point where I've accepted who I am and am just ready to be comfortable in my skin.\n\nCheers to you all who are living your life in the body you want. whatever it may be. Your stories are so beautiful and I feel so strongly connected to it. &lt;3", "date": "2016-09-23 05:50:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/543bzb/this_is_me_coming_out/", "author": "kafkarol", "reference": 1976}, {"title": "My partner's family call me Auntie [name] when we're with the kids...", "text": "I came out has nb to my partner a couple of years ago and he was completely accepting and supportive. His family don't know I'm nb because they all believe in the gender binary. This isn't usually a problem, but whenever we go visit his brother's I am always referred to as Auntie [name] when we're in front of the kids. It really bothers me and makes me feel sick, but I don't know how to bring it up without outing myself or sounding...dickish? Is there a term you can use in place of Auntie/Uncle? I'd really appreciate some advice. (Also, sorry if I'm not supposed to post this Kind of thing here? I'm new to reddit.)", "date": "2016-09-23 10:46:25", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5443yk/my_partners_family_call_me_auntie_name_when_were/", "author": "robinsonar", "reference": 1990}, {"title": "The NonBinary Network: starting a community across social media platforms to bring us all together!", "text": "", "date": "2016-09-23 16:05:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/545g3u/the_nonbinary_network_starting_a_community_across/", "author": "opiixon", "reference": 2008}, {"title": "Do I have any right to feel this way?", "text": "So I'm AFAB nonbinary, would consider myself bigender. I have days of various degrees of gender expression, usually leaning masculine with a binder some days. \n\nThe issue is that it seems no matter what I do, I still read as female. Which wouldn't be a problem if people didn't feel like pointing it out all the time. I guess it's because I often move through male dominated spaces. \n\nJust today I was playing a game. I noted that the art on a card depicting creatures hiding in a wheel was kinda cute. The guy said \"I've only heard women say that. Us guys notice the big wheels\" or something like that. It kinda killed me a bit on the inside.\n\nThe thing is, I feel like I don't have any right to feel this way because I don't 100% everyday strive to make my identity obvious. I have long hair that I've kept long because it's fly as hell, and while I know men with long hair exist it's something I feel that would help if I did cut it. My face issuer round and feminine, which I can sorta change with makeup and maybe intensive gym workouts? I wear masculine clothes, I was wearing masculine clothes in this particular moment (no binder but I was wearing several layers and felt lazy/didn't want to die). My voice is naturally deep but still clearly feminine. I'm the height of an average man but everything else still reads female.\n\nI just don't want people drawing attention to how they perceive me gender wise, because I know I'm failing at it, but there's no way to let people know of this without potential issues. And I can't really be angry at someone for doing something they have no way to be aware of. \n\nIt just feels like no matter what I do, because of my stupid baby face or whatever I'm just going to automatically be put somewhere and treated accordingly. And that the only way to even possibly begin to fix that is if I do things I don't really want to do. I'm not intense enough to have my identity taken seriously, and I also have no right to complain or feel upset because I'm not putting in the effort. ", "date": "2016-09-24 10:29:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/549lva/do_i_have_any_right_to_feel_this_way/", "author": "throwawayddeeee", "reference": 2063}, {"title": "Non-Binary me. Male-spectrum presentation, neutral presentation, and female-spectrum presentation", "text": "", "date": "2016-09-24 19:10:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54bk4o/nonbinary_me_malespectrum_presentation_neutral/", "author": "forest__creature", "reference": 2089}, {"title": "Anxious about coming out..", "text": "I'm 18, and just starting college, and lately I've been considering whether I should come out to my parents as nonbinary? They've both already accepted me being pansexual, but I'm not how they would respond to me being nonbinary. I don't think they would do anything drastic like kick me out or anything, and I think my stepmom at least would likely be at least somewhat accepting of it, but I'm not really sure about my father. He's said that he has \"mixed feelings\" about nb people,  and has previously made some odd (and perhaps somewhat insensitive) statements about it. He's also rather awkward when it comes to discussing gender or sexual orientation, or anything along those lines. Again, I don't think I would be kicked out or anything like that, but I am very nervous. At the same time though, if I don't come out I might have to wait until I move out to buy a binder, etc. And, frankly I'm not sure that I'm comfortable waiting that long..", "date": "2016-09-24 22:06:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54cbpn/anxious_about_coming_out/", "author": "esotericisms", "reference": 2109}, {"title": "We are Trans_Friends, a new Discord community for trans and intersex people looking to make friends![x-post]", "text": "[Trans_Friends](https://discord.gg/GqyB9sw) is a super new [Discord](https://discordapp.com/) group that is focused on providing a space for trans and intersex people to meet, make friends, and build community. \n\nWe see that there is a lot of fragmentation within the wider trans community, and we hope to provide a space that is both understanding and enriching, while being a safe space.\n\nWho are \"we\"? We are the mods of Trans_Friends, a collection of trans women who felt that the internet could always use more space for trans and intersex people to come together. We feel that our commitment to transparency and community conflict resolution bring something different to the table, and we hope that the space we've created can help you connect with new friends.\n\nThe group is very new, so please help us grow!\nhttps://discord.gg/GqyB9sw", "date": "2016-09-25 01:58:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54d7tj/we_are_trans_friends_a_new_discord_community_for/", "author": "BrokenBowOfYew", "reference": 2128}, {"title": "Someone in /r/streetwear wanted to know if they could wear their girlfriends leggings.", "text": "", "date": "2016-09-25 15:04:55", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54fgjy/someone_in_rstreetwear_wanted_to_know_if_they/", "author": "SublimeSkater", "reference": 2160}, {"title": "I get so frustrated so easily [Rant]", "text": "I am surrounded by so many accepting people that I can forget how cruel the rest of the world can be. My family has accepted my non-binary identity from day one and never even hinted that there are \"only two genders\". But every time I speak about non binary identities online outside of trans communities, all I get is a barrage of people trying to invalidate my identity. It comes from everywhere. Cis-het people, LGB people, binary trans people. Even non-binary people trying to invalidate non-binary identities other than the select few they approve of. \n\nIt gets so tiring. Never has it made me doubt that I know who I am or that the thousands of non-binary individuals are any less than 100% valid, but damn if it doesn't get under my skin just to hear other people spout that nonsense. This morning, I had another trans person go cold shoulder on me because I introduced myself with my pronouns, and they were offended by it. They said they loathe the idea of people walking around in a \"BuzzFeed Safe Space\" (what?) and having 30 different labels. Then asked if I was one of those who thinks there are a million different genders. Of course I argued. And of course it was like talking to a brick wall. OR maybe spitting in the wind is more accurate because it did nothing but gross me out in the end. \n\nI really want to be vocal about being trans and about being non-binary. I wish I had the courage to make the YouTube videos I've been wanting to make. But I honestly don't think I could handle the negativity. I'm sure we've all seen the cesspool that is the YouTube comment section on any video mentioning non-binary identities. That shit would have me foaming at the mouth with every video I made. ", "date": "2016-09-25 16:00:22", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54fp97/i_get_so_frustrated_so_easily_rant/", "author": "LeannaBard", "reference": 2163}, {"title": "Hey y'all, I'm 15, nonbinary &amp; pansexual and I was wondering if anyone would like to chat/be friends?", "text": "I'm really interested in talking to other nonbinary/queer folk but some of my existing friends can be a little annoying at times. Anybody want to chat?", "date": "2016-09-28 10:55:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54vrfu/hey_yall_im_15_nonbinary_pansexual_and_i_was/", "author": "Cazonichi", "reference": 2425}, {"title": "California Legally Recognizes A Citizen As Nonbinary - How The Hell Do I Do That?!", "text": "So I've been reading about the first non-binary person recognized legally by the state of California. This like, just happened. I'm in California and I want to change my gender ID to nonbinary - do any of ya'll have more information on the legal gender changing process now that things are different for enbys in Cali?", "date": "2016-09-29 00:36:24", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54zm0t/california_legally_recognizes_a_citizen_as/", "author": "spacesprout", "reference": 2485}, {"title": "juxera!", "text": "are there any other fellow juxeras out there :0 id love to talk to some ^^", "date": "2016-09-29 01:53:33", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/54zxrg/juxera/", "author": "equiuszahhack", "reference": 2488}, {"title": "Understanding gender", "text": "Hey everyone I am working on a website. The website requires you to make a gender selection when you create a profile. I am reading tons of articles on non-binary, gender fluid, and gender queer. So my question is what would be the best way to list your gender, we are not looking to put every single type of gender. So far I have Female, Male, Trans FTM, Trans MTF, Non-binary, Gender fluid, Gender queer, and prefer not to say. \n\nWhat are your thoughts?", "date": "2016-09-29 03:12:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5509g7/understanding_gender/", "author": "randy1984-2016", "reference": 2493}, {"title": "Is a relationship between a Cisemder ad a Nonbinary a heterosexual relationship?", "text": "Just a shower thought.", "date": "2016-09-30 13:08:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/557t91/is_a_relationship_between_a_cisemder_ad_a/", "author": "IHeartGrantGustin", "reference": 2629}, {"title": "Nonbinary Resources?", "text": "Hi all! Genderfluid (ftm trans possibly?) kid here. I'm about a week or so from coming out to my (moderately conservative) parents. I have a notion that they're going to think that this whole \"nonbinary\" thing is something that I totally made up. I want them to... not think that. So what are some resources I can use to prove to them that nonbinaryism is a real thing?\n\n(Also general transgender, especially ftm stuff, would be cool. They know about Caitlin Jenner so there's that, but I think they would want to know more about why/how I am who I say I am.)", "date": "2016-10-01 01:52:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/55b998/nonbinary_resources/", "author": "Wes_the_Best", "reference": 10}, {"title": "This is me trying to get some clarity on a few things, wondering if someone could advise?", "text": "Just for some context. I'm feeling really really emotional right now and I think that's a sign that I'm doing the right thing. I'm still new to learning terms so I hope I do not offend and this is the right place to post. By my understanding, nonbinary can be a broad term so I thought I'd try here.\n\nI am AFAB? I was assigned female at birth and I am 23 years old. Already that makes me feel quite old in the community as I see amazing non binary young children discovering who they are but, I suppose that's their journey and not mine.\n\nThere are times in my life, I do not feel I identify as a woman. There are times where I will dress or attempt to dress more \"masculine\" (I put in quotes because definitions of these things are so fluid?). This is something I've done, or feel I have done for a few years now. I gradually started to wear less skirts and dresses, although I do now and then. To be honest, sometimes it makes me feel uncomfortable. I feel really exposed. \n\nAnd that's something I've noticed lately. Sometimes having breasts makes me feel uncomfortable. I was a smaller size a little while ago, experienced the same thing and it's worse now they're bigger. That is something I have experienced for as long as I can remember. They feel like two foreign objects on my chest that get in my way and I, for a moment, wish to take them off. But again, this is not 100% of the time.\n\nI have in the past and recently had people refer to me using female pronouns (she/her). It makes me almost flinch, something feels off and I almost feel like they're not talking about me. I find also lately I'm trying to explore my gender expression so on days where I feel very disassociated with my birth gender, this irks me. Recently when my flatmate was having company, I subconsciously felt awkward because I was the only \"boy\". Referring to myself as such didn't feel off. \n\nI have a close group of male friends I formed over the years and there are social situations where they perhaps will almost feel the need to apologise for comments that women may find offensive. This also confuses me and feels unnecessary. \n\nI know a very common narrative amongst the trans* community is having strong feelings growing up. I know that I have for sure thought of a male name that I would go by. I also did wear a boy's top that my parents let me purchase (but I don't think that's a huge deal). \n\nI do enjoy wearing makeup, although I haven't for a while and recently it's just not been my thing. When I dress up and make an effort, so to speak, it feels off. It feels like I'm drawing attention to myself that I feel uncomfortable with. I have constantly battled to be body positive and love myself but I also have been diagnosed with body image distortions so that doesn't help.\n\nI have also (just last night, for the first time) attempted to bind and tuck in the privacy of my home. I'm so so very curious. I did recently date someone else who is non binary and transitioning. I can't help but think that at first, I was researching to get a better understanding, to support. But here I am, still researching. I thought I wanted to be more like this person, that I was taking on too much of their personality. Could it be possible I am processing their transition for them or really it's just triggered a lot of repressed feelings I've had since I was younger.\n\nI'm so confused, I feel emotional and so alone. I plan on potentially mentioning this to a doctor soon. Even if I find I am cisgender, I feel l need to address why I keep coming back to this uncertainty. I believe that there's no way I'd be questioning and researching this much unless I felt something on some level. ", "date": "2016-10-02 10:30:31", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/55hq6g/this_is_me_trying_to_get_some_clarity_on_a_few/", "author": "_momo3000", "reference": 117}, {"title": "Finally understand myself or am starting too", "text": "\nHello I am VeggieBunnie,\n\nI just want to share my story in hopes that it will help someone else along their journey. I'm 24 and for work classified as a female. How ever I'm non-binary and I'm so happy I can say that out loud.\n\nGrowing up I was a tomboy and it never really left the older I became. I just never felt like a girl and in later years never really felt like a boy either, I was just well me, and that’s how people saw me. That weirdo over there, and by the end of highschool I had come to accept it. I recall feeling pissed off and frustrated and getting into yelling matches for years with trying to explain to people that I'm not a girl. How ever puberty blessed me with curves and a very feminine body, that I hated for years. I went through the make up phase and all of it was inspired by David Bowie that man changed my life. I also would do my best to flatten my chest  so my boobs weren’t so apparent, and having large boobs that wasn’t the easiest thing to do. Over the years  I have come to love my body, and discovered I can be me regardless of what I look like now a days.\n\nOne summer in highschool I was watching the discovery channel about transgenders and how people felt trapped in there bodies. And I was like I feel trapped in my body, but I don’t want to change what I look like, maybe have smaller boobs but that’s it. My dad was convinced for years that I was going to be a boy. We have long since had that conversation and hes okay with me just being well me. This how ever never stopped me from leaning more toward masculine roles or just in my mind being in strong roles. I avoided dresses, and well all over girly clothing, because it made me feel so awkward. I did wear prom dresses and dresses for musicals but I knew I was playing so it didn’t bug me, I was confused to why it was actually fun. Then again I was always confused haha. I recall past boyfriends being like you need to wear this or that and then getting upset when I didn’t. I was completely confused, lost, and always pissed off at the world. Because how could no one understand what I was talking about?\n\nIt would always go well your not transgender so you should be happy with your body, well your not a boy because you have boobs and a vagina, your attracted to dudes, or blah blah blah. I would always end up in tears and sometimes very drunk It was really unhealthy. I had some shitty relationships and at some point i was like well maybe this was all stemmed from that, because i had read somewhere that people, sometimes will want to change their gender so the feel less vulnerable and wont get hurt again. But I was like nah because Ive felt like this for years. \nI went to college hoping to figure it out wrong, found my love for food though, and more hate and then depression. I had left a guy id been with for 3 years. Add that to all the other stuff and i was off in a bad way. It all came to a head when I stared playing around with make up and thinking well this is what society wants. I was miserable, all I knew is that I wasn’t a girl but i wasn’t a boy and no one believed me. I didn’t want to tell my parent because My brother had just came out of the closet and I didn’t want to over shadow him or make their lives even more confused.  Now looking back at it I wish I had try to join the LGBT club on campus, but I was also working 3 jobs so that may have been hard. However there is always more clubs to join. Fast forward a few years. I joined the military, best decision I have made so far. \n\nI was like will military manly it works, little did i know that it was going to be the changing point in my inner struggle. I was waiting to be sent to my duty station when a friend back home had sent me a video going ,i think you might like this. It was Ruby Roses transformation video. I watched it it put me in tears, i was like that’s it, I have no idea what its called but that’s it. So i looked up Ruby Rose and found out that she was non-binary. I just started reading articles, and books, because i had the time at the time. I was satisfied and felt really freed, it was the best birthday present I could have gotten that year. Only took 22 years for me to figure out what to call myself, and 2 years later I'm still making so many self-discoveries.\n\nNow its not been rainbows and unicorns, but Ive never felt better. I even found a partner who really care about me for me. He thinks I’m a bit odd sometimes but really doesn’t question it, in all fairness he’s a bit odd too haha. There are days when ill dress like a girl and days ill dress like a boy that hasn’t changed. Well dressing like a girl has but I really only do it when I feel comfortable with it. He has told me I don’t care what you do has long as I don’t have to wear a dress. Fair is fair. I have also discovered Ruplaus drag race and im in love! I want to be a DIVA like them haha\nI know I just rambled but I really hope this helps some one out oneday\n\n", "date": "2016-10-04 02:43:48", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/55rgbb/finally_understand_myself_or_am_starting_too/", "author": "veggiebunnie", "reference": 284}, {"title": "nonbinary eligibility for SRS?", "text": "Hello-\nI am just beginning my transition, MTF, but I plan to present as somewhat nonbinary. my question is if anybody on here has experience with surgery as a nonbinary person? I'm curious if the RLE qualifies if you continue to present a somewhat androgynous appearance. thanks!", "date": "2016-10-05 15:23:44", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/55zzz9/nonbinary_eligibility_for_srs/", "author": "almostoneofthegirls", "reference": 438}, {"title": "Do you think I could be nonbinary?", "text": "I'm 15 years old and born female.\n\nMy whole life, I've felt slightly uncomfortable with traditional \"girly\" things. I don't wear makeup, don't obsess over boys (I'm pansexual, by the way), and wear exclusively t-shirts and jeans. Basically, I'm what most people consider a tomboy.\n\nBut lately, I've started to realize that I hate being female and having a female body. Even though I have small breasts, I feel like I shouldn't have them at all. I don't want them. And having periods and a vagina just feels... wrong somehow. Like I shouldn't have them either. I'm also terrified of (and somewhat repulsed by) the idea that I might become pregnant someday. I know that pregnancy and childbirth are amazing things that allow humans to survive, but to me they're... disgusting almost? I don't know the word. I just never want either of those things to happen to me. I just... don't want to be female. It just feels wrong.\n\nAt the same time, though, I don't know how I would feel if I were to wake up in a male body tomorrow. I guess wouldn't be much better. I really don't know.\n\nMentally, I guess I would say I'm pretty androgynous. My brain seems like kind of a cross between the archetypal masculine and feminine personalities.\n\nIn short, I don't know what's going on with me. Maybe I just hate being female (both in physical ways and in society's perception of women). I'm not sure.\n\nThanks to anyone who read this, I know it was long. I also hope I didn't say anything offensive by accident-- if I did, I promise it wasn't on purpose.\n\nIf you have any advice, I'd really appreciate it. There isn't really anyone I trust enough to talk to face to face.", "date": "2016-10-06 19:00:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/56725z/do_you_think_i_could_be_nonbinary/", "author": "bloodredhorse", "reference": 543}, {"title": "Some questions I have to non binary individuals", "text": "1: How should I refer to you? Do I call you he, she or it? Or something completely different? I don't want to be disrespectful.\n\n\n2: If someone calls you he or she even though you don't want that, but the other person didn't know that you are non binary, do you get mad at them? Do you correct them? Or do you just not care?\n\n\n3: What type of gender as a partner do non binary individuals prefer?\n\n\nThanks in advance!", "date": "2016-10-06 20:47:28", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/567n8p/some_questions_i_have_to_non_binary_individuals/", "author": "TE4LL", "reference": 554}, {"title": "Can I have no pronouns please?", "text": "I *know* I'm uncomfortable with my assigned pronouns, and I'm quite sure I don't like the \"opposite\" pronouns. A grand total of two people I know in real life know that I'm nonbinary: they used \"they/them\" pronouns for me. But...maybe I could get used to it, but they don't feel quite right either.\n\nMostly, I wish I could do away with those pronouns and just use my name / the first letter of my name. *Personally, to myself*, I don't use pronouns like he/she/they to refer to myself. When I write things about me, I use my name, no pronouns (and I'm conscious of wording things so that it flows okay).\n\nSo my questions/thoughts are: will I get used to they/them? Should I try out some other nonbinary pronouns? Am I breaking some law of English by doing away with singular third person pronouns?", "date": "2016-10-07 08:04:53", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/56abu7/can_i_have_no_pronouns_please/", "author": "ilikethewordelephant", "reference": 602}, {"title": "Awk situation", "text": "So I'm volunteering with a bunch of 4-5th graders tommorow I'm a college going 18 yr old. Would it be in appropriate if  I introduced myself  by name and said my gender pronouns? ", "date": "2016-10-08 02:15:57", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/56ezjz/awk_situation/", "author": "deeeeeeeerrreeee", "reference": 685}, {"title": "What name do you go by and how did you pick it?", "text": "I've been thinking. I don't like \"sarah\", but my last name is too long to remember, although I do like when people use it, and both my middle names are feminine. \n\nSo give me some inspiration. \n\nAlso tell me if you think Saris sounds too feminine. It's what I go by when I need to be differentiated from other Sarahs but idk if I like it.\n\n\n\n", "date": "2016-10-09 23:38:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/56oz99/what_name_do_you_go_by_and_how_did_you_pick_it/", "author": "pogtheawesome", "reference": 841}, {"title": "Did anybody shift to nonbinary after a significant time identifying as binary (insert gender here)?", "text": "I'm curious, as I've definitely shifted to a more non-binary identity from binary female. It's interesting that it's happened nearly a decade after working out that I'm trans. \n\nI almost think that it's because at the time I worked out that I was trans, our only resources were Laura's Playground and Susan's Place, which really catered only to trans women and had little to no visibility for non-binary folks. Hell, I didn't even know that non-binary people existed until yeeears after working it all out.\n\nSo yeah, anyone else notice that they shifted to a nonbinary identity after identifying as binary for a while?", "date": "2016-10-10 06:44:46", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/56qrdb/did_anybody_shift_to_nonbinary_after_a/", "author": "[deleted]", "reference": 874}, {"title": "AMAB - Binding?", "text": "So yeah, I'm AMAB, NB, have been on HRT for about 6 months and thanks to a naughty extra chromosome I've got a reasonably significant chest region. Due to various reasons I'm not super keen on it, and most of the time I layer to downplay it. We're getting into summer soon and my normal wardrobe isn't really appropriate (as it'll probably cause heat-stroke, even more so than a binder). I'd also like to start wearing t-shirts and stuff again, and I feel self conscious when I'm not layering.\n\nSo, do any AMAB nonbinary people bind? If so, are there any differences when working out sizing or anything? I should stress that **I do not care about the breast tissue, and am aware that binding is not good for it.**  ", "date": "2016-10-11 08:12:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/56x12e/amab_binding/", "author": "throwaway114A", "reference": 999}, {"title": "HELP partner has dysphoria, what can help?", "text": "My partner (afab) is getting their ass kicked by dysphoria, but we have no idea what will ease it. I suggested them borrowing my chest binder (I'm ftm) but they said it would still be wrong. how can I help them, what strategies do you know to help? I have no idea what to do to make it better.", "date": "2016-10-12 01:15:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/571l2b/help_partner_has_dysphoria_what_can_help/", "author": "aviantaco", "reference": 1078}, {"title": "What is gender?", "text": "[deleted]", "date": "2016-10-12 15:25:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/574mr3/what_is_gender/", "author": "[deleted]", "reference": 1137}, {"title": "Can I be both female and male aligned? Is that offensive?", "text": "I consider myself bigender. I've never felt quite comfortable in my assigned gender (afab). Physical dysphoria has pretty much run my entire life and I am currently transitioning by taking testosterone. However, socially, I still identify with womanhood because that is what I've experienced my whole life, and I don't regret it despite the dysphoria. I don't think I was a \"boy my whole life.\" I think I was a girl growing up, and one day I was like \"ok, enough of that, time to transition.\" But really, I don't care what pronouns my friends use because I feel like they understand who I am. I only care that strangers call me he/him because 1) safety 2) people generally don't understand nonbinary identities/care to understand the complexity of my gender 3) because my physical dysphoria is still so prevalent, I would rather be perceived as \"male\" because that means my body and face are changing. I assume as time goes on and I feel physically more comfortable I will not care so much.\n\nFor example, at work the other day I got deadnamed and \"she'd\" in front of everyone I was working with. I was so embarrassed I had a panic attack. This is because I was already feeling so awful about my body that morning and also because I didn't want my coworkers to think I'm a girl. I'm not. My identity is so much more complex than that, and I feel \"trans boy\" while not entirely accurate captures it much better than \"cis girl\". It still captures my experiences growing up as a girl and transitioning to a male body. Besides, I am hesitant to tell strangers I am bigender because I feel they will just see me as a \"weak man\" in this society filled with toxic masculinity.\n\nIs it possible to be physically male aligned but emotionally woman aligned? Is this offensive because once I start passing I will experience male privilege? I feel very bigender and not at all binary. If I was comfortable in my body as a girl I have no doubt I would have just stayed a cis girl because I loved the camaraderie and also being sapphic. However, that just wasn't possible for me. I still feel way more comfortable around girls and still consider my attraction to girls \"gay\" despite my medical transition. I don't feel I experience \"hetero\" attraction at all, mostly because my gender identity is inherently queer. \n\nHas anyone experienced something similar or could offer some advice?", "date": "2016-10-13 15:45:24", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57ax6f/can_i_be_both_female_and_male_aligned_is_that/", "author": "b0x0fawes0me", "reference": 1232}, {"title": "How do I explain to my therapist?", "text": "I've got a bunch of mental health issues that I'm seeing a therapist for. I keep wanting to talk to her about gender stuff but I am terrified that she just won't get the concept of being nonbinary.\n\nShe's LGBT-friendly, and I've talked to her about trans issues with her before and she was very respectful about it. But like... I'm just not sure if I feel safe explaining nonbinary-ness, or my own gender issues, to her. I feel like she's going to be skeptical or ask a lot of questions. I don't know what to do.\n\nIf anyone's got advice for explaining this to a therapist, I'd appreciate it.", "date": "2016-10-13 16:58:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57bbhg/how_do_i_explain_to_my_therapist/", "author": "joeysnowleopard", "reference": 1241}, {"title": "Genderfluid, but not quite", "text": "So, I'm gonna start off by saying gender is very confusing to me, and has been for years, before I realized I wasn't cisgender. A couple years back, I started identifying as genderfluid, with dysphoria swinging between days of identifying as male, days of female, and days of somewhere in between or off the spectrum entirely. It's settled itself out a fair bit since I got to college last year, and I started identifying fully as an FtM trans man.\n\nBut the thing is, my dysphoria still swings every now and then, not nearly as frequently as it used to, but still enough to trouble me. I mainly shift between being a binary trans man, bigender and agender. Logically, I could see this as genderfluidity, but part of me feels dysphoric about identifying as genderfluid even in agender or bigender swings, because I feel constantly wrong and uncomfortable if I don't have a consistent label that includes some variation of male/man/boy/etc. One term that has stuck with me is demiboy/demimale. It feels quite right, but I'm just wondering if there's any better, more accurate terms to describe a gender that is fluctuating but still male-aligned like this.", "date": "2016-10-14 04:10:47", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57el9j/genderfluid_but_not_quite/", "author": "mechanicalMelancholy", "reference": 1298}, {"title": "Anyone struggle with socialising with binary trans people of their assigned gender?", "text": "[deleted]", "date": "2016-10-14 07:41:33", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57f8zz/anyone_struggle_with_socialising_with_binary/", "author": "[deleted]", "reference": 1307}, {"title": "Questioning", "text": "I realize that this question is probably pretty dumb, but please bare with me. I've recently been questioning my gender and I think I'm somewhere on the non-binary spectrum. The problem is I still live with my parents who are rather transphobic. I want to start expressing myself though. I prefer my appearance a bit more androgynous, but I know my parents will not approve. I'm just curious though, does anybody else do this? Does anyone have tips? Helpful guides? I don't want to come out to anyone until I'm dead certain but I want to start expressing myself.", "date": "2016-10-14 13:11:22", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57g9mr/questioning/", "author": "Reon98", "reference": 1318}, {"title": "Nonbinary Gender Identity Survey", "text": "", "date": "2016-10-14 15:26:02", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57gwkx/nonbinary_gender_identity_survey/", "author": "ponte-vanima", "reference": 1321}, {"title": "Is there a test I can take to discover my gender identity?", "text": "Is it possible for me to just decide my own gender identity even if I am the first of my gender?", "date": "2016-10-14 16:01:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57h3ao/is_there_a_test_i_can_take_to_discover_my_gender/", "author": "itsnotaboututerus", "reference": 1323}, {"title": "The venture capitalist who is both a man and a woman", "text": "", "date": "2016-10-14 17:02:22", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57hf4r/the_venture_capitalist_who_is_both_a_man_and_a/", "author": "earthkestrel", "reference": 1326}, {"title": "Name?", "text": "So, I've recently been experimenting with the idea that I might be gender fluid. Obviously I'm not certain yet and I'm not sure if I ever will be. However, I've lately been thinking on how the name thing would work.\n\nOn the one hand, if I'm gender fluid, I don't need to really change my name. I go by a nickname as is and, generally, it's not the most male name in the world (although it is associated with men). Leaving my name as is would allow me to exist in relative safety in a transphobic household/family- a thing I've been cursed with. This becomes especially crucial the more I'm at home.\n\nBut here's the thing: I've been fascinated with the idea of taking a new name.\n\nEven before I thought it might be that I'm genderfluid, it fascinated me. I'm a Thespian by trade so I often find myself responding to names of old characters. I'm not extremely attached to my legal name right now. I think it would be nice to have a name I gave myself. A sort of new start if you will. Or even just a sort of stage name to keep relative anonymity in public (not that I'm famous or expect to be, but hey).\n\nI've been messing with the idea of calling myself Lawrence and not particularly caring about pronouns. I honestly couldn't care less how I'm called pronoun wise- especially since I'm starting to actively seek more effeminate features (painting nails, growing hair out, etc.) \n\nI'm wondering how some people on here went about the name thing? Did you change it, what did you change it to? If you didn't, why didn't you? Are there groups of people with whom you go by your new name and others with whom you do not? Tell me about it please, I'm looking for others' experiences.", "date": "2016-10-15 18:42:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57nfp4/name/", "author": "Reon98", "reference": 1420}, {"title": "What does Sis mean?", "text": "Hello everyone, so I'm a young male (still studying) and a lot of people around my area say sis(i think that's how you spell it) and I was just wondering what it means? People scream it at me and I don't know if it's meant to offend me or something... Thanks in advanced :) have a nice day. ", "date": "2016-10-17 13:33:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/57xbxq/what_does_sis_mean/", "author": "WhosNaka", "reference": 1603}, {"title": "Non-Binary / Trans focused Fantasy Novel on Kickstarter", "text": "", "date": "2016-10-18 10:02:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/582zml/nonbinary_trans_focused_fantasy_novel_on/", "author": "Catsohori", "reference": 1681}, {"title": "How are a non binary body supposed to look like?", "text": "I have heard that many trans women wants a female body and trans men wants a male body. But I've always wondered which body non-binaries (E.g. genderfluid, agender, demi etc.) wants. ", "date": "2016-10-19 17:18:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/58bhlv/how_are_a_non_binary_body_supposed_to_look_like/", "author": "snorken123", "reference": 1810}, {"title": "I got bored &amp; doodled a Nonbinary/Genderqueer flag-patterned pumpkin &lt;3", "text": "", "date": "2016-10-22 22:05:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/58vhz4/i_got_bored_doodled_a_nonbinarygenderqueer/", "author": "Cazonichi", "reference": 2094}, {"title": "For those pursuing/on HRT (T or E), what're your goals/what do you want out of it?", "text": "I'm just curious, as for non-binary people this can obviously differ from our binary friends. Also interested if there's anything that you'll likely get from hrt that you don't want/aren't interested in.\n\nThings I'd like:\nPretty much all the things expected from E.\n\nWhat I don't want:\nChest-area development.", "date": "2016-10-24 06:51:58", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5937ao/for_those_pursuingon_hrt_t_or_e_whatre_your/", "author": "[deleted]", "reference": 2200}, {"title": "Why do people hate us so much?", "text": "I  just can't wrap my head around it. Why do people act so toxic towards us? Is it because of the pronouns? The oddness of it  all? I just don't get it. I try to close the hate out but it always just adds onto the dysphoria like nails to a bat. Can somebody tell me why people hate us so much??", "date": "2016-10-25 10:51:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/59ae22/why_do_people_hate_us_so_much/", "author": "Everythingsucksugh", "reference": 2324}, {"title": "What if I'm ok with being gendered female most of the time?", "text": "I'd been sort of agonizing for months about what my identity is, what pronouns to use and what name to choose, but now I've just kind of dropped all that for the most part and just live. It still feels nice to be gendered \"wrong\", and it happens enough! But I just let people assume I'm a girl, and it's led to me thinking that maybe that's all I am. But what I really feel inside is that while I feel some connection to femaleness having lived in a female body my whole life, essentially I have no gender. I just am. And so I go with whatever people call me. \n\nDoes that sound like a cop out? Like I'm just a cis girl wanting to be part of the trans community? I feel a deep tug on my heart when it comes to transgender topics. But I have questioned my gender since I knew what trans meant. wondering if I was trans but thinking \"na, I'm happy enough being a girl, even if I don't feel fully attached to it\"\n\nWell, now I'm stirring up some complex feelings about it again. Ahahah. Sorry for the rant, but I'd love anyone else's take on my situation...", "date": "2016-10-26 05:13:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/59fuuk/what_if_im_ok_with_being_gendered_female_most_of/", "author": "roastytoastykitty", "reference": 2406}, {"title": "I identify as female but I don't like my voice.", "text": "I don't care if I pass as female so maybe this post is a moot point, but I wish I had a bit of a deeper, huskier voice. My voice is pretty high, it makes me sound younger and I hate it, I feel annoyed when I hear my voice. It's like I have this annoying whine to it. I'm doing my best to change it by doing humming exercises very recently but I don't feel a change yet I don't want to go on T because I don't feel that strongly about this, I've just been looking up exercises on how to change your voice/deepen your voice/make your voice deeper pre-T.\n\nDoes anyone else feel this way? Does anyone have any tips? ", "date": "2016-10-26 13:15:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/59hfwk/i_identify_as_female_but_i_dont_like_my_voice/", "author": "Blondintino", "reference": 2425}, {"title": "I'm stuck. :P", "text": "[deleted]", "date": "2016-10-27 05:29:54", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/59me56/im_stuck_p/", "author": "[deleted]", "reference": 2500}, {"title": "Androgyny is population control.", "text": "In my opinion the movement is leading a lot of people to sterility which is profoundly harmful to the human race. People are afraid that children are being exposed to androgyny and are being brainwashed into thinking it's normal and natural when it is not.\n\nBasically a lot of people are concerned that this politicised movement is being used as a means of population control. I personally am indifferent to each of you on a personal level but I see that the movement was a radical fringe and is now being thrust into centre stage by globalists.\n\nEDIT: Please don't downvote my post. If you downvote you're afraid of having your views challenged. ", "date": "2016-10-30 13:44:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5a621u/androgyny_is_population_control/", "author": "[deleted]", "reference": 2751}, {"title": "Answers to Questions about Trans People - great resource for educating people when coming out (x-post from r/transgender)", "text": "", "date": "2016-10-31 20:38:23", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5aeti5/answers_to_questions_about_trans_people_great/", "author": "BobartTheCreator2", "reference": 2872}, {"title": "Trans or Nonbinary?", "text": "hey y'all-- i've been thinking a lot about my gender identity lately, and am not sure whether to identify as trans or nonbinary. to some extent, i know that labels are not as important as understanding one's experience, but i'm curious to get some outside perspective and hear if others can relate to my experience.\n\ni spent my whole childhood obsessively thinking about how i wanted to be a girl, not a boy. when i reached adolescence it turned out i was attracted to girls; my focus shifted to attracting women more than wanting to be one. \n\nmore recently i unearthed the childhood experience i'd more or less repressed, and i've been reexamining my gender identity with a lot of curiosity and openness. what i've discovered is that my experience with gender fluctuates though trends far more to the female side of the spectrum. i'd say that if gender were a scale from 1 (female) to 10 (male), most of my time is spent between the 2-5 range, with periodic experiences on the male side between 6-8.\n\nas i write this, it seems obvious that i'm nonbinary, but something about the trans marker often feels more appropriate, as i do feel pretty female, at least a lot of the time, and have since a pretty young age.\n\nalright. i'll cut myself off there, but would love to hear y'all's perspectives. thanks in advance for the support and solidarity!", "date": "2016-10-31 23:04:47", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5afog4/trans_or_nonbinary/", "author": "tarynhm", "reference": 2891}, {"title": "Trans, Trans*, and Gender Fluid", "text": "Hey there\n\nHoping someone can give me a little more insight into this topic. \n\nHow do Trans and Trans* differ? \n\nDefinition of Trans* ?\n\nI identify as gender fluid (I think), is it inappropriate for me to identify with the Trans flag? (Blue pink and white) \n\nDifference between gender fluid and gender queer? \n\nThank you all ", "date": "2016-11-01 01:33:02", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5agg6g/trans_trans_and_gender_fluid/", "author": "dallasthequeerone", "reference": 2}, {"title": "Canada, eh?", "text": "I was wondering if there were any Canadian nonbinary folks here and what their experience has been in terms of coming out, receiving mental health and/or medical aid, hormone therapy, pursuing surgeries, and any other experiences related to being and coming out as nonbinary in the great white north? ", "date": "2016-11-01 02:45:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5agt1t/canada_eh/", "author": "mxspacehuman", "reference": 10}, {"title": "Am I non-binary? Agender? Wth am I? (20F)", "text": "My instance on gender is this: my \"gender\" is irrelevant, in the sense I don't feel it is an important part of myself. My anatomy is female and I don't really care if people call me female (I've never cared), but it doesn't \"define\" me. I don't feel female, I don't feel male, I don't feel like \"anything\". My mind is simply my mind, not a gender, whatever it is. And I feel confused, because I've always assumed that most people felt like this, too. That they called themselves male or female, because their bodies are male or female.\n\nNow after reading some things, I'm genuinely impressed. This gender thing might explain why my mind is \"androgynous\"... I don't feel like I \"fit\" in around most women and men. I've never fully related to female friends at all. I never related to any stereotype (of both genders), and I overall feel more comfortable around people who are somewhat androgynous, \"neutral\", or people who at least don't represent extreme gender stereotypes. In fact, I'm bi, and I feel more attracted to the stereotypical 'feminine' qualities of a man (sensibility, creativity, patience), and the stereotypical 'masculine' qualities of a woman (rational, hard-thinking, independent etc). I don't like to use the words \"masculine\" and \"feminine\", though, as they only reinforce this binary mentality.\n\nIs this non-binary or gender neutral?", "date": "2016-11-02 19:11:02", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5arvis/am_i_nonbinary_agender_wth_am_i_20f/", "author": "Thelemite-", "reference": 203}, {"title": "A Genderless Clothing Store", "text": "[deleted]", "date": "2016-11-04 17:23:24", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5b4vz5/a_genderless_clothing_store/", "author": "[deleted]", "reference": 399}, {"title": "Discord for UK trans peeps", "text": "Come check us out! We're still quite empty and looking for new members!\n\nhttps://discord.gg/2CxaE8A", "date": "2016-11-05 05:50:21", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5b8l0h/discord_for_uk_trans_peeps/", "author": "[deleted]", "reference": 450}, {"title": "TMI Question re: Top Surgery (CW: Slight description of the surgery)", "text": "Hey gang! I might be interested in top surgery in the long term (not sure yet) but the main thing scaring me is that all the top surgeries I've seen so far require one to have one's nips removed and sewn back on in the 'correct' location.\nIs this ALWAYS necessary, or if I lose enough weight/train upper body to make my chest as small as I can (currently a B), could I get around that? I really really don't want to put my nips through that. I've heard a bit about 'keyhole' surgery for smaller chests which gives me hope but I think I\"ve only seen nip-displacement ones for that too. \n\nSorry bout this, LOL &gt;&lt;", "date": "2016-11-10 20:17:32", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ca2nd/tmi_question_re_top_surgery_cw_slight_description/", "author": "Stitchfeather", "reference": 1007}, {"title": "Reddit bums me out so much sometimes", "text": "Was just browsing through askreddit (mistake number one) and came across a post asking people what they had against LGBTQ folks and got to witness so many people happily chatting about how much open hatred they have for any kind of NB folks after saying how cool they were with sexual minorities. Even some trans people were saying it. And like I know that's always been the case, but goddamn it hurts. It took me so long to finally understand myself and make peace and to watch people who don't understand shit all over my experience is just so sad. \n\nI'm not a fucking tumblr caricature. I'm a human being. What do I have to do to have my existence not be openly mocked by people who have no idea what I've been through?\n\nSorry for venting. Y'all are great. Gender normativity is a prison. Peace.", "date": "2016-11-11 03:37:43", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ccdvt/reddit_bums_me_out_so_much_sometimes/", "author": "notzak", "reference": 1052}, {"title": "Time Specific Fluidity?", "text": "So, for the past few months, I have been growing more and more certain that I am gender fluid or something similar. I've always exhibited traits and habits that, looking back on them, I think are indicative of this identity to me but only recently have I really had the capacity to find out. However, in thinking about this, I've noticed something that feels rather strange.\n\nI'm only really on the more feminine side of my personal gender spectrum around certain people. Like, when I'm with my girlfriend or people who know about my gender fluidity, I am much MUCH more inclined to identify as a woman or at least more feminine than I am. In contrast, around men, and, as I am AMAB, generally in public, I am much more inclined to identify as a man or a more masculine part of the spectrum.\n\nDoes anyone else experience this sort of situational shift in fluidity? Is this strange?", "date": "2016-11-12 07:43:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5cjh9z/time_specific_fluidity/", "author": "Reon98", "reference": 1174}, {"title": "Resources?", "text": "I have been questioning my gender for awhile and think that I'm genderfluid. I see a lot of resources for binary trans people but I rarely see anything for nonbinary. Not that I mind utilizing resources for binary, but are there any non-binary ones you can refer me to?", "date": "2016-11-15 03:33:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5d0eu7/resources/", "author": "Reon98", "reference": 1445}, {"title": "Hormone fueled relationship roller coaster", "text": "Hi there. Fit, athletic(ish), non-binary on HRT, trying to keep my appearance male but with aspects of female. A foot in both camps, so to speak. \n\nWhy am I here? Well, I'm hoping that someone can offer some practical and emotional advice regarding my relationship, which has been going amazingly well up till now -- we've hit a rocky shore.\n\nMy relationship with cis female has been awesomely amazing, we are really close. However, while I thought I was heading towards full transition, we both knew that the relationship would end, because that's not what she wanted. \n\nBut, lo! After a lifetime of being in the closet, then 5-years of agonising over my identity, I discovered that I did not want to transition fully and finally felt really good about myself. Yay me! \n\nAnyway, my discovery was eventually revealed to my partner in a long heartfelt discussion, the both of us breathing sighs of relief that our relationship was intact. As it turned out, some level of transition is fine. \n\nFast forward another couple of months and I get the chilling, emotion-laden \"We need to talk\". I was told that I have continued to develop physical, emotional and behavioural changes to a more female level, which, for my partner, crossed the line. Personally, I don't think the changes have been huge, so that's a little scary for me, because if it's that fine a line I'm not sure I can contain my development within such a narrow window. Then again, it's probable that both of our observational perspectives are skewed: she seeing more changes based on her knowledge of my being on HRT (I'm yet to be clocked as anything other than male), while I am likely a little oblivious to day-to-day changes and not seeing overall continued development. \n\nThe upshot of these developments is that my partner has lost some sexual attraction to me, where she says that it's not the same as before, though we are still very physical in more emotional ways. This recent development is not the end, according to my partner, as we both believe our relationship to be very special and worth working on. To be honest, I was happy with my physical development when we had our first talk about this, so any additional changes are kind of arbitrary to me and am not at all against rolling back some of my meds (but how do I regulate this to keep, more or less, an equilibrium?)\n\nHowever, I do have some doubts as to whether someone who has lost sexual attraction based on transition changes can ever get that attraction back. There's also the emotional toll on me being told that my partner has lost their sexual attraction to me, which I think is quite significant and makes me feel insecure in the relationship.\n\nSo, questions. \n\n1. What do people think of this situation generally (please ask for more info or clarification in needed)?\n\n2. As I said, I'd like to roll back a bit of my development and try and keep as steady a physical state as is possible (is it possible?). How do people here, in your experience, maintain HRT so as not to:\n\n(a) let testosterone levels creep back up too much or at all, as I barely have any;\n\n(b) maintain libido (as a drop in estrogen adversely affects mine) and;\n\n(c) keep the secondary characteristics (breasts) in check (I like them smallish, but fighting good breast genetics on both sides)?\n\nAny help from you peeps would be absolutely awesome!\n\nThanks in advance :)\n\nOh, and for what it's worth (as YMMV), my HRT currently consists of: \n\n* 150 Spironolactone (daily)\n\n* 1/4 tab of Cypro (daily)\n\n* 75 Estradot patch\n\n\n\n", "date": "2016-11-16 01:16:29", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5d6exz/hormone_fueled_relationship_roller_coaster/", "author": "AlexLooped", "reference": 1542}, {"title": "Question about hormones and another question about appearance", "text": "Basically, what I am wondering is this--is there any way for a non-binary person/genderqueer person/eunuch/et cetera to simultaneously use both estrogen HRT and testosterone HRT simultaneously?\n\nIndeed, please pardon my own *extremely massive* ignorance in regards to this, but could it be possible to, say, inject one's brain with testosterone HRT while putting estrogen HRT into one's body/blood? For the record, I have previously read about the blood-brain barrier and I am wondering if this could be relevant in regards to this. (Yes, I know, I am *extremely* uninformed in regards to this specific part.)\n\nAlso, off-topic, but here is another question for you: Would I still be able to pass as a male if I were to get forehead feminization surgery to make my own forehead look similar to Sally Kohn's forehead? :\n\nhttp://usherald.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-22-at-12.12.50-PM.jpg\n\nCompletely serious questions, for the record. Indeed, I myself am certainly unorthodox and unconventional in regards to my own various desires and tastes.\n\nAnyway, any thoughts on this? :)", "date": "2016-11-16 18:23:53", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5das1z/question_about_hormones_and_another_question/", "author": "Futurist110", "reference": 1619}, {"title": "Oregon court rules that 'nonbinary' is a legal gender", "text": "[deleted]", "date": "2016-11-16 22:43:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dc9s7/oregon_court_rules_that_nonbinary_is_a_legal/", "author": "[deleted]", "reference": 1648}, {"title": "British prisons must now recognise gender fluid and non-binary inmates", "text": "", "date": "2016-11-18 00:17:37", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dje4a/british_prisons_must_now_recognise_gender_fluid/", "author": "cassolotl", "reference": 1751}, {"title": "Nonbinary, gender fluid... I took the plunge (hrt- Testosterone) My experience so far. (x-post /r/genderqueer)", "text": "So, I'm born female, struggled with my gender and sexual identity all my life until recently.\n\nWhen I began dating the girl who I now know is my true love, she was so open and honest about her own experience with transition that it wasn't long before I tearfully admitted to her that I've always felt like my birth body didn't match up with how I wanted to be seen.\n\nFor a long time, I struggled with that big secret (\"I want to be a boy\"), and then- it was out. And then I realized, I had never considered what kind of boy I wanted to be, so in the safety of a few trusted friends and with my partner, I began to explore and give a voice to those long repressed feelings and desires. I began to read about non-binary trans identities and experiences, and to express myself in a way that was much more fluid and queer. I realized I always wanted to be someone whose identity was fluid, because cramming myself in a box on either side of the spectrum proved to be miserable in every way. I wanted to be androgynous. I wanted to move the slider over, so that no matter where on the spectrum I woke up, I could feel comfortable.\n\nFinally, just last week, after months of consulting with my doctor, doing the bloodwork, and so on, he asked me if I would like to start my HRT that day. I balled up my fists and said... Yes. Why not? Let's do it. I only have one life to live, I want to start a low dose of T, and keep doing what was working so well for me- taking it a day at a time. Listening to myself. Seeking the support of community. And never trying to fit into a box again.\n\nSo far... well- psychologically the effects have been mindblowing. This last year, I've made great strides in taking care of my mental health for once, having never really done so. I stopped drinking. I'm far from better, but now I'm in a place where I don't feel like every step is a landmine. And within a day of that first injection... I felt so at peace. So unified. So calm.\n\nThe best way I've been able to describe it is this: I've always thought of this dysphoria and this deep hurt and feeling of not belonging as having two people trapped in the same body, one of which who never really got a chance to thrive. Think teenage angst times 11. But finally, I threw my boy side a bone. I acknowledged that he exists and that he's felt trapped and upset. But now he feels validated, he's stopped throwing temper tantrums. He's even admitted that he's not particularly interested in the culture of masculinity, he just wanted to be heard. I know it sounds silly.\n\nBut suddenly I feel so much more comfortable in my skin, long before any physical changes have happened. My partner said her psychological relief was almost instant when she began HRT as well, long before she experienced the physical changes. Now I understand it.\n\nCurrently, I am taking the HRT day by day. My plan is to continue with the half dose and just keep feeling it out. Do I want to fully transition? Do I want to continue on a low dose until I feel androgynous enough to stop? I'm not sure. I've already broken most of the \"rules\" and I've never felt more like my life was actually worth living, so I'll just keep living it, day by day.\n\nI love you all and I just wanted to share- this community, among others here, helped me out more than I could ever say. If I hadn't secretly browsed /r/lgbt 4 years ago and wandered my way over to /r/genderqueer, I probably would have spent another decade drinking to blackout several times a week, resenting my cis partner and myself, cutting my skin and thinking about suicide constantly. That was me, a year ago. Now I am engaged in the gayest, queerest, genderless lesbian husband/wife relationship with the best friend I've ever had.\n\nI won't pretend things aren't hard right now, but I think these are the times that the positive must shine through for an example- I never would have been brave enough if it wasn't for all the beautiful, visible queers shining like stars and giving my repressed, miserable self some hope, something to strive for.\n\nThank you all.\n", "date": "2016-11-18 01:02:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5djm95/nonbinary_gender_fluid_i_took_the_plunge_hrt/", "author": "SunOnTheInside", "reference": 1755}, {"title": "Worried about being able to get HRT", "text": "I'm agender, dfab, and wanting hormone replacement therapy.  I've been thinking about it for a couple years now.  But I've heard a few stories about nonbinary people not being able to get HRT; therapists telling people that they can't if they don't identify as strictly FtM or MtF because they'd be \"stealing resources from real trans people\" and stuff like that.  I guess I'm mostly asking if anyone has had any bad experience with doctors/therapists regarding HRT for being nonbinary.", "date": "2016-11-18 03:48:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dkdr9/worried_about_being_able_to_get_hrt/", "author": "ErenVLjunggren", "reference": 1765}, {"title": "HRT (Testosterone)", "text": "Things are starting to progress in my transition. I've done a lot of research on testosterone, like the effects, approximately how long said effects take, etc., but now I'm stuck as to what to do to actually get testosterone.\n\nSo\n\nWhere did you get T? \nWho did you have to be diagnosed by?\nHow long did it take to start?\nInsurance??????? UHHHH \nCost?\nWhere did you go? \n\nAnd just any other knowledge about starting is very much appreciated! Thank you for the help", "date": "2016-11-18 14:17:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dmlwn/hrt_testosterone/", "author": "pathhhh", "reference": 1790}, {"title": "Nonbinary and issues with lesbian partner projecting toxic masculinity", "text": "Ok, guys. I'm desperate here and having ideations for about 4 months now. Lowest I've ever been. I am nonbinary. I have had successful relationships since high school with women. I was practically engaged just recently and we broke up because we had intimacy problems. This is the first time I have had experience with this and I'm not sure if its because I usually dated more conscious and active mates or if I have just come to a cross roads internally.  Here it goes:\n\nShe has always been gay. She is femme. She still had a bit of a princess complex which didn't help, but she constantly made me feel not masculine enough no matter how many times I would resist and say hey I am a woman too or I am very much both and enjoy being this way. She knew me when she met me, but again probably more projection during the honeymoon phase. In the late beginning we hit an issue when she told me she would like me to be even more aggressive and to hit her and choke her during sex, and for me with a history of physical and sexual abuse that was not a turn on and in fact was triggering in the moment. I had had experience giving it a try with another failed relationship, and knew myself this time. sigh. I told her that as a therapist, I can't ignore the fact that we are lacking true intimacy before I consider jumping to emotionless extremes. I already am an aggressive partner so this was confusing. I was open to her about this and we moved on but not without her constantly digging at me or cutting me down for not being a machismo fuckboi or some faux-confident gangster twat. Literally, what it felt like. She wanted me to be this unemotional object and would continue to cut down my nature, and eventually called me things like meek and soft, which I am aware that I am not. The oddest thing is I am fairly masculine and have always presented an even mix of both since childhood. I am in good shape and heck we were in love, so it was of course deeply upsetting after awhile. Eventually intimacy fell flat, I could tell her perception of me had changed. I wasn't sure if it was bc I refuse to be sadistic or its because of my abuse which I had to divulge. We talked about sex and it was a new reason each time. I have never had this intrapsychic struggle before, I've always been very comfortable letting my body be what it is. I constantly tried to initiate sex and all the different ways she requested or was expecting and she still overtly rejected me, one time she legit took her foot and pushed me away. I would leave every once in awhile for a night upset convinced she needed a different kind of partner, but she would beg and fit for me to come back. But she still tried absolutely nothing to make the situation easier or to get over the hurdle, as I tried. Zero effort, just ignored it and left me seriously confused about my self for awhile. We even went to therapy three times and the last session she came in and said she wanted someone who was more of an initiator! And yes, I was shocked and felt ambushed and responded by explaining how often I try to and she rejects me. The next day we ended it. \n\nIts been months and she handled it pathologically and told me that she wasn't getting wet and that I didn't tease her enough. She clearly does not know how to be vulnerable or intimate to even get to this stage. Maybe princesses live their lives constantly wet with a partner of 3 years, but I certainly didn't and told her this. \n\nI'm aware of her own issues here, that is not the response I'm looking for. What I am needing is some help. I feel obliterated and even asexual and not much like living. The most fucked up thing is that she dated someone who is now a FTM. I dont think its coincidental, but for me that is so against my fluid nature. Sad thing is if I was trans, I would probably take it even harder considering they truly want to present masculine... sadly sometimes toxically, which in this case they'd really not react well. I can't think of anyhting more psychologically abusive and narcissistic than to completely devastate someones sexuality. \n\nHas anyone had trouble in their relationships with their partners projecting faux-femininity or toxic masculinity on them? How did you survive times of deep and utter internal confusion and pain? How do you initiate as nonbinary and have you ever run into partners that got confused with your denial of roles? Have you evver had trouble with resistance, for instance when a partner wishes for you to be more of either gender, and you rebel by becoming even more of the opposite? Tell me there are people out there that can love our souls and not just wish for us to be their daddies.", "date": "2016-11-19 00:33:31", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dpwc1/nonbinary_and_issues_with_lesbian_partner/", "author": "AncientChiron", "reference": 1845}, {"title": "Estrogen Blockers", "text": "Has anyone had any experiences with estrogen blockers? I am taking them now, but its only been a week. I was told as a nonbinary  I would like the result better than full blown T.", "date": "2016-11-19 00:45:23", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dpyaw/estrogen_blockers/", "author": "AncientChiron", "reference": 1847}, {"title": "I took a photo of myself today that I actually really liked!", "text": "", "date": "2016-11-19 03:06:40", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dqjfh/i_took_a_photo_of_myself_today_that_i_actually/", "author": "forest__creature", "reference": 1857}, {"title": "I made a bingo out of the mean things we're told", "text": "", "date": "2016-11-19 04:03:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dqrae/i_made_a_bingo_out_of_the_mean_things_were_told/", "author": "Everythingsucksugh", "reference": 1863}, {"title": "What to expect in regards to permanent hair removal?", "text": "Here is my question--I am an aspiring eunuch who is also extremely strongly into both bodily feminization and facial feminization.\n\nBasically, after I will get my orchiectomy (which is non-negotiable due to the fact that I need it for sterilization purposes; after all, neither vasectomy failure nor saying \"I trusted her\" is an acceptable excuse to avoid paying child support for 18+ years afterwards), I certainly want to *permanently* get rid of as much of my body hair and facial hair as possible (as well as to get forehead-focused feminization surgery on my face) once I will become able to afford it (for the record, my planned orchiectomy is certainly my first priority).\n\nAnyway, my question here is this--considering that I myself am unfortunately *extremely* hairy right now everywhere on my body other than on my back, how exactly should I go about this? Also, please keep in mind that, while I have previously heard some good things about estrogen HRT (such as becoming more emotional), I am unsure that I will actually be able to sustain taking estrogen HRT on a long-term basis; thus, I might have to take testosterone HRT instead.\n\nIndeed, what exactly should I expect in regards to laser hair removal on my body and face? (Also, for the record, if the cost will be right, I am certainly open to using electrolysis for this purpose.) To elaborate on this, how long should I expect to wait after I begin laser hair removal on my body and face before I am able to *convincingly* cross-dress (specifically *convincingly* wear things such as short shorts, short skirts, bikinis, et cetera)?\n\nAnyway, any thoughts on all of this? :)", "date": "2016-11-20 16:18:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dypai/what_to_expect_in_regards_to_permanent_hair/", "author": "Futurist110", "reference": 1975}, {"title": "Gender neutral toilets app?", "text": "", "date": "2016-11-20 17:34:30", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5dz2fp/gender_neutral_toilets_app/", "author": "tai_chi098", "reference": 1985}, {"title": "From DC Comics Deadman", "text": "", "date": "2016-11-22 02:07:48", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5e85i9/from_dc_comics_deadman/", "author": "Bannedfromthenet", "reference": 2135}, {"title": "Do you ever wish people would stop drawing attention to your identity?", "text": "Just want to start with, don't get me wrong, I am very happy when my identity is acknowledged in some way, when people don't immediately assume that I am a particular gender just because of the way I look. What does get to me is little moments when people really want to draw attention to the fact that you're somehow not acting \"right\" if that makes sense.\n\nFor instance, I'm currently playing a male character on Pokemon Sun. I've been playing as a guy since Alpha Sapphire and honestly wish I could have changed my X character to a guy. I am AFAB, most people in my life met me as a \"woman\" and I don't really pass most days. Every time someone sees my character, whether over my shoulder or during a battle, they're all \"YOU'RE PLAYING A GUY FILUEFOIEUF\". Even the ones I've come out to. Like, yes, you see, being nonbinary sometimes means that I often like to represent myself as the gender other than the one you \"know\" me as. Surprise.\n\nA few times I've been involved in conversations about sexism and whatnot, and I occasionally say \"as someone who is seen as female\" or \"read as a woman\", and typically people who are barely involved in the conversation will chime in with \"LOL SEEN AS?\" It's really not relevant. Why draw attention to it? I've just started reverting back to saying \"as a woman\" but I really hate it. I guess it's not an entirely wrong statement but every time I say it I feel like I'm lying to myself or about myself. \n\nOf course there's the flip side of it where people will remind me how they read me as female with every little gesture I make. \"Oh, that way you breathed? I've always seen women breath that way\". A small exaggeration sure but it sums up so many interactions that feel like nails on chalkboard to me. It feels like I can't express liking something without someone popping up to tell me how that clarifies my \"femininity.\" There are also people, even people who have known me for a long time and should at least know I'm not especially interested in most \"feminine\" things, who still try to push the extreme, stereotypical sides of that identity on me. Literally, a few weeks ago I was masculine presenting and binding and feeling great about myself and a friend of mine gives me earrings and talks about how, as a girl, I should get my ears pierced by now. That hurt, and it still hurts now, and I know I shouldn't be dwelling on it and my friend meant well but that was some real bad timing. There's nothing wrong with femininity, I have a feminine side, but when it's all anyone ever sees of me and identifies me as it makes me wilt. \n\nIt's funny, there are lots of people out there who think people who identify like I do are looking for attention. I just kinda want to be left alone. Stop trying to analyze me. I can't stop people from putting me in a box, but I wish they'd stop telling me where they're putting me. How far do I have to masculinize myself before people learn to shut up? Why do I have to do that to myself before I'm allowed to be taken seriously? I don't want to go around biting everyone's heads off with my identity, I don't even want it to come up at all, but everyone seems really eager to talk about it. \n\nI'm sure I'm not alone in this. I like to comiserate.", "date": "2016-11-23 07:14:07", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5eg1av/do_you_ever_wish_people_would_stop_drawing/", "author": "throwawaydddsssaaa", "reference": 2267}, {"title": "US residents: do you have specific fears about a Trump administration?", "text": "Per the sub, I'm thinking of gender and body fears, but share anything you want, how you're coping, if you have specific plans, etc.", "date": "2016-11-23 21:41:30", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ejyfp/us_residents_do_you_have_specific_fears_about_a/", "author": "Ebomb1", "reference": 2318}, {"title": "In your honest opinion, would Alison Bechdel be able to pass as both male and female?", "text": "Here is a photo of her (she is on the left): http://www.huffenglish.com/wp-content/uploads/2015/11/IMG_2597.jpg\n\nBasically, the reason that I am asking this question is because I myself am trying to figure out the extent to which I want to feminize my own (MAAB) face in due time.\n\nAnyway, any thoughts on this?", "date": "2016-11-24 20:25:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5epq1y/in_your_honest_opinion_would_alison_bechdel_be/", "author": "Futurist110", "reference": 2393}, {"title": "Altering genitalia?", "text": "I'm 24, AFAB. Ever since I was about six years old I felt I should have been born a boy, but as I got older and more educated I realized I'm more comfortable identifying as nonbinary. \n\n\nThat being said, I do have some issues with my body. I'd really like to increase the size of my clitoris. I know it's unrealistic to expect it to become the size of a penis (though it would be nice), but I would like to at least have something *there*. I'd even settle for an inch or so of growth. I'm not sure if I want to go the HRT route since I do not want to change my voice or have any more body hair than I have already (also I'm uninsured and unemployed in the red state of Texas, so it's probably impossible anyway). \n\n\nI have been doing a lot of research and have read that pumping, over time, is supposed to increase the size, so I started pumping this month. I haven't seen any changes yet. I'm not sure if it's because it's a weak pump, or because I'm not wanting to go too hard too fast, or if it's just too soon.\n\n\nHas anyone had any experience with pumping for size?\n\nDoes anyone have any experience with nonbinary-friendly doctors in the Dallas area?\n\nAre there any other ways to increase the size?", "date": "2016-11-25 23:58:52", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ewmie/altering_genitalia/", "author": "shikuretto", "reference": 2472}, {"title": "Question about self-arousal", "text": "I apologize for posting *a lot* of questions here recently, but I myself am simply a person who is curious about a lot of things as well as about various people's views, opinions, and insights. :)\n\nThus, here goes:\n\nIn short, I myself generally identify as a male (though I am certainly also *extremely* willing to adopt a \"eunuch\" label after my (planned) orchiectomy) but also want to have a feminine (hairless) body as well as an androgynous (hairless) face. In addition to this, I also want to wear certain women's clothes on a semi-regular basis. :) Finally, I also want to get prosthetic testicles after my (planned) orchiectomy. (As for the HRT, I will use whatever HRT I am most comfortable with; however, as I have previously stated here, the orchiectomy is non-negotiable due to the current extreme child support laws.) Also, if this makes any difference, I myself get sexually aroused both my imaging myself having prosthetic testicles as well as by imagining myself having a vagina; of course, I certainly place *a lot* of value on things such as penis-in-vagina sex and thus certainly prefer to have a penis plus prosthetic testicles than to have a vagina.\n\nBasically, though, what I am wondering is this: What exactly does it mean when I get sexually aroused by imaging myself having my ideal body and face? Frankly, I feel that after I will sufficiently feminize both my body and my face, I would literally be able to get sexually aroused and to orgasm merely by looking at my own body--preferably with certain female clothes on myself! :)\n\nIndeed, are such feelings normal for transgender and gender non-conforming people? After all, I feel that I can get *almost* as much of an orgasmic experience and *almost* as much sexual joy from merely looking at my own body and face (*after* I will sufficiently feminize both it and my face, that is)--preferably with certain female clothes on myself--than I can get from things such as having penis-in-vagina sex. Heck, during my childhood, I first got *extremely* sexually aroused by the idea of wearing female clothes *way* before I first got *extremely* sexually aroused by the idea of having penis-in-vagina sex (indeed, the former occurred at age 9 or 10--shortly after I began hitting puberty--while the latter occurred shortly before my 16th birthday). Heck, even as late as high school, many--if not most--of my sexual fantasies involved me having a feminine body and face as well as wearing female clothes (as opposed to me having sex with women)! :)\n\nBasically, what I am trying to figure out is the *meaning* of these feelings of mine; indeed, while I certainly know what I want to do in regards to both my body and my face (as well as which female clothes to wear afterwards, of course), I also want to try figuring out the *meaning* of these feelings of mine. Indeed, does anyone here have any ideas as to why exactly I myself have such *extremely* strong feelings of auto-arousal (auto-sexual-arousal)?", "date": "2016-11-26 01:36:02", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ex20v/question_about_selfarousal/", "author": "Futurist110", "reference": 2478}, {"title": "Relationships and being non-binary", "text": "Hi there!\n\nSo, the current relationship I'm in is with a cis-het female who I LOVE dearly, as she does me. I worry, though, as the chemistry between us wanes the more my physical features transition to female. Not that I want to really develop any further (which she's fine with), but I've discovered that it's notoriously difficult to find a happy medium, a sweet spot, between genders that can be maintained. It would seem that the the longer I transition, even on relatively low doses, the more I will continue to change.\n\nSo, worst case scenario, my current relationship does not last, what then? I'm 99% certain that it would be my final cis-het relationship. But, after I pick up the shattered shards of yet another beautiful relationship gone south, where would I look for a partner open to a deep and meaningful relationship in the future. If I were to ever seek love again, where would I look for people who are interested in AMAB, non-binary, male presenting, estrogen taking peeps?\n\nAnybody here want to share their own experiences?", "date": "2016-11-26 05:39:56", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ey151/relationships_and_being_nonbinary/", "author": "AlexLooped", "reference": 2498}, {"title": "Went to go buy a TeeShirt I've been wanting, had a funny moment", "text": "", "date": "2016-11-27 10:23:30", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5f4q5h/went_to_go_buy_a_teeshirt_ive_been_wanting_had_a/", "author": "throwawaydddsssaaa", "reference": 2588}, {"title": "Coming Out", "text": "Should I let my teacher tell my parents I'm NonBinary? She's the only person I've told. I'm nervous to tell my parents myself, and to have my teacher do it for me.", "date": "2016-11-28 00:19:48", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5f8jhk/coming_out/", "author": "TeresaCake", "reference": 2635}, {"title": "How to achieve fame as a eunuch?", "text": "I was wondering how exactly I can achieve fame as a eunuch; to elaborate on this, how exactly should I try publicizing my orchiectomy (*after* I will actually get it done, that is)?\n\nBasically, I want to publicize my orchiectomy (which I certainly want to get for *personal* reasons) for several reasons:\n\n1. To protest the current child support laws and especially the extreme nature of these laws.\n\n2. To give other eunuchs the courage to come out (even though their reasons for their orchiectomies will almost certainly be different from my own reason for my orchiectomy).\n\n3. To provide more spotlight (and attention) on the eunuch community and to de-mystify orchiectomy a bit.\n\n4. To make it clear to people such as medical researchers that, with me, they have a(nother) potential participant in their studies on eunuchs.\n\nAnyway, any thoughts on this?\n\nAlso, Yes, I am *very* well-aware that this is an issue which should be handled *very* delicately in order to avoid giving people *very* wrong impressions (such as that trans-women are just people such as myself). :(", "date": "2016-11-28 22:36:36", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5fessq/how_to_achieve_fame_as_a_eunuch/", "author": "Futurist110", "reference": 2725}, {"title": "New to being non-binary", "text": "[removed]", "date": "2016-11-29 23:17:28", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5fm15e/new_to_being_nonbinary/", "author": "[deleted]", "reference": 2842}, {"title": "Do you think my mom knows I'm Agender?", "text": "I wrote it on a note, but I didn't think she saw it until she started questioning me like \"Those bows double as hair bows. You're a girl, you don't have to just wear them as bowties.\" and \"Do you have something to tell me?\" Or \"Why are you wearing a bowtie again?\" and I think she knows. What do you think?\n\nI think she's waiting for me to tell her face-to-face instead of on a stupid little piece of paper in the middle of the night.", "date": "2016-11-30 22:49:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5fssvl/do_you_think_my_mom_knows_im_agender/", "author": "TeresaCake", "reference": 2965}, {"title": "I hate my nasally voice and am looking to change it.", "text": "Does anyone have any tips? Does humming exercises work? I've been looking on Youtube and I am going to try to follow their advice.. I've looked up some other voice lesson youtubes, but the Pre-T ones seem to work best for me, for the most part. I do NOT want to go on hormones or anything like that, that's NOT what I'm looking for.\n\nSee, I'm nonbinary -- why I posted here, captain obvious -- but I do identify as female. Sometimes I feel a bit dysphoric and masculine.. really I'm still figuring all of that out. I do not want any advice on *this*, because, you know what? It's just gonna make me feel more dysphoric and freaked out and question myself, no offense.\n\nSo, anyways, the bottom line is, I hate my voice. It's not extremely nasally, but it's soft and I've been made fun of for how I sound. I did a few exercises and my voice is slightly nasally, and when I've recorded it, it sounds very nasally, much to my frustration. I'm just wondering if anyone had any input on the issue. Have anyone here changed their voice, what was that experience like?", "date": "2016-12-01 17:26:23", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5fxtwf/i_hate_my_nasally_voice_and_am_looking_to_change/", "author": "[deleted]", "reference": 110}, {"title": "Looking for advice with gender symbols in a product!", "text": "Hello!\n\nI am designing a product that involves asking for gender identity at one point in the setup process. This question is very important to the product, and we're only asking it because it will make what we're doing significantly more meaningful.\n\nIn previous projects, I've used three text-based options -- male, female, other ^see ^note (which prompts an optional \"specify\" field) -- but this time I'm looking to do something more graphical / visual.\n\nSo my question is about gender symbols, and which symbol(s) might be most appropriate when placed with the binary Mars and Venus symbols.\n\nObviously, presenting [all the options](https://neuwritesd.files.wordpress.com/2015/05/1420041082350.png) would be wonderful, but unfortunately there just won't be enough space and it would create a difficult-to-manage user interface.\n\nI love the *look* of this [transgender symbol](https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/A_TransGender-Symbol_Plain3.svg/2000px-A_TransGender-Symbol_Plain3.svg.png) and the [other gender symbol](https://upload.wikimedia.org/wikipedia/commons/0/0d/Gender-Symbol_Other_dark_transparent_Background.png), but I'm not well-versed enough to know what either are considered inclusive of.\n\nDo either of those symbols resonate with you in a positive or negative way? Is there another symbol I'm missing that you would think \"that's me\" if you saw it presented in a user interface?\n\nAny advice / thoughts would be so helpful! Thank you!\n\n*Note: I've never been a huge fan of the \"Other\" text label. I know there is sensitivity around the use of the word to describe non-binary gender identities. I've considered using \"Specify\" alone, but some people would rather not provide details, but would like to acknowledge that they are not male or female. So I go with \"Other\" at the moment...*", "date": "2016-12-04 17:26:14", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ggh5k/looking_for_advice_with_gender_symbols_in_a/", "author": "glitterlok", "reference": 611}, {"title": "Do you think your non-binary gender expression has a biological basis?", "text": "[deleted]", "date": "2016-12-04 22:15:39", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gi39y/do_you_think_your_nonbinary_gender_expression_has/", "author": "[deleted]", "reference": 642}, {"title": "Do you think your non-binary gender expression has a biological basis?", "text": "Hello!\n\nI am curious. Do you think you want to express as non-binary because you feel too strongly about it (as if your brain were \"transgender\") or do you think it's purely about feeling good and bending social rules?\n\nNote: I am binary, but I support your expression.", "date": "2016-12-04 22:28:00", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gi5q2/do_you_think_your_nonbinary_gender_expression_has/", "author": "sophietruffs", "reference": 643}, {"title": "Did any of you realise you were nonbinary after puberty?", "text": "I apologise for any inaccurate terms in advance; while I identify as nonbinary, I only know what I've experienced, and I'm not used to using words to express that.\n\nEssentially; I've heard that most people form their core gender identity at a very young age, and gender identity is pretty much solidified during puberty (aka if you're comfortable with your body as it undergoes puberty, your gender identity matches with your biological sex). \n\nOn the flip side, I've only started truly identifying as nonbinary around a year ago (I'm 19 atm). Having an androgynous gender expression certainly feels natural to me, and typical male expression makes me very uncomfortable, but until a year or two ago I was perfectly fine with it. I keep worrying whether this is \"just a phase\", since my gender identity changed far after the typical age in which it is supposed to solidify.", "date": "2016-12-05 21:42:05", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gopzg/did_any_of_you_realise_you_were_nonbinary_after/", "author": "iodark", "reference": 760}, {"title": "In the grand scheme of things, which surgery is worse?", "text": "Reddit User lodro has given me some information about the benefits of androgen receptor antagonists here:\n\nhttps://www.reddit.com/r/AskMen/comments/5f2jxj/if_purely_hypothetically_you_will_lose_your/das9bni/\n\nAlso, over the last several days, I was able to read more about salpingectomy and women's experiences with it.\n\nAnyway, my question here is this--in the grand scheme of things, which surgery is worse--a removal of the *entire* vas deferens *plus* a removal of the *entire* epididymis or an orchiectomy?\n\nBasically, I was thinking of trying to do the former surgery for the time being and then trying to figure out whether it is actually worth it for me to do the latter surgery. Also, for the record, a regular vasectomy certainly *wouldn't* be good enough for me given the ability of the vas deferens to regenerate! :(", "date": "2016-12-05 23:27:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gpca7/in_the_grand_scheme_of_things_which_surgery_is/", "author": "Futurist110", "reference": 772}, {"title": "T appointment", "text": "I have my first appointment to start T on Wednesday!!! I'm super excited. It should all be covered by insurance but I will have to see if at my appointment they tell me there are any hoops to jump through. \n\nAny advice??? ", "date": "2016-12-06 04:21:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gqujr/t_appointment/", "author": "dallasthequeerone", "reference": 799}, {"title": "anyone got more nonbinary memes?", "text": "", "date": "2016-12-06 19:06:27", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5guqnr/anyone_got_more_nonbinary_memes/", "author": "imtiredfam", "reference": 865}, {"title": "Heya! How do y'all feel about the term 'Enby'?", "text": "Sorry if this has been asked a bunch before, but I've been warming up to the term lately &amp; am interested in seeing people's views on it. I've heard that some see it as being a bit too cutesy and maybe hard to take seriously, but I generally like that kinda stuff so I've become fond of the word. \n\nAdditionally, do any of you have any nonbinary-specific terms (not just gender-neutral, so not 'person', for example) that you'd like to share?", "date": "2016-12-06 21:27:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gvm3q/heya_how_do_yall_feel_about_the_term_enby/", "author": "Cazonichi", "reference": 880}, {"title": "Hey Spotify, I see what you're doin'", "text": "", "date": "2016-12-06 23:18:20", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5gw9u4/hey_spotify_i_see_what_youre_doin/", "author": "trampolinesex", "reference": 897}, {"title": "Reactions to coming out from older members of the trans community", "text": "I am going through the process of coming out at the moment. 22yo for context.\n\nAfter telling my mum, she went away and talked to a trans friend of hers who transitioned a long time ago, who agreed with her that it's a momentous decision and that mum's job is to doubt on my behalf, that I should have to go to a gender Psych for a long time so that they can drill me on whether or not I am absolutely sure that I am trans, other burden of proof this that and the other.\n\nIs this a common response from those who transitioned in a harsher time, or is it isolated? It rattled me a bunch, but I'm good now. Just a little confused that it's coming from a member of the community.", "date": "2016-12-09 11:08:35", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hd7mo/reactions_to_coming_out_from_older_members_of_the/", "author": "halthefifth", "reference": 1249}, {"title": "I can't make myself look androgynous enough", "text": "I always try to make myself look androgynous, and I can succeed to the point (With the limited options I have, because I haven't come out to my parents yet and I'm not an adult) where I can see myself as genderless, but I still always look kind of feminine. This wouldn't be a problem if I didn't get bad dysphoria when I look too gendered.\n\nHelp?", "date": "2016-12-09 20:53:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hg8t9/i_cant_make_myself_look_androgynous_enough/", "author": "TeresaCake", "reference": 1297}, {"title": "I could use a little help if someone is around this early. :)", "text": "So I spent about 20 minutes aimlessly scrolling up and down on the homepage of the subreddit before finally deciding to switch to my alt account to post.\n\nI think I'm starting to make sense of feelings I have that I've never understood.\n\nI'm 21, and I typically identify as a guy. Sometimes however, I don't feel at peace with that label. (I think? I'm confused :/  ).\n\nIt's not a feeling of being a girl instead I'm certain of that. I guess the only way my confused mess of thoughts can explain it is that I feel more me-ish than boyish.\n\nI'm not sure what my goal was in posting this, I guess I just needed to get this out to someone because I've thought about it before a few times, but could never put a finger on it. But now it's kept me up all night, so I needed to talk about it.\n\nThanks for reading, wonderful people :)", "date": "2016-12-11 12:56:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hpy6a/i_could_use_a_little_help_if_someone_is_around/", "author": "SuperDell15", "reference": 1463}, {"title": "A Give Away!", "text": "For those of you that have Twitter and Instagram, I am trying to get my aspiring group some traction with a give away - it's called the Non Binary Network. One day I hope to make it into a charity, but for now I'm aiming for a community.\n\nThe Instagram account is @nonbinarynetwork\nThe twitter account is @NonBinaryNet\n\nI'm open to shipping world wide and if you win the give away, the prizes consist of art work from the co-founder, a piece from my shop and some things tailored for your gender identity. That can be binders, clothing, makeup, a donation for top surgery, anything you can think of. This ends on the 30th December!", "date": "2016-12-11 20:36:21", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hs88a/a_give_away/", "author": "opiixon", "reference": 1493}, {"title": "I'm an outsider, and I really really want to understand.", "text": "Okay, so I am a cis male (I don't want to call myself male, but I'll get to that later) in a relationship with a trans individual who originally identified closer to male, but now considers themselves to be more non-binary leaning.\n\nFrom what I understand, gender is not determined by genitalia. I think the trans community (and intersex people, too) counters the idea that genitalia = gender, regardless of whether or not they are binary. Additionally, it is not determined by gender roles. I can wear a dress, use hand gestures often, put on makeup, etc., and I can still be male or whatever gender I identify.\n\nNow, here is what I cannot understand for the life of me: If gender is not determined by either of these things, then what does determine it?\n\nIf I really think for a second, \"What makes me a male?\" I cannot answer this question. It hurts to try and ponder this for even a few seconds. If someone calls me male or uses he/him/his, it doesn't make me uncomfortable. If someone were to call me female or use she/her/hers, the only reasons I would question this would be because (a) I'm used to the binary pronouns I have been called, and (b) I would wonder what that person saw in me that led to them using those pronouns.\n\nIn the end, these labels don't work for me. I don't see them having much of a purpose other than to appease others, and it's just something that in my personal opinion doesn't need to be categorized.\n\nBut I digress. What is gender if it isn't these things? I appreciate any and all feedback.", "date": "2016-12-12 02:25:47", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hu2f5/im_an_outsider_and_i_really_really_want_to/", "author": "slayer_esc", "reference": 1519}, {"title": "People who can't see past a strawman", "text": "I'm always extremely hesitant now to tell people I'm nonbinary or use the terms \"cisgender\" in any discussion. Recently, I've been in, what turned into an argument, about Marc Jacobs and how I don't think that Marc Jacobs hiring Milk as a model is that progressive. I got a comment about it and I made a pretty qualifying statement explaining why I don't think a gay, cis, white man hiring another gay, cis, white man in an industry that has many gay, cis, white men dominating it is that progressive and that I would prefer Marc hire actual nonbinary/nonconforming identifying people or more queer poc in general. The person replied basically insulting me insinuating I was a tumblr user (which is an insult I see a lot every time anyone brings up anything about social issues) and basically acted like I thought Marc Jacobs was cisgender scum (Literally. Said. \"read for you: typical 'CIS GENDER SCUM'\". to me) despite the fact that I didn't say anything remotely close to being that radical in my original comment. \n\nI find this happens a lot (as I briefly mention with the \"tumblr\" insult) that I can't have any discussions with people who I know aren't likeminded about social issues because they immediately write me off with their strawman idea of an SJW. I don't know what to do. Unfortunately, instead of ignoring them, I always feel the need to get into arguments that draw out for a couple days until they stop replying (I'm pretty petty lmfao) or I'll block them. I ended up blocking this person initially but then I needed to reference back on the comments so I unblocked them and unfortunately saw their response and got sucked back into responding. Not sure how to deal with these types of people. Mainly what to say to them because I'm not a person who is comfortable with being passive. They always just....can't see past their fucking strawman and it blinds them from trying to have any real conversation. ", "date": "2016-12-12 06:35:51", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hv69x/people_who_cant_see_past_a_strawman/", "author": "sushiitaco", "reference": 1541}, {"title": "I'm a female who doesn't like their voice.", "text": "[deleted]", "date": "2016-12-12 16:38:18", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hxkj9/im_a_female_who_doesnt_like_their_voice/", "author": "[deleted]", "reference": 1570}, {"title": "So I came out to my friends.", "text": "They were all really accepting and supportive, I'm honestly really thankful for having such a diverse and supportive group of friends. ", "date": "2016-12-12 19:40:38", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hypmu/so_i_came_out_to_my_friends/", "author": "milkerfish", "reference": 1584}, {"title": "Still early on in my journey but would like more details from nonbinary/gender non-conforming people", "text": "I think I posted on here a few months back when I started questioning, but feel the need to post again. I'm 23, AFAB and as of late have been feeling more (transmasculine) nonbinary than anything else. \n\nI first of all thought that I was a binary trans guy as I feel that I would be comfortable identifying as male. But I think I struggled with that immensely. It felt like that didn't encapsulate the feminine/female aspects of myself properly and I was still thinking of myself as female identified. I have been questioning whether I would be able to live as male full time permanently and not want to detransition out of the blue, which I am unsure of. \n\nI've been doing a lot of self reflection, wondering if  whether I feel masculine/feminine rather than female/male. I think it's safe to say that I'm not 100% female at this point. I have a male aspect to me and in how I see myself too. I try to imagine fulfilling a female role in life (a mother, wife, sister or daughter) but that doesn't seem to fit me quite right. \n\nI'm currently experimenting wearing men's clothing (which I love), I tried binding (prefer my figure with it on), a masculine name and pronouns. I assumed I would be okay with he/him initially but they didn't fit right, neither do she/her although as it's early days I am still called these. So I think I'd like to try they/them out. \n\nI was wondering about a few things since it feels like there's more resource on binary trans people than for nonbinary. How you experience dysphoria (if you do), how you came to realise you were nonbinary and what being nonbinary means to you? I think that would help me a lot :)", "date": "2016-12-12 22:53:55", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5hzvwz/still_early_on_in_my_journey_but_would_like_more/", "author": "milo1000_", "reference": 1607}, {"title": "I shaved my head! (amab)", "text": "", "date": "2016-12-13 05:58:06", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5i1zfr/i_shaved_my_head_amab/", "author": "girlofthenorth", "reference": 1644}, {"title": "Any advice for someone seriously struggling with feeling valid in their gender identity?", "text": "I want to start this by saying that I would never doubt or disrespect anyone else's gender or pronoun usage. You're a guy? Cool! You're a girl? Nice! You're both, or neither, or some other combination? Sweet! But... for some reason, when it's about myself... I feel invalid. I feel like, as someone who is AFAB, me being nonbinary is just a \"tumblr stereotype\" (even though I hate it when people say that sort of thing and am quite fond of tumblr.) I feel like my mental illness (depression, anxiety, possible ptsd..? etc,) invalidates me- like there are too many \"different\" qualities in me, and I'm not valid. But... then again, I would NEVER even THINK these things about anyone else, EVER, and I've been thinking of myself as possibly being nonbinary for... about 2 years now, maybe more. I bind, I use they/them pronouns with a few people, a few people know me as a nonbinary person, I dress androgynously, I feel what I guess is dysphoria when I'm referred to with \"girl\" words, etc. I tried to just repress this but it just seemed to make it worse. Does anyone have any advice, words of encouragement, etc,? I'm... pretty stressed about this. Thanks.", "date": "2016-12-13 23:21:47", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5i6zyu/any_advice_for_someone_seriously_struggling_with/", "author": "QuaeEstInfernum", "reference": 1712}, {"title": "Any AFAB have experience with wearing boxers?", "text": "I'm interested in trying to wear something besides these god-awful bikini-cut panties I've had since puberty, but I'm super not interested in briefs/boxer briefs/\"\"boyshort\"\" cut underwear, because I really don't fancy the idea of them clinging to my legs like elastic. I hate clingy clothes - I only like elastic rims to make sure pants fit comfortably instead of falling off, and that's about it.\n\nBut I've read something about \"men's\" underwear having extra fabric in the front, which just sounds too roomy and annoying? I can't find anyone who makes \"women's\" boxers either, except as mislabeled boyshorts or as pajama pants. Those are nice and all and I particularly appreciate the Aeries designs for the blending of feminine design on a masculine underwear type, but they're still sleepwear and so tend to have bows and stuff that just sounds super uncomfortable if you'd be trying to wear it under pants. (For real though what's wrong with just making a pair of underwear that's not pajama pants and is still designed to fit AFAB bodies like. Seriously. God I hate the clothing industry...)\n\nSo I wanted to ask about AFAB experiences with \"men's\" boxers. Is the extra fabric annoying? How does it fit? Are they as comfortable as they look? Tips, tricks, warnings, recommendations, etc.?", "date": "2016-12-15 07:47:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5igbfy/any_afab_have_experience_with_wearing_boxers/", "author": "mortdepup", "reference": 1851}, {"title": "A few questions", "text": "Hi all,\n\nObviously there's been a lot of press surrounding non-binary people and gender identities, and I've ready some articles about things going on (mainly at universities) and I have some question.\n\nMy current understanding is that sex and gender are separate, as in sex is defined purely by your chromosomes?\n\nWhen discussing gender I get a little lost, and don't tend to follow the idea about how gender is for lack of a better word a \"scale\" or \"spectrum\".\n\nIn the case of sexual orientation, it is determined by your sexual attractions (gay, lesbian, bisexual, straight). How is your gender determined?\n\nI hope this doesn't come off as offensive, as I don't understand much at all. But for instance, take somebody who is male in all aspects of the gender, except they like to wear makeup or cross-dress is that person then non-binary to an extent?\n\nI'm not looking to start a debate here so if the mods see comments they don't like or if anything I say is below the belt, please let me know. I'm just looking to gain an understanding as people I've spoke to personally who are against the equality/social  issues faced by non-binary people, but they themselves are non-binary and haven't gave me enough of an understanding about being non-binary and what it means to a person.\n\nThank you.", "date": "2016-12-15 16:14:34", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5iicsk/a_few_questions/", "author": "Throwaway_asknb", "reference": 1878}, {"title": "[Serious] Non-binary people of Reddit, what challenges do you often face? • /r/AskReddit", "text": "", "date": "2016-12-17 07:24:14", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5itf2s/serious_nonbinary_people_of_reddit_what/", "author": "Mysanthropic", "reference": 2042}, {"title": "Presentation tips &amp; suggestions?", "text": "I don't know exactly how to phrase what I'm asking, and this is gonna be long &amp; rambly,  but...\n\nI'm pretty comfortable with my gender identity, though I keep taking parts of the word off and putting others on (androgynous, androgyous-fluid, androgynous-flux, etc etc lol).\n\nBut,  I have yet to really get into my groove as far as presentation. \n\nPartly because I grew up a 'tomboy' wearing jeans &amp; T-shirts, partly because shopping of any kind (on the rare occasion i can afford it) gives me incredible anxiety,  partly because I don't know how to put clothes together,and the rest of it is all about my body shape. \n\nI'm 5'2\" AFAB, the scale goes betwern 150-160 lbs on any given day, and it may just be me but i feel like i have a ridiculously short torso. My legs aren't that long, though. \n\ni would like to buy another binder, but also wonder if a compression bra of sorts would be easier on my ribs (possible pancreas/gallbladder problems???¿¿??)\n\nIdeally I'd be at least kind-of thin, long-bodied male-passing dude with long-ass hair, but i am not to the attainable parts of that yet. \nLike Yoichi from Drifters, ren from nu'est, etc...\n\nBut, sometimes I see an afab (usually cis girl) person, and I'm like... if I looked like them I'd be golden. ????\n\nI want to either have people question themselves when they see me (is that a guy or a girl?), look like a 'feminine' guy... (Ideally i would eventually have my voice lowered (there's surgery for that if I'm not mistaken))\n\nDoes any of this make sense? \n\nBut, like... What can I do? \n\nHow do I make my torso look longer? Hips/thighs less wide? How do I wear skirts &amp; dresses (and makeup?) without being pegged as a girl? would pics help? Or do I just need to be more, like, confident? \n\nIs this just me, or is this a very nonbinary feel? how in the heck does one assert for use of proper names/pronouns? \n\nLike, my life would be easier if I were surrounded by my friends all the time, bc they are all chill about it, but i see my friends at best 1 night every week or so (which sounds pretty frequent, but I spend 95% of the rest of my time at home)\n\nDoes your brain hurt after reading this? I am truly, madly, deeply sorry. \n\n", "date": "2016-12-18 08:45:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5izes6/presentation_tips_suggestions/", "author": "chullie", "reference": 2144}, {"title": "What is the difference between men and women?", "text": "I'm not sure if this is the right forum for this question and I might pop it over to R/asktransgender, but I'm curious. I have been seriously struggling with my gender recently. I saw a therapist and she told me to start logging daily on a scale how I felt gender wise. I've noticed that I have clear male and female swings but honestly, I can't explain why. What I'm trying to figure out is, what really is the difference between men, women, and enby? Like, obviously it's not genitalia, I am cautious to say there's any kind of psychological difference, and obviously it has nothing to do with hobbies and interests. I'm just curious how people on here answer it. Maybe it could shed some light. Thanks", "date": "2016-12-19 04:56:13", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5j4l2t/what_is_the_difference_between_men_and_women/", "author": "Reon98", "reference": 2233}, {"title": "Sexuality and gender is hard", "text": "I'm a demiboy (none or he/him, like my flair), but still present femininely and don't plan on transitioning. Therefore, I have the \"female experience\", I guess, and when discussing oppression/etc I'll say \"as a female\". I'm not really sure how to address this elegantly, but I'm very much read as a woman and experience life as a woman even though I'm not. It's weird and difficult and I feel like I'm an outsider but also an insider in \"female only\" safe spaces (for example, women's colleges/girls high schools).\nAlso I realized I'm not attracted to men recently and I don't know what words to use??? \"Nonbinary lesbian\" feels right but I'm not trying to exclude NB people, who I do experience attraction to. help I'm a meek gay who only knows 3 things :(", "date": "2016-12-19 06:33:12", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5j4ypg/sexuality_and_gender_is_hard/", "author": "dontthrowthatatme", "reference": 2242}, {"title": "vomit", "text": "[removed]", "date": "2016-12-19 06:38:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5j4ze9/vomit/", "author": "JonatanWest", "reference": 2243}, {"title": "You guys", "text": "[removed]", "date": "2016-12-20 03:02:09", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jav5f/you_guys/", "author": "Sasquatchwiththefro", "reference": 2341}, {"title": "Ask an Enby: Pronouns, Politics, and Love", "text": "", "date": "2016-12-20 20:19:21", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jfhoh/ask_an_enby_pronouns_politics_and_love/", "author": "Herb_Dino", "reference": 2415}, {"title": "Would you guys say I am non binary, trans, or just plain confused?", "text": "[deleted]", "date": "2016-12-20 22:35:24", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jg9yz/would_you_guys_say_i_am_non_binary_trans_or_just/", "author": "[deleted]", "reference": 2432}, {"title": "National Geographic's \"Gender Revolution\" January 2017 issue", "text": "", "date": "2016-12-21 01:08:03", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jh2tj/national_geographics_gender_revolution_january/", "author": "NatureNerdFace", "reference": 2447}, {"title": "author trying to accurately portray a character here, looking for feedback.", "text": "So, I already posted this in r/genderqueer, and I only got the one reply, accusing me of just trying to exploit the genderqueer community for personal gain. That's not what I'm about, though, and if I wanted to write a story just to pander and get readers, I can get a lot closer to the lowest common denominator than just including a genderqueer character. that's now how I roll. I take writing seriously.\n\nnow, I'm going to give the basic rundown of my protagonist's situation, and I'd like any feedback people can give, if they think it's too forced, if they think it sounds trite, whatever.\n\nso, things start out with a pair of low level nobles in a fantasy setting, having a baby girl. a doctor tells them they'll be unable to conceive again, and because of local laws and traditions, they need to have a male heir.\n\nthe baby is forcibly raised to be male. she has no choice in the matter. some days she feels fine with it, other days she wishes she could escape from it.\n\nthen she gets her wish. that medical person from before? apparently not super sure on how the body works in a rather low-tech, mid-level magic type of world, imagine that. they have a baby boy. She packs up her belongings, says her goodbyes, and ventures off into the world, excited to not have a future that is bound by what her parents are forcing her to be, and travels for a long while. but she still dresses and acts as a young man. because that's all she knows.\n\nplot happens, and eventually, with the help of a caring friend, she begins dressing and coding as a girl. and she loves it! she feels absolutely liberated. she has to be careful, because some people are closed minded and have swords, but she is enthralled with this part of her life she was never allowed to have.\n\nbut after a while of this, she's laying in bed, and she starts thinking...is this it? is this who she's going to be forever? she realizes that she doesn't want that. sometimes, she doesn't feel like a girl. if she just puts herself in that role forever, it'll be trading one prison for another.\n\nafter some soul searching as the story progresses, she realizes that she doesn't want to choose. she shouldn't have to choose. she's both. she's happy being both. and she's not going to give that up.\n\nthere's a lot more that's going to go into this story than that one aspect of this character's arc, but yeah. I would like to know if anyone sees any glaring problems with this as a gradual evolution of a character realizing they're genderqueer in a world where that doesn't exist as a known possibility.\n\nplease, don't just upvote, it doesn't tell me what I'm doing right, and don't just downvote, it doesn't tell me what I'm doing wrong.", "date": "2016-12-21 20:20:39", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jm5ha/author_trying_to_accurately_portray_a_character/", "author": "[deleted]", "reference": 2514}, {"title": "Another author hoping I'm doing right by the community", "text": "So I'm currently writing a scifi story that involves multiple universes. One character comes from an alternate earth like universe. In his community, everyone is identified as a man. There is no other gender. There is only the idea that some people can \"carry life\". And all people in this community after a certain age go through a ritual where they basically become incredibly masculine giants. This character was whisked away from their home right before they were meant to go through this ritual.\n\nThe protagonist of this story is a woman from our world, and this character meets with and travels with the protagonist as well as other characters from various walks of life. Of course, through this, the character learns about all sorts of forms of gender identity. \n\nThroughout the story, this character reveals that they always felt somehow disconnected from their community. In the beginning, they were upset and desperate to get home so they could continue their \"coming of age\" ceremony, because this character believes that this ceremony will solve all their problems and that they will finally find acceptance. \n\nHowever, as the character travels and learns more, they slowly start to realize that they were only getting the smallest glimpse of the true possibility of identity. And in the end, they start identifying as a woman (or possibly as nonbinary, this part is far from finalized).\n\nI wrote this very much as a parallel to being nonbinary. The idea that in our world, growing up, you're introduced to the \"fact\" that there are only two genders. It's also meant to highlight the problem of just saying \"it's ok because we're all the same, identity doesn't matter\". \n\nBut I worry I'm still blind to some things. While I am nonbinary, there is no way I can speak for everyone's experiences. ", "date": "2016-12-22 02:00:33", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jny6u/another_author_hoping_im_doing_right_by_the/", "author": "throwawaydddsssaaa", "reference": 2547}, {"title": "Questioning my gender identity", "text": "Hello, all,\n\nI've predominantly identified as female my whole life, but I feel like that doesn't adequately describe my gender identity.\n\nWhen I was four or five I adopted a male persona named Joey, who was my idea of the quintessential 90's guy: loud polo shirt, cargo shorts, backwards baseball cap, sunglasses, sneakers, too-cool-for-school attitude. My mom thought this was adorable/creative and encouraged me, while my dad low key freaked out about it. However, he was not super involved in my life and I had much more regard for my mom's opinion than his.\n\nIn second grade, I changed my name to Max. All my friends at school and my teacher were cool with it. Then one day, about two or three weeks in, I had a substitute teacher who gave me grief for it, so I went back to my girl name.\n\nMy mom was cool with the name change, though. Overall, she did a great job not strictly enforcing gender roles on my brother and me. She would never designate a Barbie as a \"girl toy\" or a Tonka truck as a \"boy toy,\" and would let either of us play with whatever toys we wanted. When other adults called me \"bossy,\" she would say that I was assertive or a leader. She taught my brother that it was okay to cry and otherwise express his feelings, and that his favorite color could indeed be pink. Once I declared that I no longer wanted to wear dresses or skirts, she accepted it and let me wear pants, shorts, and overalls. \n\nDespite the nuanced understanding of gender that she tried to foster, as I got older I saw that society regarded men and women, as well as masculinity and femininity, as binaries. I staunchly identified with everything masculine and eschewed all things feminine. All of my friends were boys, and I referred to myself as a tomboy.\n\nWhen I went through puberty, however, I started feeling more pressure to be feminine and present as a woman. I also developed a negative body image and self-esteem issues. Not being feminine no longer felt like a choice: it felt like I was too ugly to be a woman.\n\nNow that I'm older, I've become comfortable with and confident in myself. I went to a 90's costume party as Joey and felt super strong and confident adopting a masculine persona. I've recently cut my hair short, so my general look is fairly androgynous.\n\nWhen I was sixteen or seventeen, I began to identify as bisexual, and coming to that realization was a very nerve-wracking experience for me. More recently I started to identify as pansexual, and going through the questioning phase was less stressful this time. I'm more comfortable with not knowing now, so I'm sure I'll find a way to describe my gender identity, that feels right to me, with time and I'm fine if there's a wait.\n\nRight now I'm thinking I will probably identify as something other than female, but I'm not quite sure what term most suits me. Hence my post here. I want to do some research and learn more before coming to a determination.", "date": "2016-12-22 20:12:47", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jsqo9/questioning_my_gender_identity/", "author": "Lord_Penelope", "reference": 2637}, {"title": "What was it like when you first realized you were Nonbinary?", "text": "And what event(s) brought you to your gender (or agender) identity? \n\nHey I'm new to this sub Reddit, but glad there's community and support (I'm hoping at least!). \n\nWhat was it like for you? ", "date": "2016-12-22 21:46:38", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jta2i/what_was_it_like_when_you_first_realized_you_were/", "author": "deadpomelo", "reference": 2643}, {"title": "The Gender Tag Part One | Brittany and Samira", "text": "", "date": "2016-12-23 07:41:19", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jvy59/the_gender_tag_part_one_brittany_and_samira/", "author": "brittanyandsamira", "reference": 2693}, {"title": "advice for a queer traveller?", "text": "just in terms of safety and encountering homophobia/transphobia. a lot of the time i can't just leave that person, its always an uber driver, or a person in my hostel dorm, or a friend I've made who has a difficult time understanding and makes everything about my genitals lol", "date": "2016-12-23 16:53:17", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5jy1tw/advice_for_a_queer_traveller/", "author": "boioh", "reference": 2715}, {"title": "9 months HRT. I'm on the right in the black and white photo, if anyone is confused.", "text": "", "date": "2016-12-25 03:17:29", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5k6l4q/9_months_hrt_im_on_the_right_in_the_black_and/", "author": "CharityNicole121", "reference": 2854}, {"title": "Left Hand of Darkness (Nonbinary Stories)", "text": "Since I was reminded of this in another thread, I wanted to bring it up here.\n\nI remember when I read Left Hand of Darkness by Ursula Leguin in high school, I felt oddly connected to it. My teacher taught it from the perspective of a feminist sci fi world construction, which it undeniably is, but I felt somehow really into this world on a deeper level. I genuinely wanted to be like the aliens in the book, where they were typically androgynous but could change gender depending on the contexts (it has been a long time since I've read the book so forgive me if I'm misremembering some things).\n\nI've also found myself obsessed with shape shifting characters as I grew up, especially if they were show switching between male and female forms. I always told people that shape shifting would be the superpower I'd want, obstensibly saying it's the perfect way to cheat into having all the powers you'd want (want to fly? Turn into a bird. Want to be invincible? You're a rock now. Super strength? Giant ant.) but even then, in my head, I'd think about how I'd probably typically use this power to switch between genders at will. \n\nObviously, this is mostly impossible. I can't exactly just go \"welp, I'm feeling masculine this week, time for some T\" to \"this week's girl's week so let's go that way.\" Clothes and presentation can only do so much, especially on my overtly feminine body (it's lovely when your boobs basically stretch your binder into a tight tank top). \n\nBut I still take some inspiration from these stories and characters. Are there stories/characters that you guys take these same thoughts from? ", "date": "2016-12-25 04:04:26", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5k6r5s/left_hand_of_darkness_nonbinary_stories/", "author": "throwawaydddsssaaa", "reference": 2859}, {"title": "Vegan Gains Pro Trans Rights", "text": "", "date": "2016-12-25 09:18:49", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5k7q25/vegan_gains_pro_trans_rights/", "author": "ItsVertex", "reference": 2877}, {"title": "In a relationship with nb partner, what should I know?", "text": "[deleted]", "date": "2016-12-25 23:15:57", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5kap8o/in_a_relationship_with_nb_partner_what_should_i/", "author": "[deleted]", "reference": 2927}, {"title": "The Gender Tag Part Two | Brittany and Samira", "text": "", "date": "2016-12-28 03:48:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ko4oq/the_gender_tag_part_two_brittany_and_samira/", "author": "brittanyandsamira", "reference": 3159}, {"title": "Finding a roommate as a nonbinary person ...", "text": "How did you do it? \n\nSure I've lived with my (now ex-) SO's. I've also lived with an actual (platonic) roommate in the past. \n\nThis time is different. I've passed as CIS (I was amab btw, and I'm not out to most yet. I'm working on it ...). So yeah, I'm about to post an ad, but am wondering if anyone has more experience\n\nAt this point I need to find a roommate that is ok w living with someone who's non binary. I just can't deal with invalidation anymore tbh. I don't have the money to just get my own place to myself. Not in my part of the country at least. I'm working on that too. So ...\n\nHow did you do it? Like did you post an ad and were you open about being non binary? What was it like for you? \n\n", "date": "2016-12-28 18:42:42", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5krt44/finding_a_roommate_as_a_nonbinary_person/", "author": "deadpomelo", "reference": 3214}, {"title": "FtNB top surgery photos?", "text": "I've been looking for years to find any photographic reference for almost-but-not-quite FtM top surgery. I've got what used to be large D breasts that have deflated to a large C. \n\nI'd like A cup breasts. Breasts that don't need a binder or a bra, but aren't 100 percent removed. Androgynous A cups. \n\nPlease share with me any before and after photographs you've found!\n\n", "date": "2016-12-28 21:41:01", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5kstdy/ftnb_top_surgery_photos/", "author": "creepyriver", "reference": 3233}, {"title": "Something awesome happened", "text": "Someone finally didn't assume my gender! It was a little kid at a giant indoor trampoline park, but still; Someone asked what my gender was. \n\nThat's the first time that happened!", "date": "2016-12-29 17:34:30", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ky0pk/something_awesome_happened/", "author": "TeresaCake", "reference": 3319}, {"title": "Should I make my coming out a big thing?", "text": "I'm thinking of coming out to my parents today, and I've been closeted for so long that I sort of want to make a big deal of this. With, like, the Nonbinary flag colors, and maybe something rainbow, and maybe making little brochures explaining what Nonbinary is, and little Nonbinary flags....Basically make a coming out party.\n\nEither way I'm doing the brochures.\n\n", "date": "2016-12-29 17:43:45", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ky2ob/should_i_make_my_coming_out_a_big_thing/", "author": "TeresaCake", "reference": 3320}, {"title": "Gendered honorifics in public: your thoughts / feelings on them?", "text": "Hey ! I'm really curious about how you think / feel about gender-assumed honorifics. Opinions? And why? \n\nEx: \"What can I do for you, sir?\" \n\n\"Ma'am, can I help you find anything?\"\n\n\"Miss? ...\" etc. \n\nI'll post my thoughts in a bit ! ", "date": "2016-12-29 18:06:11", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5ky7i8/gendered_honorifics_in_public_your_thoughts/", "author": "deadpomelo", "reference": 3324}, {"title": "A quick thank you", "text": "A quick thank you to the cashier at Walmart who didn't mention that I was buying a bra. I know I had my headphones in, but I know she knew they weren't playing anything.", "date": "2016-12-30 04:43:59", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5l1k6k/a_quick_thank_you/", "author": "nborqingmtf", "reference": 3383}, {"title": "Nonbinary YouTuber starting up :)", "text": "", "date": "2016-12-30 09:16:23", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5l2l99/nonbinary_youtuber_starting_up/", "author": "saintmau", "reference": 3407}, {"title": "Non-competitive athletics and appearance/ID mismatch", "text": "I'm thinking of doing some ultrahike events this year (20+ miles with a time limit. Some people do them as trail runs but running is for the birds.) The sign up sheets want a gender indicated. They aren't competitive (i.e. your \"prize\" is a certificate of completion and a T-shirt) so there's no question of cheating. Presumably they just want it for statistics. My ID says F. At casual glance I rarely read as F anymore, especially in athletic clothes. Does anyone do these sorts of things? Do you contact the organizers to disclose and ask which you should indicate, or show up trying to pass as what your ID says?\n\n(x-posted) ", "date": "2016-12-30 16:39:41", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5l4bqo/noncompetitive_athletics_and_appearanceid_mismatch/", "author": "Ebomb1", "reference": 3428}, {"title": "Help!?!!!???!???!!!", "text": "ok, so recently I discovered gender queerness and I came to the \"conclusion\" that I'm non binary and idk how to or if I should come out to my parents, my mom would totally be supportive and understanding and would make an effort to use they/them pronouns but my dad on the other hand sighs and frowns whenever I do something feminine... They wouldn't kick me out or anything but my dad wouldn't be the most supportive Nd we would probably but heads. ", "date": "2016-12-31 03:38:15", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5l7ptu/help/", "author": "iangrantmcneil", "reference": 3494}, {"title": "Fuck your standards of femininity (amab)", "text": "", "date": "2016-12-31 16:13:57", "subreddit": "NonBinary", "permalink": "/r/NonBinary/comments/5laak0/fuck_your_standards_of_femininity_amab/", "author": "girlofthenorth", "reference": 3546}]