[{"title": "Welcome to /r/truscum", "text": "The trans community on Reddit, IMO, has a rather significant gap. While there are a number of trans-centric subreddits, they tend to be rather cheerleady and embrace the \"whatever you say whenever and whyever you say it\" approach to transgender identities. In my personal opinion, the radical redefinition/expansion of the term \"transgender\" has rendered it effectively meaningless, and is presently setting up a great deal of confusion and causing problems in the real world for transitioned people and cis people alike.\n\n/r/truscum is a subreddit for people who believe (minimally) that...\n\n* Gender dysphoria (\"body/physical dysphoria\") is necessary is to be trans; people without it are, by definition, cis *(whether they're gender non-conforming or not)*.\n* Gender \"euphoria\", when not simply the inverted impression left by poorly understood dysphoria, is BS and not a substitute\n* Medical transition is significant, and carries weight\n * While there are medical contraindications to HRT, cross-sex hormone therapy has significant effects that are meaningful to our lived experiences and the way we perceive and relate with the world around us\n * Anatomy is modifiable surgically and otherwise, but while there are men with vaginas and women with penises, there are no female penises, and there are no male vaginas.\n* \"Trans\" is not in and of itself a gender identity; it is a condition of being\n * Trans is an adjective describing a biological reality; it's not a gender identity by itself\n * You may be e.g. an AMAB trans woman or an AFAB trans man, but trans is merely an adjective describing the disconnect between your birth sex and your gender identity\n\nBoth cis and trans people are welcome here. People who disagree with the above are welcome, so long as they are respectful. Intelligent, rational debate and discussion are to be valued. Anybody who uses intentional slurs (full list coming soon) or other hateful language against either cis or trans folks here will be moderated. Cis is *specifically* not a dirty word here - complaints about it will be moderated.\n\nWelcome.", "date": "2016-08-30 05:11:06", "subreddit": "truscum", "permalink": "/r/truscum/comments/509h5s/welcome_to_rtruscum/", "author": "truscum_mod", "reference": 2767}]